[
  {
    "id": 1877,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/shine-100-standard/specifications",
    "specsContent": "<p>Honda Shine 100 standard is powered by a 100 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Honda Shine 100 standard specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Honda Shine 100 standard price is ₹64,900 in India. Honda Shine 100 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Honda Shine 100 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Shine 100 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Honda Shine 100 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 882,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/shine-celebration-edition-drum/specifications",
    "specsContent": "<p>Honda Shine Celebration Edition - Drum is powered by a 124 CC Air Cooled, 4 Stroke, BS-VI Engine engine. The powerful engine produces 10.59 bhp @ 7500 rpm and 11 Nm @ 6000 rpm, ensuring the user gets the smoothest drive-off experience. Honda Shine Celebration Edition - Drum specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Honda Shine Celebration Edition - Drum price is ₹80,817 in India. Honda Shine Celebration Edition - Drum BS6 specifications include a total fuel tank capacity of 10.5 L, letting you cover longer distances without worrying about refuelling. Honda Shine Celebration Edition - Drum comes equipped with Disc brakes and has a tyre size- Front :80/100-18, Rear : 80/100-18, giving maximum stability to the user. Shine Celebration Edition - Drum engine is aligned with the Multiplate Wet Clutch clutch, 5 Speed gearbox and Manual transmission. To know in detail about Honda Shine Celebration Edition - Drum technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1076,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/platina-110-es-drum-bs-vi/specifications",
    "specsContent": "<p>Bajaj Platina 110 ES Drum - BS VI is powered by a 115.45 CC 4 Stroke, Single Cylinder engine. The powerful engine produces 8.48 bhp @ 7000 rpm and 9.81 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Bajaj Platina 110 ES Drum - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 70 Kmpl , enabling you to cover extra miles. Bajaj Platina 110 ES Drum - BS VI price is ₹68,544 in India. Bajaj Platina 110 ES Drum - BS VI BS6 specifications include a total fuel tank capacity of 11 l, letting you cover longer distances without worrying about refuelling. Bajaj Platina 110 ES Drum - BS VI comes equipped with Disc brakes and has a tyre size- Front :80/100-17, Rear :80/100-17, giving maximum stability to the user. Platina 110 ES Drum - BS VI engine is aligned with the N/A clutch, 5 Speed gearbox and Manual transmission. To know in detail about Bajaj Platina 110 ES Drum - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1535,
    "url": "https://bikes.tractorjunction.com/en/benda-bikes/lfc-700-standard/specifications",
    "specsContent": "<p>Benda LFC 700 standard is powered by a 680 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Benda LFC 700 standard specifications and features include an advanced tech engine, offering a decent mileage of 20-30 Kmpl , enabling you to cover extra miles. Benda LFC 700 standard price is ₹8 Lakh in India. Benda LFC 700 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Benda LFC 700 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. LFC 700 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Benda LFC 700 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 820,
    "url": "https://bikes.tractorjunction.com/en/ktm-bikes/250-duke-standard/specifications",
    "specsContent": "<p>KTM 250 Duke Standard is powered by a 248.8 CC Single Cylinder, 4 Valve, Liquid Cooled, FI, DOHC engine. The powerful engine produces 29.59 bhp @ 9000 rpm and 24 Nm @ 7500 rpm, ensuring the user gets the smoothest drive-off experience. KTM 250 Duke Standard specifications and features include an advanced tech engine, offering a decent mileage of 30.8 Kmpl , enabling you to cover extra miles. KTM 250 Duke Standard price is ₹2.37 Lakh in India. KTM 250 Duke Standard BS6 specifications include a total fuel tank capacity of 13.5 L, letting you cover longer distances without worrying about refuelling. KTM 250 Duke Standard comes equipped with Disc brakes and has a tyre size- Front :110/70-17, Rear :150/60-17, giving maximum stability to the user. 250 Duke Standard engine is aligned with the Assist &amp; Slipper clutch, 6 Speed gearbox and Manual transmission. To know in detail about KTM 250 Duke Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 990,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/suzuki/burgman-street-electric-standard/specifications",
    "specsContent": "<p>Suzuki Burgman Street Electric Standard is powered by a 12 V/4 Ah battery which takes 4-6 Hrs to fully charge. Burgman Street Electric Standard has a range of 90 Km/charge, letting you cover extra miles. With Burgman Street Electric Standard you can get a top speed of 96.2 with the smoothest drive-off experience. Suzuki Burgman Street Electric Standard price starts from ₹1.05 Lakh in India. Suzuki Burgman Street Electric Standard specifications include -- brakes and has a tyre size - Front: --Rear: --, giving maximum stability to the user. To know in detail about Suzuki Burgman Street Electric Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1204,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/hness-cb350-dlx/specifications",
    "specsContent": "<p>Honda Hness CB350 DLX is powered by a 348.36 CC 4 Stroke, SI Engine, BS-VI engine. The powerful engine produces 20.78 bhp @ 5500 rpm and 30 Nm @ 3000 rpm, ensuring the user gets the smoothest drive-off experience. Honda Hness CB350 DLX specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. Honda Hness CB350 DLX price is ₹1.16 Lakh in India. Honda Hness CB350 DLX BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Honda Hness CB350 DLX comes equipped with Disc brakes and has a tyre size- Front :100/90-19 Rear :130/70-18, giving maximum stability to the user. Hness CB350 DLX engine is aligned with the Multiplate Wet Clutch clutch, 5 Speed gearbox and Manual transmission. To know in detail about Honda Hness CB350 DLX technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 815,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/z900-standard/specifications",
    "specsContent": "<p>Kawasaki Z900 Standard is powered by a 948 CC Liquid-cooled, 4-stroke In-Line Four engine. The powerful engine produces 123.29 bhp @ 9500 rpm and 98.6 Nm @ 7700 rpm, ensuring the user gets the smoothest drive-off experience. Kawasaki Z900 Standard specifications and features include an advanced tech engine, offering a decent mileage of 15.26 Kmpl , enabling you to cover extra miles. Kawasaki Z900 Standard price is ₹9.02 Lakh in India. Kawasaki Z900 Standard BS6 specifications include a total fuel tank capacity of 17 L, letting you cover longer distances without worrying about refuelling. Kawasaki Z900 Standard comes equipped with Double Disc brakes and has a tyre size- Front :120/70-17 Rear :180/55-17, giving maximum stability to the user. Z900 Standard engine is aligned with the Wet multi-disc, manual clutch, 6 Speed gearbox and Manual transmission. To know in detail about Kawasaki Z900 Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 880,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/ninja-zx-10r-standard/specifications",
    "specsContent": "<p>Kawasaki Ninja ZX-10R Standard is powered by a 998 CC Liquid-cooled, 4-stroke In-Line Four engine. The powerful engine produces 200.22 bhp @ 13200 rpm and 114.9 Nm @ 11400 rpm, ensuring the user gets the smoothest drive-off experience. Kawasaki Ninja ZX-10R Standard specifications and features include an advanced tech engine, offering a decent mileage of 12 Kmpl , enabling you to cover extra miles. Kawasaki Ninja ZX-10R Standard price is ₹16.15 Lakh in India. Kawasaki Ninja ZX-10R Standard BS6 specifications include a total fuel tank capacity of 17 L, letting you cover longer distances without worrying about refuelling. Kawasaki Ninja ZX-10R Standard comes equipped with Double Disc brakes and has a tyre size- Front :120/70ZR17 Rear :190/55ZR17, giving maximum stability to the user. Ninja ZX-10R Standard engine is aligned with the Wet multi-disc, manual clutch, 6 Speed gearbox and Manual transmission. To know in detail about Kawasaki Ninja ZX-10R Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1514,
    "url": "https://bikes.tractorjunction.com/en/indian-bikes/springfield-dark-horse-standard/specifications",
    "specsContent": "<p>Indian Springfield Dark Horse standard is powered by a 180 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Indian Springfield Dark Horse standard specifications and features include an advanced tech engine, offering a decent mileage of 20 Kmpl , enabling you to cover extra miles. Indian Springfield Dark Horse standard price falls between ₹29.56 Lakh to ₹33.17 Lakh in India. Indian Springfield Dark Horse standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Indian Springfield Dark Horse standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Springfield Dark Horse standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Indian Springfield Dark Horse standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 847,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/cb350-brigade-standard/specifications",
    "specsContent": "<p>Honda CB350 Brigade Standard is powered by a 350 CC Not Available engine. The powerful engine produces -- and --, ensuring the user gets the smoothest drive-off experience. Honda CB350 Brigade Standard specifications and features include an advanced tech engine, offering a decent mileage of 35 Kmpl , enabling you to cover extra miles. Honda CB350 Brigade Standard price is ₹2 Lakh in India. Honda CB350 Brigade Standard BS6 specifications include a total fuel tank capacity of --, letting you cover longer distances without worrying about refuelling. Honda CB350 Brigade Standard comes equipped with -- brakes and has a tyre size- N/A, giving maximum stability to the user. CB350 Brigade Standard engine is aligned with the -- clutch, -- gearbox and Manual transmission. To know in detail about Honda CB350 Brigade Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1321,
    "url": "https://bikes.tractorjunction.com/en/suzuki-scooters/access-125-disc-cbs-fi/specifications",
    "specsContent": "<p>Suzuki Access 125 Disc - CBS - Fi is powered by a 124 CC 4- Stroke, 1-Cylinder, Air Cooled engine. The powerful engine produces 8.58 bhp @ 6750 rpm and 10 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Suzuki Access 125 Disc - CBS - Fi specifications and features include an advanced tech engine, offering a decent mileage of 52.45 Kmpl , enabling you to cover extra miles. Suzuki Access 125 Disc - CBS - Fi price is ₹81,300 in India. Suzuki Access 125 Disc - CBS - Fi BS6 specifications include a total fuel tank capacity of 5 L, letting you cover longer distances without worrying about refuelling. Suzuki Access 125 Disc - CBS - Fi comes equipped with Disc brakes and has a tyre size- Front :90/90-12, Rear :90/100-10, giving maximum stability to the user. Access 125 Disc - CBS - Fi engine is aligned with the N/A clutch, CVT gearbox and Automatic transmission. To know in detail about Suzuki Access 125 Disc - CBS - Fi technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 885,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-disc-2022/specifications",
    "specsContent": "<p>TVS Apache RTR 160 Disc (2022) is powered by a 159.7 CC Air Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 15.31 bhp @ 8,400 rpm and 13.9 Nm @ 7,000 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 Disc (2022) specifications and features include an advanced tech engine, offering a decent mileage of 50 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 Disc (2022) price is ₹1.22 Lakh in India. TVS Apache RTR 160 Disc (2022) BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 Disc (2022) comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 Disc (2022) engine is aligned with the Wet, Multi Plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 Disc (2022) technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1034,
    "url": "https://bikes.tractorjunction.com/en/yamaha-scooters/ray-zr-125-hybrid-drum/specifications",
    "specsContent": "<p>Yamaha Ray ZR 125 Hybrid Drum is powered by a 125 CC Air cooled, 4-stroke,SOHC, 2-valve engine. The powerful engine produces 8.09 bhp @ 6500 rpm and 10.3 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Yamaha Ray ZR 125 Hybrid Drum specifications and features include an advanced tech engine, offering a decent mileage of 52 Kmpl , enabling you to cover extra miles. Yamaha Ray ZR 125 Hybrid Drum price is ₹83,730 in India. Yamaha Ray ZR 125 Hybrid Drum BS6 specifications include a total fuel tank capacity of 5.2 L, letting you cover longer distances without worrying about refuelling. Yamaha Ray ZR 125 Hybrid Drum comes equipped with Disc brakes and has a tyre size- Front :90/90-12 Rear :110/90-10, giving maximum stability to the user. Ray ZR 125 Hybrid Drum engine is aligned with the Dry, Centrifugal clutch, V-Belt Automatic gearbox and Automatic transmission. To know in detail about Yamaha Ray ZR 125 Hybrid Drum technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1005,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/radeon-dual-tone-drum/specifications",
    "specsContent": "<p>TVS Radeon Dual Tone - Drum is powered by a 109.7 CC 4 Stroke Duralife Engine engine. The powerful engine produces 8.08 bhp @ 7350 rpm and 8.7 Nm @ 4500 rpm, ensuring the user gets the smoothest drive-off experience. TVS Radeon Dual Tone - Drum specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. TVS Radeon Dual Tone - Drum price is ₹74,834 in India. TVS Radeon Dual Tone - Drum BS6 specifications include a total fuel tank capacity of 10 L, letting you cover longer distances without worrying about refuelling. TVS Radeon Dual Tone - Drum comes equipped with Disc brakes and has a tyre size- Front :2.75-18, Rear : 3.00-18, giving maximum stability to the user. Radeon Dual Tone - Drum engine is aligned with the Wet, multiple-disc clutch, 4 Speed gearbox and Manual transmission. To know in detail about TVS Radeon Dual Tone - Drum technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1037,
    "url": "https://bikes.tractorjunction.com/en/yamaha-scooters/fascino-125-hybrid-drum/specifications",
    "specsContent": "<p>Yamaha Fascino 125 Hybrid - Drum is powered by a 125 CC Air-cooled, 4-stroke, SOHC, 2-valve engine. The powerful engine produces 8.09 bhp @ 6500 rpm and 10.3 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Yamaha Fascino 125 Hybrid - Drum specifications and features include an advanced tech engine, offering a decent mileage of 68.75 Kmpl , enabling you to cover extra miles. Yamaha Fascino 125 Hybrid - Drum price is ₹78,600 in India. Yamaha Fascino 125 Hybrid - Drum BS6 specifications include a total fuel tank capacity of 5.2 L, letting you cover longer distances without worrying about refuelling. Yamaha Fascino 125 Hybrid - Drum comes equipped with Disc brakes and has a tyre size- Front : 90/90-12 Rear :110/90-10, giving maximum stability to the user. Fascino 125 Hybrid - Drum engine is aligned with the N/A clutch, V-belt automatic gearbox and Automatic transmission. To know in detail about Yamaha Fascino 125 Hybrid - Drum technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1063,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/maestro-edge-125-drum-2021/specifications",
    "specsContent": "<p>Hero Maestro Edge 125 Drum - 2021 is powered by a 124.6 CC Air Cooled, 4-Stroke, SI Engine engine. The powerful engine produces 8.98 bhp @ 7000 rpm and 10.4 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Hero Maestro Edge 125 Drum - 2021 specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Hero Maestro Edge 125 Drum - 2021 price is ₹77,896 in India. Hero Maestro Edge 125 Drum - 2021 BS6 specifications include a total fuel tank capacity of 5 L, letting you cover longer distances without worrying about refuelling. Hero Maestro Edge 125 Drum - 2021 comes equipped with Disc brakes and has a tyre size- Front :80/100 - 18 Rear :100/80 - 18, giving maximum stability to the user. Maestro Edge 125 Drum - 2021 engine is aligned with the Dry, Centrifugal clutch, Variomatic Drive gearbox and Automatic transmission. To know in detail about Hero Maestro Edge 125 Drum - 2021 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 930,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/ninja-300-standard/specifications",
    "specsContent": "<p>Kawasaki Ninja 300 Standard is powered by a 296 CC Liquid Cooled , 2 Cylinder, 4 Valve engine. The powerful engine produces 38.88 bhp @ 11,000 rpm and 26.1 Nm @ 10,000 rpm , ensuring the user gets the smoothest drive-off experience. Kawasaki Ninja 300 Standard specifications and features include an advanced tech engine, offering a decent mileage of 32.1 Kmpl , enabling you to cover extra miles. Kawasaki Ninja 300 Standard price is ₹3.4 Lakh in India. Kawasaki Ninja 300 Standard BS6 specifications include a total fuel tank capacity of 17 L, letting you cover longer distances without worrying about refuelling. Kawasaki Ninja 300 Standard comes equipped with Disc brakes and has a tyre size- Front:110/70 - R17 Rear:140/70 - R17 , giving maximum stability to the user. Ninja 300 Standard engine is aligned with the Assist and Slipper Clutch clutch, 1 Down 5 Up gearbox and 6 Speed Manual transmission. To know in detail about Kawasaki Ninja 300 Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1020,
    "url": "https://bikes.tractorjunction.com/en/yamaha-bikes/r15-v4-m/specifications",
    "specsContent": "<p>Yamaha R15 V4 M is powered by a 155 CC Liquid-cooled, 4-stroke, SOHC, 4-valve engine. The powerful engine produces 18.15 bhp @ 10000 rpm and 14.2 Nm @ 7500 rpm, ensuring the user gets the smoothest drive-off experience. Yamaha R15 V4 M specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. Yamaha R15 V4 M price is ₹1.89 Lakh in India. Yamaha R15 V4 M BS6 specifications include a total fuel tank capacity of 11 L, letting you cover longer distances without worrying about refuelling. Yamaha R15 V4 M comes equipped with Disc brakes and has a tyre size- Front :100/80-17, Rear :140/70R17, giving maximum stability to the user. R15 V4 M engine is aligned with the Wet, multiple-disc clutch, 6 Speed gearbox and Manual transmission. To know in detail about Yamaha R15 V4 M technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1297,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/passion-pro-drum-bs-vi/specifications",
    "specsContent": "<p>Hero Passion Pro Drum - BS VI is powered by a 113.2 CC Air cooled 4 stroke engine. The powerful engine produces 6.73 KW @ 7500 rpm and 9.89 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Hero Passion Pro Drum - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 60 Kmpl , enabling you to cover extra miles. Hero Passion Pro Drum - BS VI price is ₹74,408 in India. Hero Passion Pro Drum - BS VI BS6 specifications include a total fuel tank capacity of 10 L, letting you cover longer distances without worrying about refuelling. Hero Passion Pro Drum - BS VI comes equipped with Drum brakes and has a tyre size- Front :80/100-18, Rear : 80/100-18, giving maximum stability to the user. Passion Pro Drum - BS VI engine is aligned with the Multi Plate clutch, Constant Mesh 4 Speed gearbox and Manual transmission. To know in detail about Hero Passion Pro Drum - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1316,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/hf-deluxe-self-alloy-bs6/specifications",
    "specsContent": "<p>Hero HF Deluxe Self Alloy BS6 is powered by a 97.2 CC Air cooled, 4-stroke, Single cylinder, OHC engine. The powerful engine produces 7.91 bhp @ 8000 rpm and 8.05 Nm @ 6000 rpm, ensuring the user gets the smoothest drive-off experience. Hero HF Deluxe Self Alloy BS6 specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Hero HF Deluxe Self Alloy BS6 price is ₹65,638 in India. Hero HF Deluxe Self Alloy BS6 BS6 specifications include a total fuel tank capacity of 9.6 L, letting you cover longer distances without worrying about refuelling. Hero HF Deluxe Self Alloy BS6 comes equipped with Drum brakes and has a tyre size- Front :2.75-18 Rear :2.75-18, giving maximum stability to the user. HF Deluxe Self Alloy BS6 engine is aligned with the Multiplate Wet Type clutch, 4 speed Constant Mesh gearbox and Manual transmission. To know in detail about Hero HF Deluxe Self Alloy BS6 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1288,
    "url": "https://bikes.tractorjunction.com/en/tvs-scooters/jupiter-standard/specifications",
    "specsContent": "<p>TVS Jupiter Standard is powered by a 109.7 CC Air Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 7.37 bhp @ 7,000 rpm and 8.4 Nm @ 5,500 rpm , ensuring the user gets the smoothest drive-off experience. TVS Jupiter Standard specifications and features include an advanced tech engine, offering a decent mileage of 60.44 Kmpl , enabling you to cover extra miles. TVS Jupiter Standard price is ₹75,488 in India. TVS Jupiter Standard BS6 specifications include a total fuel tank capacity of 6 L, letting you cover longer distances without worrying about refuelling. TVS Jupiter Standard comes equipped with Drum brakes and has a tyre size- Front:90/90 - 12 Rear:90/90 - 12 , giving maximum stability to the user. Jupiter Standard engine is aligned with the Automatic clutch, Automatic gearbox and Automatic transmission. To know in detail about TVS Jupiter Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 837,
    "url": "https://bikes.tractorjunction.com/en/ktm-bikes/200-duke-standard/specifications",
    "specsContent": "<p>KTM 200 Duke Standard is powered by a 199.5 CC Single Cylinder, 4 Valve, Liquid Cooled, FI, DOHC engine. The powerful engine produces 25.48 bhp @ 10,000 rpm and 19.5 Nm @ 8000 rpm, ensuring the user gets the smoothest drive-off experience. KTM 200 Duke Standard specifications and features include an advanced tech engine, offering a decent mileage of 35 Kmpl , enabling you to cover extra miles. KTM 200 Duke Standard price is ₹1.92 Lakh in India. KTM 200 Duke Standard BS6 specifications include a total fuel tank capacity of 13.5 L, letting you cover longer distances without worrying about refuelling. KTM 200 Duke Standard comes equipped with Disc brakes and has a tyre size- Front :110/70-17, Rear :150/60-17, giving maximum stability to the user. 200 Duke Standard engine is aligned with the Wet Multi-Disc clutch, 6 Speed gearbox and Manual transmission. To know in detail about KTM 200 Duke Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1845,
    "url": "https://bikes.tractorjunction.com/en/ktm-bikes/duke-250-obd2/specifications",
    "specsContent": "<p>KTM Duke 250 OBD2 is powered by a 248.8 CC N/A engine. The powerful engine produces 29.5 bhp @ 9,000rpm and 24 Nm @ 7,500rpm, ensuring the user gets the smoothest drive-off experience. KTM Duke 250 OBD2 specifications and features include an advanced tech engine, offering a decent mileage of 41 Kmpl , enabling you to cover extra miles. KTM Duke 250 OBD2 price is ₹2.38 Lakh in India. KTM Duke 250 OBD2 BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. KTM Duke 250 OBD2 comes equipped with Disc brakes and has a tyre size- N/A, giving maximum stability to the user. Duke 250 OBD2 engine is aligned with the Slipper clutch clutch, 6 Speed gearbox and Manual transmission. To know in detail about KTM Duke 250 OBD2 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1842,
    "url": "https://bikes.tractorjunction.com/en/honda-scooters/activa-125-2023/specifications",
    "specsContent": "<p>Honda Activa 125 (2023) is powered by a 123.97 CC Fan Cooled &amp; 4 Stroke &amp; BS-VI Engine engine. The powerful engine produces 8.29 PS @ 6500 rpm and 10.3 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Honda Activa 125 (2023) specifications and features include an advanced tech engine, offering a decent mileage of 50 Kmpl , enabling you to cover extra miles. Honda Activa 125 (2023) price is ₹78,920 in India. Honda Activa 125 (2023) BS6 specifications include a total fuel tank capacity of 5.3 L, letting you cover longer distances without worrying about refuelling. Honda Activa 125 (2023) comes equipped with Disc brakes and has a tyre size- Front : 90/90 R12, Rear : 90/100 R10, giving maximum stability to the user. Activa 125 (2023) engine is aligned with the V-matic clutch, N/A gearbox and Automatic transmission. To know in detail about Honda Activa 125 (2023) technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1121,
    "url": "https://bikes.tractorjunction.com/en/jawa-bikes/42-version-2-1/specifications",
    "specsContent": "<p>Jawa 42 Version 2.1 is powered by a 293 CC Single Cylinder, 4 Stroke, Liquid Cooled, DOHC engine. The powerful engine produces 26.96 bhp and 27.02 Nm, ensuring the user gets the smoothest drive-off experience. Jawa 42 Version 2.1 specifications and features include an advanced tech engine, offering a decent mileage of 33 Kmpl , enabling you to cover extra miles. Jawa 42 Version 2.1 price is ₹1.81 Lakh in India. Jawa 42 Version 2.1 BS6 specifications include a total fuel tank capacity of 14 L, letting you cover longer distances without worrying about refuelling. Jawa 42 Version 2.1 comes equipped with Disc brakes and has a tyre size- Front :90/90-18 Rear :120/80-17, giving maximum stability to the user. 42 Version 2.1 engine is aligned with the N/A clutch, 6 Speed gearbox and Manual transmission. To know in detail about Jawa 42 Version 2.1 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1239,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/sport-kick-start-alloy-bs6/specifications",
    "specsContent": "<p>TVS Sport Kick Start Alloy BS6 is powered by a 109.7 CC Single Cylinder, 4 Stroke, fuel injection , air cooled spark ignition engine engine. The powerful engine produces 8.18 bhp @ 7350 rpm and 8.7 Nm @ 4500 rpm, ensuring the user gets the smoothest drive-off experience. TVS Sport Kick Start Alloy BS6 specifications and features include an advanced tech engine, offering a decent mileage of 70 Kmpl , enabling you to cover extra miles. TVS Sport Kick Start Alloy BS6 price is ₹64,050 in India. TVS Sport Kick Start Alloy BS6 BS6 specifications include a total fuel tank capacity of 10 L, letting you cover longer distances without worrying about refuelling. TVS Sport Kick Start Alloy BS6 comes equipped with Drum brakes and has a tyre size- Front :2.75-17, Rear :3.0-17, giving maximum stability to the user. Sport Kick Start Alloy BS6 engine is aligned with the Wet, Multi Plate clutch, 4 Speed gearbox and Manual transmission. To know in detail about TVS Sport Kick Start Alloy BS6 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1369,
    "url": "https://bikes.tractorjunction.com/en/jawa-bikes/perak-standard/specifications",
    "specsContent": "<p>Jawa Perak Standard is powered by a 334 CC Single Cylinder, Four Stroke, Liquid Cooled, SI Engine, DOHC engine. The powerful engine produces 30.22 bhp and 32. 74 Nm, ensuring the user gets the smoothest drive-off experience. Jawa Perak Standard specifications and features include an advanced tech engine, offering a decent mileage of 34.05 Kmpl , enabling you to cover extra miles. Jawa Perak Standard price is ₹2.09 Lakh in India. Jawa Perak Standard BS6 specifications include a total fuel tank capacity of 14 L, letting you cover longer distances without worrying about refuelling. Jawa Perak Standard comes equipped with Disc brakes and has a tyre size- Front :100/90-18 Rear :140/70-17, giving maximum stability to the user. Perak Standard engine is aligned with the N/A clutch, 6 Speed gearbox and Manual transmission. To know in detail about Jawa Perak Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1175,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-125-drum-split-seat/specifications",
    "specsContent": "<p>Bajaj Pulsar 125 Drum - Split Seat is powered by a 124.4 CC 4-Stroke, 2-Valve, Twin Spark BSVI Compliant DTS-i Engine engine. The powerful engine produces 11.64 bhp @ 8500 rpm and 10.8 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Bajaj Pulsar 125 Drum - Split Seat specifications and features include an advanced tech engine, offering a decent mileage of 50 Kmpl , enabling you to cover extra miles. Bajaj Pulsar 125 Drum - Split Seat price is ₹84,000 in India. Bajaj Pulsar 125 Drum - Split Seat BS6 specifications include a total fuel tank capacity of 11.5 L, letting you cover longer distances without worrying about refuelling. Bajaj Pulsar 125 Drum - Split Seat comes equipped with Disc brakes and has a tyre size- Front :80/100-17 Rear :100/90-17, giving maximum stability to the user. Pulsar 125 Drum - Split Seat engine is aligned with the N/A clutch, 5 Speed gearbox and Manual transmission. To know in detail about Bajaj Pulsar 125 Drum - Split Seat technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1286,
    "url": "https://bikes.tractorjunction.com/en/suzuki-bikes/gixxer-sf-standard-bs-vi/specifications",
    "specsContent": "<p>Suzuki Gixxer SF Standard - BS VI is powered by a 155 CC 4-Stroke, 1-cylinder, Air cooled engine. The powerful engine produces 13.41 bhp @ 8000 rpm and 13.8 Nm @ 6000 rpm, ensuring the user gets the smoothest drive-off experience. Suzuki Gixxer SF Standard - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. Suzuki Gixxer SF Standard - BS VI price falls between ₹1.37 Lakh to ₹1.46 Lakh in India. Suzuki Gixxer SF Standard - BS VI BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. Suzuki Gixxer SF Standard - BS VI comes equipped with Disc brakes and has a tyre size- Front :100/80-17, Rear :140/60-17, giving maximum stability to the user. Gixxer SF Standard - BS VI engine is aligned with the N/A clutch, 5 Speed gearbox and Manual transmission. To know in detail about Suzuki Gixxer SF Standard - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 937,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/cd-110-dream-deluxe-2022/specifications",
    "specsContent": "<p>Honda CD 110 Dream Deluxe [2022] is powered by a 109.51 CC 4 stroke, SI, BS-VI Engine engine. The powerful engine produces 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Honda CD 110 Dream Deluxe [2022] specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Honda CD 110 Dream Deluxe [2022] price is ₹71,133 in India. Honda CD 110 Dream Deluxe [2022] BS6 specifications include a total fuel tank capacity of 9.1 L, letting you cover longer distances without worrying about refuelling. Honda CD 110 Dream Deluxe [2022] comes equipped with Drum brakes and has a tyre size- Front :80/100-18, Rear :80/100-18, giving maximum stability to the user. CD 110 Dream Deluxe [2022] engine is aligned with the Multiplate Wet Clutch clutch, 4 Speed gearbox and Manual transmission. To know in detail about Honda CD 110 Dream Deluxe [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1146,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/meteor-350-stellar/specifications",
    "specsContent": "<p>Royal Enfield Meteor 350 Stellar is powered by a 349 CC Single-Cylinder, 4 Stroke, Air-Oil Cooled Engine engine. The powerful engine produces 20.12 bhp @ 6100 rpm and 27 Nm @ 4000 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Meteor 350 Stellar specifications and features include an advanced tech engine, offering a decent mileage of 41.88 Kmpl , enabling you to cover extra miles. Royal Enfield Meteor 350 Stellar price is ₹2.4 Lakh in India. Royal Enfield Meteor 350 Stellar BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Meteor 350 Stellar comes equipped with Disc brakes and has a tyre size- Front :100/90-19 Rear :140/70-17, giving maximum stability to the user. Meteor 350 Stellar engine is aligned with the N/A clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Meteor 350 Stellar technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 986,
    "url": "https://bikes.tractorjunction.com/en/yamaha-bikes/fz-s-fi-standard-bs-vi-2022/specifications",
    "specsContent": "<p>Yamaha FZ S FI Standard - BS VI [2022] is powered by a 149 CC Air cooled, 4-stroke, SOHC, 2-valve engine. The powerful engine produces 12.23 bhp @ 7250 rpm and 13.3 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Yamaha FZ S FI Standard - BS VI [2022] specifications and features include an advanced tech engine, offering a decent mileage of 45.5 Kmpl , enabling you to cover extra miles. Yamaha FZ S FI Standard - BS VI [2022] price is ₹1.21 Lakh in India. Yamaha FZ S FI Standard - BS VI [2022] BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Yamaha FZ S FI Standard - BS VI [2022] comes equipped with Disc brakes and has a tyre size- Front :100/80-17 Rear :140/60-17, giving maximum stability to the user. FZ S FI Standard - BS VI [2022] engine is aligned with the Wet, multi-disc clutch, 5 Speed gearbox and Manual transmission. To know in detail about Yamaha FZ S FI Standard - BS VI [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1025,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/raider-125-drum/specifications",
    "specsContent": "<p>TVS Raider 125 Drum is powered by a 124.8 CC Air/Oil Cooled , 1 Cylinder, 3 Valve engine. The powerful engine produces 11.2 bhp @ 7,500 rpm and 11.2 Nm @ 6,000 rpm , ensuring the user gets the smoothest drive-off experience. TVS Raider 125 Drum specifications and features include an advanced tech engine, offering a decent mileage of 57 Kmpl , enabling you to cover extra miles. TVS Raider 125 Drum price is ₹86,803 in India. TVS Raider 125 Drum BS6 specifications include a total fuel tank capacity of 10 L, letting you cover longer distances without worrying about refuelling. TVS Raider 125 Drum comes equipped with Drum brakes and has a tyre size- Front:80/100 - 17 Rear:100/90 - 17 , giving maximum stability to the user. Raider 125 Drum engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Raider 125 Drum technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1116,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/himalayan-standard-bs-vi-2021/specifications",
    "specsContent": "<p>Royal Enfield Himalayan Standard - BS VI [2021] is powered by a 411 CC Air Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 24.3 bhp @ 6,500 rpm and 32 Nm @ 4,500 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Himalayan Standard - BS VI [2021] specifications and features include an advanced tech engine, offering a decent mileage of 32.4 Kmpl , enabling you to cover extra miles. Royal Enfield Himalayan Standard - BS VI [2021] price is ₹2.55 Lakh in India. Royal Enfield Himalayan Standard - BS VI [2021] BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Himalayan Standard - BS VI [2021] comes equipped with Disc brakes and has a tyre size- Front:90/90 - 21 Rear:120/90 - 17 , giving maximum stability to the user. Himalayan Standard - BS VI [2021] engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Himalayan Standard - BS VI [2021] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1057,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/ninja-650-standard/specifications",
    "specsContent": "<p>Kawasaki Ninja 650 Standard is powered by a 649 CC Liquid-cooled, 4-stroke Parallel Twin engine. The powerful engine produces 67.07 bhp @ 8000 rpm and 64 Nm @ 6700 rpm, ensuring the user gets the smoothest drive-off experience. Kawasaki Ninja 650 Standard specifications and features include an advanced tech engine, offering a decent mileage of 21 Kmpl , enabling you to cover extra miles. Kawasaki Ninja 650 Standard price is ₹7.12 Lakh in India. Kawasaki Ninja 650 Standard BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Kawasaki Ninja 650 Standard comes equipped with Double Disc brakes and has a tyre size- Front :120/70ZR17, Rear :160/60ZR17, giving maximum stability to the user. Ninja 650 Standard engine is aligned with the N/A clutch, 6 Speed gearbox and Manual transmission. To know in detail about Kawasaki Ninja 650 Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 881,
    "url": "https://bikes.tractorjunction.com/en/ktm-bikes/125-duke-standard/specifications",
    "specsContent": "<p>KTM 125 Duke Standard is powered by a 124.7 CC Single Cylinder, 4 Valve, Liquid Cooled, FI, DOHC engine. The powerful engine produces 14.3 bhp @ 9250 rpm and 12 Nm @ 8000 rpm, ensuring the user gets the smoothest drive-off experience. KTM 125 Duke Standard specifications and features include an advanced tech engine, offering a decent mileage of 48 Kmpl , enabling you to cover extra miles. KTM 125 Duke Standard price is ₹1.78 Lakh in India. KTM 125 Duke Standard BS6 specifications include a total fuel tank capacity of 13.5 L, letting you cover longer distances without worrying about refuelling. KTM 125 Duke Standard comes equipped with Disc brakes and has a tyre size- Front :110/70-R17, Rear : 150/60-R17, giving maximum stability to the user. 125 Duke Standard engine is aligned with the Wet Multi-Disc clutch, 6-Speed gearbox and Manual transmission. To know in detail about KTM 125 Duke Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1756,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-500-standard/specifications",
    "specsContent": "<p>Royal Enfield Classic 500 standard is powered by a 499 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 500 standard specifications and features include an advanced tech engine, offering a decent mileage of 32 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 500 standard price is ₹2.36 Lakh in India. Royal Enfield Classic 500 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 500 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Classic 500 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Royal Enfield Classic 500 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1276,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/bullet-350-standard/specifications",
    "specsContent": "<p>Royal Enfield Bullet 350 Standard is powered by a 346 CC Air Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 19.1 bhp @ 5,250 rpm and 28 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Bullet 350 Standard specifications and features include an advanced tech engine, offering a decent mileage of 38 Kmpl , enabling you to cover extra miles. Royal Enfield Bullet 350 Standard price falls between ₹1.74 Lakh to ₹1.95 Lakh in India. Royal Enfield Bullet 350 Standard BS6 specifications include a total fuel tank capacity of 13.5 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Bullet 350 Standard comes equipped with Disc brakes and has a tyre size- Front:3.25 X 19 - 54P Rear:3.25 X 19 - 60P , giving maximum stability to the user. Bullet 350 Standard engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Bullet 350 Standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1301,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/interceptor-650-standard-bs-vi/specifications",
    "specsContent": "<p>Royal Enfield Interceptor 650 Standard - BS VI is powered by a 648 CC Air/Oil Cooled , 2 Cylinder, 4 Valve engine. The powerful engine produces 47 bhp @ 7,250 rpm and 52 Nm @ 5,250 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Interceptor 650 Standard - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 23 Kmpl , enabling you to cover extra miles. Royal Enfield Interceptor 650 Standard - BS VI price is ₹3.5 Lakh in India. Royal Enfield Interceptor 650 Standard - BS VI BS6 specifications include a total fuel tank capacity of 13.7 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Interceptor 650 Standard - BS VI comes equipped with Disc brakes and has a tyre size- Front:100/90 - 18 Rear:130/70 - 18 , giving maximum stability to the user. Interceptor 650 Standard - BS VI engine is aligned with the Slipper Clutch clutch, 1 Down 5 Up gearbox and 6 Speed Manual transmission. To know in detail about Royal Enfield Interceptor 650 Standard - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  }
]
