[
  {
    "id": 1991,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/karizma-xmr-standard",
    "content": "<p>Hero Karizma XMR standard Bike is one of India’s most reputed 2-wheelers. The Karizma XMR standard Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 210 CC engine that produces N/A power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Hero Karizma XMR standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Karizma XMR standard Price In India</strong></p> <p>Hero Karizma XMR standard Price in India starts from ₹ 1.9 Lakh and goes up to ₹ 2 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Hero Karizma XMR standard Bike. However, it is necessary to know that the on-road price of the Karizma XMR standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Karizma XMR standard Engine</strong></p><p>Hero Karizma XMR standard engine capacity is 210 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of Karizma XMR standard is aligned with a N/A gear transmission.</p> <p><strong>Hero Karizma XMR standard Mileage</strong></p><p>Hero Karizma XMR standard mileage is 41.55 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Karizma XMR standard Brakes &amp; Suspension</strong></p><p>Hero Karizma XMR standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Karizma XMR standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Karizma XMR standard</strong></p><p>Hero Karizma XMR standard at BikeJunction is available with complete information. In addition you can easily get the Hero Karizma XMR standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Karizma XMR standard Bike with your other top choices.</p> ",
    "specUrl": "https://bikes.tractorjunction.com/en/hero-bikes/karizma-xmr-standard/specifications",
    "specsContent": "<p>Hero Karizma XMR standard is powered by a 210 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Hero Karizma XMR standard specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Hero Karizma XMR standard price falls between ₹1.9 Lakh to ₹2 Lakh in India. Hero Karizma XMR standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Hero Karizma XMR standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Karizma XMR standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Hero Karizma XMR standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1960,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/xtreme-200s-4v-2023",
    "content": "<p>Hero Xtreme 200S 4V (2023) Bike is one of India’s most reputed 2-wheelers. The Xtreme 200S 4V (2023) Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 199.6 CC engine that produces 19.1 Ps @ 8500 rpm power, 54 Kmpl mileage and giving the most superior driving experience to its users. Hero Xtreme 200S 4V (2023) Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Xtreme 200S 4V (2023) Price In India</strong></p> <p>Hero Xtreme 200S 4V (2023) Price in India starts from ₹ 1.65 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Hero Xtreme 200S 4V (2023) Bike. However, it is necessary to know that the on-road price of the Xtreme 200S 4V (2023) Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Xtreme 200S 4V (2023) Engine</strong></p><p>Hero Xtreme 200S 4V (2023) engine capacity is 199.6 CC and engineered with Oil cooled, 4 Stroke 4 Valve single cylinder OHC engine. This engine generates 19.1 Ps @ 8500 rpm and 17.35 Nm @ 6500 rpm of Torque. The engine of Xtreme 200S 4V (2023) is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Xtreme 200S 4V (2023) Mileage</strong></p><p>Hero Xtreme 200S 4V (2023) mileage is 54 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12.8 L litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Xtreme 200S 4V (2023) Brakes &amp; Suspension</strong></p><p>Hero Xtreme 200S 4V (2023) comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Xtreme 200S 4V (2023) Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Xtreme 200S 4V (2023)</strong></p><p>Hero Xtreme 200S 4V (2023) at BikeJunction is available with complete information. In addition you can easily get the Hero Xtreme 200S 4V (2023) on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Xtreme 200S 4V (2023) Bike with your other top choices.</p> ",
    "specUrl": "https://bikes.tractorjunction.com/en/hero-bikes/xtreme-200s-4v-2023/specifications",
    "specsContent": "<p>Hero Xtreme 200S 4V (2023) is powered by a 199.6 CC Oil cooled, 4 Stroke 4 Valve single cylinder OHC engine. The powerful engine produces 19.1 Ps @ 8500 rpm and 17.35 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Hero Xtreme 200S 4V (2023) specifications and features include an advanced tech engine, offering a decent mileage of 54 Kmpl , enabling you to cover extra miles. Hero Xtreme 200S 4V (2023) price is ₹1.65 Lakh in India. Hero Xtreme 200S 4V (2023) BS6 specifications include a total fuel tank capacity of 12.8 L, letting you cover longer distances without worrying about refuelling. Hero Xtreme 200S 4V (2023) comes equipped with Petal Disc Dia. brakes and has a tyre size- Front: 100/80-17, Rear: 130/70-17, giving maximum stability to the user. Xtreme 200S 4V (2023) engine is aligned with the Multi-plate, wet type clutch, 5 Speed gearbox and Constant Mesh transmission. To know in detail about Hero Xtreme 200S 4V (2023) technical specifications, price &amp; more, get in touch with us.</p>"
  }
]
