[
  {
    "id": 1109,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v-single-channel-abs-with-modes/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 200 4V Single Channel ABS with Modes is powered by a 197.75 CC Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. The powerful engine produces 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm, ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 200 4V Single Channel ABS with Modes specifications and features include an advanced tech engine, offering a decent mileage of 38.5 Kmpl , enabling you to cover extra miles. TVS Apache RTR 200 4V Single Channel ABS with Modes price is ₹1.4 Lakh in India. TVS Apache RTR 200 4V Single Channel ABS with Modes BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 200 4V Single Channel ABS with Modes comes equipped with Disc brakes and has a tyre size- Front :90/90-17 Rear :130/70-17, giving maximum stability to the user. Apache RTR 200 4V Single Channel ABS with Modes engine is aligned with the Wet multi plate- slipper clutch with 5 plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about TVS Apache RTR 200 4V Single Channel ABS with Modes technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1203,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v-single-channel-abs-bs-vi/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 200 4V Single Channel ABS - BS VI is powered by a 197.75 CC Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. The powerful engine produces 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm, ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 200 4V Single Channel ABS - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 38.5 Kmpl , enabling you to cover extra miles. TVS Apache RTR 200 4V Single Channel ABS - BS VI price is ₹1.4 Lakh in India. TVS Apache RTR 200 4V Single Channel ABS - BS VI BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 200 4V Single Channel ABS - BS VI comes equipped with Disc brakes and has a tyre size- Front :90/90-17 Rear :130/70-17, giving maximum stability to the user. Apache RTR 200 4V Single Channel ABS - BS VI engine is aligned with the Wet multi plate- slipper clutch with 5 plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about TVS Apache RTR 200 4V Single Channel ABS - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1016,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v-dual-disc-abs-without-connectivity-2022/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] is powered by a 159.7 CC Oil Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] price is ₹1.26 Lakh in India. TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 4V Dual Disc - ABS - Without Connectivity [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1265,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/xl100-heavy-duty-i-touch-start-se-bs-vi/specifications/specifications",
    "specsContent": "<p>TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI is powered by a 99.7 CC 4 Stroke Single Cylinder engine. The powerful engine produces 4.34 bhp @ 6000 rpm and 6.5 Nm @ 3500 rpm, ensuring the user gets the smoothest drive-off experience. TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI specifications and features include an advanced tech engine, offering a decent mileage of 80 Kmpl , enabling you to cover extra miles. TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI price is ₹49,191 in India. TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI BS6 specifications include a total fuel tank capacity of 4 L, letting you cover longer distances without worrying about refuelling. TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI comes equipped with Drum brakes and has a tyre size- Front : 2.5-16 Rear :2.5-16, giving maximum stability to the user. XL100 Heavy Duty i-TOUCH start - SE - BS-VI engine is aligned with the Centrifugal Wet Clutch clutch, Single Speed Gear Box gearbox and Automatic transmission. To know in detail about TVS XL100 Heavy Duty i-TOUCH start - SE - BS-VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1309,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-150-single-disc-dagger-edge-edition/specifications/specifications",
    "specsContent": "<p>Bajaj Pulsar 150 Single Disc - Dagger Edge Edition is powered by a 149.5 CC 4-Stroke, 2-Valve, Twin Spark BSVI Compliant DTS-i FI Engine engine. The powerful engine produces 13.81 bhp @ 8500 rpm and 13.25 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Bajaj Pulsar 150 Single Disc - Dagger Edge Edition specifications and features include an advanced tech engine, offering a decent mileage of 48 Kmpl , enabling you to cover extra miles. Bajaj Pulsar 150 Single Disc - Dagger Edge Edition price is ₹1.17 Lakh in India. Bajaj Pulsar 150 Single Disc - Dagger Edge Edition BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Bajaj Pulsar 150 Single Disc - Dagger Edge Edition comes equipped with Disc brakes and has a tyre size- Front :80/100-17, Rear :100/90-17, giving maximum stability to the user. Pulsar 150 Single Disc - Dagger Edge Edition engine is aligned with the Wet, Multi Plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Bajaj Pulsar 150 Single Disc - Dagger Edge Edition technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1886,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/super-splendor-xtec-disc-brake-self-start-cast-wheel/specifications/specifications",
    "specsContent": "<p>Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel is powered by a 124.7 CC Air Cooled,4-Stroke, Single cyllinder, OHC engine. The powerful engine produces 10.7 BHP @ 7500 rpm and 10.6 Nm @ 6000 rpm, ensuring the user gets the smoothest drive-off experience. Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel specifications and features include an advanced tech engine, offering a decent mileage of 70 Kmpl , enabling you to cover extra miles. Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel price is ₹87,218 in India. Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel comes equipped with Disc brakes and has a tyre size- Front : 80/100-10, Rear : 90/90-18, giving maximum stability to the user. Super Splendor Xtec Disc Brake Self Start Cast Wheel engine is aligned with the Wet Multiplate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Hero Super Splendor Xtec Disc Brake Self Start Cast Wheel technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1061,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/scram-411-graphite-blue-graphite-red-graphite-yellow/specifications/specifications",
    "specsContent": "<p>Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow is powered by a 411 CC Single Cylinder, 4 Stroke, Air Cooled, SOHC engine. The powerful engine produces 23.98 bhp @ 6500 rpm and 32 Nm @ 4250±250 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow specifications and features include an advanced tech engine, offering a decent mileage of 38.23 Kmpl , enabling you to cover extra miles. Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow price is ₹2.45 Lakh in India. Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow comes equipped with Disc brakes and has a tyre size- Front :100/90 -19, Rear :120/90 - 17, giving maximum stability to the user. Scram 411 Graphite Blue - Graphite Red - Graphite Yellow engine is aligned with the Wet multi plates clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Scram 411 Graphite Blue - Graphite Red - Graphite Yellow technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 929,
    "url": "https://bikes.tractorjunction.com/en/yamaha-bikes/mt-15-v2-ice-fluo-cyan-storm-racing-blue/specifications/specifications",
    "specsContent": "<p>Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue is powered by a 155 CC Liquid Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 18.14 bhp @ 10,000 rpm and 14.1 Nm @ 7,500 rpm , ensuring the user gets the smoothest drive-off experience. Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue price is ₹1.68 Lakh in India. Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue BS6 specifications include a total fuel tank capacity of 10 L, letting you cover longer distances without worrying about refuelling. Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue comes equipped with Disc brakes and has a tyre size- Front:100/80 - 17 Rear:140/70 - R17 , giving maximum stability to the user. MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue engine is aligned with the Wet, Multiple Disc clutch, 1 Down 5 Up gearbox and 6 Speed Manual transmission. To know in detail about Yamaha MT 15 V2 Ice Fluo - Cyan Storm - Racing Blue technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 919,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-halcyon-single-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Halcyon - Single Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Halcyon - Single Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 35 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Halcyon - Single Channel ABS price is ₹1.93 Lakh in India. Royal Enfield Classic 350 Halcyon - Single Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Halcyon - Single Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Halcyon - Single Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Halcyon - Single Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1051,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-classic-signals-dual-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Classic Signals - Dual Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Classic Signals - Dual Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Classic Signals - Dual Channel ABS price is ₹2.44 Lakh in India. Royal Enfield Classic 350 Classic Signals - Dual Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Classic Signals - Dual Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Classic Signals - Dual Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Classic Signals - Dual Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1007,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v-single-disc-abs-2022/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 160 4V Single Disc - ABS - [2022] is powered by a 159.7 CC Oil Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 4V Single Disc - ABS - [2022] specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 4V Single Disc - ABS - [2022] price is ₹1.22 Lakh in India. TVS Apache RTR 160 4V Single Disc - ABS - [2022] BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 4V Single Disc - ABS - [2022] comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 4V Single Disc - ABS - [2022] engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 4V Single Disc - ABS - [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1040,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-redditch-single-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Redditch - Single Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Redditch - Single Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Redditch - Single Channel ABS price is ₹2.21 Lakh in India. Royal Enfield Classic 350 Redditch - Single Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Redditch - Single Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Redditch - Single Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Redditch - Single Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 938,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/splendor-plus-self-alloy-i3s-matt-shield-gold/specifications/specifications",
    "specsContent": "<p>Hero Splendor Plus Self Alloy i3S Matt Shield Gold is powered by a 97.2 CC Air cooled, 4-stroke, Single cylinder, OHC engine. The powerful engine produces 7.91 bhp @ 8,000 rpm and 8.05 Nm @ 6,000 rpm, ensuring the user gets the smoothest drive-off experience. Hero Splendor Plus Self Alloy i3S Matt Shield Gold specifications and features include an advanced tech engine, offering a decent mileage of 81 Kmpl , enabling you to cover extra miles. Hero Splendor Plus Self Alloy i3S Matt Shield Gold price is ₹74,396 in India. Hero Splendor Plus Self Alloy i3S Matt Shield Gold BS6 specifications include a total fuel tank capacity of 9.8 L, letting you cover longer distances without worrying about refuelling. Hero Splendor Plus Self Alloy i3S Matt Shield Gold comes equipped with Drum brakes and has a tyre size- Front:80/100 - 18 Rear:80/100 - 18, giving maximum stability to the user. Splendor Plus Self Alloy i3S Matt Shield Gold engine is aligned with the Wet Multi Plate clutch, 4 Speed gearbox and Manual transmission. To know in detail about Hero Splendor Plus Self Alloy i3S Matt Shield Gold technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 944,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/scram-411-white-flame-and-silver-spirit/specifications/specifications",
    "specsContent": "<p>Royal Enfield Scram 411 White Flame and Silver Spirit is powered by a 411 CC Single Cylinder, 4 Stroke, Air Cooled, SOHC engine. The powerful engine produces 23.98 bhp @ 6500 rpm and 32 Nm @ 4250±250 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Scram 411 White Flame and Silver Spirit specifications and features include an advanced tech engine, offering a decent mileage of 38.23 Kmpl , enabling you to cover extra miles. Royal Enfield Scram 411 White Flame and Silver Spirit price is ₹2.51 Lakh in India. Royal Enfield Scram 411 White Flame and Silver Spirit BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Scram 411 White Flame and Silver Spirit comes equipped with Disc brakes and has a tyre size- Front :100/90 -19, Rear :120/90 - 17, giving maximum stability to the user. Scram 411 White Flame and Silver Spirit engine is aligned with the Wet multi plates clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Scram 411 White Flame and Silver Spirit technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1126,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v-dual-channel-abs-with-modes/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 200 4V Dual-Channel ABS with Modes is powered by a 197.75 CC Oil Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 20.54 bhp @ 9,000 rpm and 17.25 Nm @ 7,250 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 200 4V Dual-Channel ABS with Modes specifications and features include an advanced tech engine, offering a decent mileage of 38.5 Kmpl , enabling you to cover extra miles. TVS Apache RTR 200 4V Dual-Channel ABS with Modes price is ₹1.46 Lakh in India. TVS Apache RTR 200 4V Dual-Channel ABS with Modes BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 200 4V Dual-Channel ABS with Modes comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:130/70 - 17 , giving maximum stability to the user. Apache RTR 200 4V Dual-Channel ABS with Modes engine is aligned with the Wet multi plate- slipper clutch with 5 plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 200 4V Dual-Channel ABS with Modes technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1013,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-classic-dark-dual-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Classic Dark - Dual Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Classic Dark - Dual Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Classic Dark - Dual Channel ABS price is ₹2.51 Lakh in India. Royal Enfield Classic 350 Classic Dark - Dual Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Classic Dark - Dual Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Classic Dark - Dual Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Classic Dark - Dual Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1026,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-classic-chrome-dual-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS price is ₹2.56 Lakh in India. Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Classic Chrome - Dual Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Classic Chrome - Dual Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1910,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/super-splendor-xtec-drum-brake-self-start-cast-wheel/specifications/specifications",
    "specsContent": "<p>Hero Super Splendor Xtec Drum Brake Self Start cast wheel is powered by a 124.7 CC Air Cooled,4-Stroke, Single cyllinder, OHC engine. The powerful engine produces 10.7 BHP @ 7500 rpm and 10.6 Nm @ 6000 rpm, ensuring the user gets the smoothest drive-off experience. Hero Super Splendor Xtec Drum Brake Self Start cast wheel specifications and features include an advanced tech engine, offering a decent mileage of 70 Kmpl , enabling you to cover extra miles. Hero Super Splendor Xtec Drum Brake Self Start cast wheel price is ₹82,618 in India. Hero Super Splendor Xtec Drum Brake Self Start cast wheel BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. Hero Super Splendor Xtec Drum Brake Self Start cast wheel comes equipped with Disc brakes and has a tyre size- Front : 80/100-10, Rear : 90/90-18, giving maximum stability to the user. Super Splendor Xtec Drum Brake Self Start cast wheel engine is aligned with the Wet Multiplate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Hero Super Splendor Xtec Drum Brake Self Start cast wheel technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1027,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v-dual-disc-abs-with-connectivity-2022/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] is powered by a 159.7 CC Oil Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] price is ₹1.29 Lakh in India. TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 4V Dual Disc - ABS - With Connectivity [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1123,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/himalayan-pine-green-and-granite-black/specifications/specifications",
    "specsContent": "<p>Royal Enfield Himalayan Pine Green and Granite Black is powered by a 411 CC Single Cylinder, 4 stroke, Air cooled, SOHC engine. The powerful engine produces 23.98 bhp @ 6500 rpm and 32 Nm @ 4000 - 4500 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Himalayan Pine Green and Granite Black specifications and features include an advanced tech engine, offering a decent mileage of 32.4 Kmpl , enabling you to cover extra miles. Royal Enfield Himalayan Pine Green and Granite Black price is ₹2.69 Lakh in India. Royal Enfield Himalayan Pine Green and Granite Black BS6 specifications include a total fuel tank capacity of 15+/- 0.5 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Himalayan Pine Green and Granite Black comes equipped with Disc brakes and has a tyre size- Front :90/90-21 Rear :120/90-17, giving maximum stability to the user. Himalayan Pine Green and Granite Black engine is aligned with the Wet, multi-plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Himalayan Pine Green and Granite Black technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1858,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/self-start-abs-disc-brake-alloy-wheel-fi/specifications/specifications",
    "specsContent": "<p>Hero Self Start ABS Disc Brake Alloy wheel - FI is powered by a 199.6 CC Oil cooled&amp; 4 Stroke single cylinder OHC engine. The powerful engine produces 15.22 PS @ 8500 rpm and 16.4 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Hero Self Start ABS Disc Brake Alloy wheel - FI specifications and features include an advanced tech engine, offering a decent mileage of 40 Kmpl , enabling you to cover extra miles. Hero Self Start ABS Disc Brake Alloy wheel - FI price is ₹1.35 Lakh in India. Hero Self Start ABS Disc Brake Alloy wheel - FI BS6 specifications include a total fuel tank capacity of 12.8 L, letting you cover longer distances without worrying about refuelling. Hero Self Start ABS Disc Brake Alloy wheel - FI comes equipped with Disc brakes and has a tyre size- Front : 100/80-17, Rear : 130/70-17, giving maximum stability to the user. Self Start ABS Disc Brake Alloy wheel - FI engine is aligned with the N/A clutch, 5 Speed gearbox and Manual transmission. To know in detail about Hero Self Start ABS Disc Brake Alloy wheel - FI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1304,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-150-twin-disc-dagger-edge-edition/specifications/specifications",
    "specsContent": "<p>Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition is powered by a 149.5 CC 4-Stroke, 2-Valve, Twin Spark BSVI Compliant DTS-i FI Engine engine. The powerful engine produces 13.81 bhp @ 8500 rpm and 13.25 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition specifications and features include an advanced tech engine, offering a decent mileage of 48 Kmpl , enabling you to cover extra miles. Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition price is ₹1.2 Lakh in India. Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition comes equipped with Disc brakes and has a tyre size- Front :90/90 17, Rear :120/80 17, giving maximum stability to the user. Pulsar 150 Twin Disc - Dagger Edge Edition engine is aligned with the Wet, Multi Plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Bajaj Pulsar 150 Twin Disc - Dagger Edge Edition technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1010,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v-single-channel-abs-2022/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 200 4V Single Channel ABS [2022] is powered by a 197.75 CC Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. The powerful engine produces 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm, ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 200 4V Single Channel ABS [2022] specifications and features include an advanced tech engine, offering a decent mileage of 38.5 Kmpl , enabling you to cover extra miles. TVS Apache RTR 200 4V Single Channel ABS [2022] price is ₹1.4 Lakh in India. TVS Apache RTR 200 4V Single Channel ABS [2022] BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 200 4V Single Channel ABS [2022] comes equipped with Disc brakes and has a tyre size- Front :90/90-17 Rear :130/70-17, giving maximum stability to the user. Apache RTR 200 4V Single Channel ABS [2022] engine is aligned with the Wet multi plate- slipper clutch with 5 plate clutch, 5 Speed gearbox and Manual transmission. To know in detail about TVS Apache RTR 200 4V Single Channel ABS [2022] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 816,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-drum-2022/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 160 Drum (2022) is powered by a 159.7 CC Air Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 15.31 bhp @ 8,400 rpm and 13.9 Nm @ 7,000 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 Drum (2022) specifications and features include an advanced tech engine, offering a decent mileage of 50 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 Drum (2022) price is ₹1.18 Lakh in India. TVS Apache RTR 160 Drum (2022) BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 Drum (2022) comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 Drum (2022) engine is aligned with the Wet, Multi Plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 Drum (2022) technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1102,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350-halcyon-dual-channel-abs/specifications/specifications",
    "specsContent": "<p>Royal Enfield Classic 350 Halcyon - Dual Channel ABS is powered by a 349 CC Air/Oil Cooled , 1 Cylinder, 2 Valve engine. The powerful engine produces 20.2 bhp @ 6,100 rpm and 27 Nm @ 4,000 rpm , ensuring the user gets the smoothest drive-off experience. Royal Enfield Classic 350 Halcyon - Dual Channel ABS specifications and features include an advanced tech engine, offering a decent mileage of 41.55 Kmpl , enabling you to cover extra miles. Royal Enfield Classic 350 Halcyon - Dual Channel ABS price is ₹2.31 Lakh in India. Royal Enfield Classic 350 Halcyon - Dual Channel ABS BS6 specifications include a total fuel tank capacity of 13 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Classic 350 Halcyon - Dual Channel ABS comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:120/80 - 18 , giving maximum stability to the user. Classic 350 Halcyon - Dual Channel ABS engine is aligned with the Wet, Multi-plate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about Royal Enfield Classic 350 Halcyon - Dual Channel ABS technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1012,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/scram-411-blazing-black-and-skyline-blue/specifications/specifications",
    "specsContent": "<p>Royal Enfield Scram 411 Blazing Black and Skyline Blue is powered by a 411 CC Single Cylinder, 4 Stroke, Air Cooled, SOHC engine. The powerful engine produces 23.98 bhp @ 6500 rpm and 32 Nm @ 4250±250 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Scram 411 Blazing Black and Skyline Blue specifications and features include an advanced tech engine, offering a decent mileage of 38.23 Kmpl , enabling you to cover extra miles. Royal Enfield Scram 411 Blazing Black and Skyline Blue price is ₹2.47 Lakh in India. Royal Enfield Scram 411 Blazing Black and Skyline Blue BS6 specifications include a total fuel tank capacity of 15 L, letting you cover longer distances without worrying about refuelling. Royal Enfield Scram 411 Blazing Black and Skyline Blue comes equipped with Disc brakes and has a tyre size- Front :100/90 -19, Rear :120/90 - 17, giving maximum stability to the user. Scram 411 Blazing Black and Skyline Blue engine is aligned with the Wet multi plates clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Scram 411 Blazing Black and Skyline Blue technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 891,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/pleasure-plus-xtec-drum-alloy-jubilant-yellow/specifications/specifications",
    "specsContent": "<p>Hero Pleasure + Xtec Drum Alloy Jubilant Yellow is powered by a 110.9 CC Air cooled, 4-Stroke Single Cylinder OHC engine. The powerful engine produces 7.99 bhp @ 7000 rpm and 8.70 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Hero Pleasure + Xtec Drum Alloy Jubilant Yellow specifications and features include an advanced tech engine, offering a decent mileage of 50 Kmpl , enabling you to cover extra miles. Hero Pleasure + Xtec Drum Alloy Jubilant Yellow price is ₹77,268 in India. Hero Pleasure + Xtec Drum Alloy Jubilant Yellow BS6 specifications include a total fuel tank capacity of 4.8 L, letting you cover longer distances without worrying about refuelling. Hero Pleasure + Xtec Drum Alloy Jubilant Yellow comes equipped with Drum brakes and has a tyre size- Front :90/100-10 Rear :90/100-10, giving maximum stability to the user. Pleasure + Xtec Drum Alloy Jubilant Yellow engine is aligned with the Dry Automatic Centrifugal Clutch clutch, CVT gearbox and Automatic transmission. To know in detail about Hero Pleasure + Xtec Drum Alloy Jubilant Yellow technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 960,
    "url": "https://bikes.tractorjunction.com/en/yezdi-bikes/scrambler-rebel-red-mean-green-midnight-blue/specifications/specifications",
    "specsContent": "<p>Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue is powered by a 334 CC Liquid Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 28.7 bhp @ 8,000 rpm and 28.2 Nm @ 6,750 rpm , ensuring the user gets the smoothest drive-off experience. Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue specifications and features include an advanced tech engine, offering a decent mileage of 28 Kmpl , enabling you to cover extra miles. Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue price is ₹2.08 Lakh in India. Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue BS6 specifications include a total fuel tank capacity of 12.5 L, letting you cover longer distances without worrying about refuelling. Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue comes equipped with Disc brakes and has a tyre size- Front:100/90 - 19 Rear:140/70 - 17 , giving maximum stability to the user. Scrambler Rebel Red - Mean Green - Midnight Blue engine is aligned with the Wet Multidisc clutch, 1 Down 5 Up gearbox and 6 Speed Manual transmission. To know in detail about Yezdi Scrambler Rebel Red - Mean Green - Midnight Blue technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1872,
    "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/heritage-classic-edition-2023/specifications/specifications",
    "specsContent": "<p>Harley Davidson Heritage Classic Edition 2023 is powered by a 1868 CC Milwaukee-Eight 114, Liquid-Cooled, 2-Cylinder Engine engine. The powerful engine produces 94 HP @ 5020 rpm and 155 Nm @ 3250 rpm, ensuring the user gets the smoothest drive-off experience. Harley Davidson Heritage Classic Edition 2023 specifications and features include an advanced tech engine, offering a decent mileage of 18.1 Kmpl , enabling you to cover extra miles. Harley Davidson Heritage Classic Edition 2023 price is ₹26.59 Lakh in India. Harley Davidson Heritage Classic Edition 2023 BS6 specifications include a total fuel tank capacity of 18.9 L, letting you cover longer distances without worrying about refuelling. Harley Davidson Heritage Classic Edition 2023 comes equipped with Disc brakes and has a tyre size- Front : 130/90-B16, 73H, BW, Rear : 150/80-B16, 77H, BW, giving maximum stability to the user. Heritage Classic Edition 2023 engine is aligned with the N/A clutch, 6 Speed gearbox and Manual transmission. To know in detail about Harley Davidson Heritage Classic Edition 2023 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1342,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v-single-disc-abs-2021/specifications/specifications",
    "specsContent": "<p>TVS Apache RTR 160 4V Single Disc - ABS - [2021] is powered by a 159.7 CC Oil Cooled , 1 Cylinder, 4 Valve engine. The powerful engine produces 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm , ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 160 4V Single Disc - ABS - [2021] specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. TVS Apache RTR 160 4V Single Disc - ABS - [2021] price is ₹1.13 Lakh in India. TVS Apache RTR 160 4V Single Disc - ABS - [2021] BS6 specifications include a total fuel tank capacity of 12 L, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 160 4V Single Disc - ABS - [2021] comes equipped with Disc brakes and has a tyre size- Front:90/90 - 17 Rear:110/80 - 17 , giving maximum stability to the user. Apache RTR 160 4V Single Disc - ABS - [2021] engine is aligned with the Wet Multiplate clutch, 1 Down 4 Up gearbox and 5 Speed Manual transmission. To know in detail about TVS Apache RTR 160 4V Single Disc - ABS - [2021] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1287,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/maestro-edge-125-prismatic-color-tech-bs-vi/specifications/specifications",
    "specsContent": "<p>Hero Maestro Edge 125 Prismatic Color Tech - BS VI is powered by a 124.6 CC Air Cooled, 4-Stroke, SI Engine engine. The powerful engine produces 8.98 bhp @ 7000 rpm and 10.4 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Hero Maestro Edge 125 Prismatic Color Tech - BS VI specifications and features include an advanced tech engine, offering a decent mileage of 65 Kmpl , enabling you to cover extra miles. Hero Maestro Edge 125 Prismatic Color Tech - BS VI price is ₹82,766 in India. Hero Maestro Edge 125 Prismatic Color Tech - BS VI BS6 specifications include a total fuel tank capacity of 5 L, letting you cover longer distances without worrying about refuelling. Hero Maestro Edge 125 Prismatic Color Tech - BS VI comes equipped with Disc brakes and has a tyre size- Front :80/100 - 18 Rear :100/80 - 18, giving maximum stability to the user. Maestro Edge 125 Prismatic Color Tech - BS VI engine is aligned with the Dry, Centrifugal clutch, Variomatic Drive gearbox and Automatic transmission. To know in detail about Hero Maestro Edge 125 Prismatic Color Tech - BS VI technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 961,
    "url": "https://bikes.tractorjunction.com/en/yezdi-bikes/roadster-dark-smoke-grey-inferno-red-glacial-white/specifications/specifications",
    "specsContent": "<p>Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White is powered by a 334 CC Single cylinder, 4 Stroke, Liquid Cooled, DOHC engine. The powerful engine produces 29.29 bhp @ 7300 rpm and 29 Nm @ 6500 rpm, ensuring the user gets the smoothest drive-off experience. Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White specifications and features include an advanced tech engine, offering a decent mileage of 28.53 Kmpl , enabling you to cover extra miles. Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White price is ₹2.01 Lakh in India. Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White BS6 specifications include a total fuel tank capacity of 12.5 l, letting you cover longer distances without worrying about refuelling. Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White comes equipped with Disc brakes and has a tyre size- Front :100/90-18 Rear :130/80-17, giving maximum stability to the user. Roadster Dark Smoke Grey - Inferno Red - Glacial White engine is aligned with the N/A clutch, 6 Speed gearbox and Manual transmission. To know in detail about Yezdi Roadster Dark Smoke Grey - Inferno Red - Glacial White technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 943,
    "url": "https://bikes.tractorjunction.com/en/yamaha-scooters/fascino-125-hybrid-disc-special-edition/specifications/specifications",
    "specsContent": "<p>Yamaha Fascino 125 Hybrid - Disc Special Edition is powered by a 125 CC Air-cooled, 4-stroke, SOHC, 2-valve engine. The powerful engine produces 8.09 bhp @ 6500 rpm and 10.3 Nm @ 5000 rpm, ensuring the user gets the smoothest drive-off experience. Yamaha Fascino 125 Hybrid - Disc Special Edition specifications and features include an advanced tech engine, offering a decent mileage of 50.5 Kmpl , enabling you to cover extra miles. Yamaha Fascino 125 Hybrid - Disc Special Edition price is ₹87,030 in India. Yamaha Fascino 125 Hybrid - Disc Special Edition BS6 specifications include a total fuel tank capacity of 5.2 L, letting you cover longer distances without worrying about refuelling. Yamaha Fascino 125 Hybrid - Disc Special Edition comes equipped with Disc brakes and has a tyre size- Front : 90/90-12 Rear :110/90-10, giving maximum stability to the user. Fascino 125 Hybrid - Disc Special Edition engine is aligned with the N/A clutch, V-belt automatic gearbox and Automatic transmission. To know in detail about Yamaha Fascino 125 Hybrid - Disc Special Edition technical specifications, price &amp; more, get in touch with us.</p>"
  }
]
