[
  {
    "id": 1342,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
    "content": "<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p><p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p><p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p><p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>"
  },
  {
    "id": 1970,
    "url": "https://bikes.tractorjunction.com/en/honda-scooters/dio-125",
    "content": "<p>Honda Dio 125 Scooter is one of India’s most reputed 2-wheelers. The Dio 125 Scooter is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda Dio 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 123.92 CC engine that produces 6.09 kW @ 6250 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. Honda Dio 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda Dio 125 Price In India</strong></p> <p>Honda Dio 125 Price in India starts from ₹ 83,400 and goes up to ₹ 91,300. BikeJunction provides you a complete list of the updated and accurate price range of Honda Dio 125 Scooter. However, it is necessary to know that the on-road price of the Dio 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Dio 125 Engine</strong></p><p>Honda Dio 125 engine capacity is 123.92 CC and engineered with 4 Stroke, SI Engine engine. This engine generates 6.09 kW @ 6250 rpm and 10.4 N-m@5000 rpm of Torque. The engine of Dio 125 is aligned with the Dry Type clutch.</p><p> </p><p><strong>Honda Dio 125 Mileage</strong></p><p>Honda Dio 125 mileage is 50 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5.3 litres. This combination gives this Scooter a good driving range.</p><p><strong>Honda Dio 125 Brakes &amp; Suspension</strong></p><p>Honda Dio 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Dio 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda Dio 125</strong></p><p>Honda Dio 125 at BikeJunction is available with complete information. In addition you can easily get the Honda Dio 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Dio 125 Scooter with your other top choices.</p>"
  },
  {
    "id": 1668,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/evolet/hawk",
    "content": "<p>The Evolet Hawk is a well known electric Bike in the Electric vehicle sector of India. This Hawk Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Evolet Hawk enhance the overall performance.</p><p><strong>Evolet Hawk Price In India</strong></p><p>Evolet Hawk price in India includes all 1 variants starts from ₹1.25 Lakh and goes upto ₹1.5 Lakh. The new model of this Hawk electric Bike is available in :colours_count colours. In addition you can avail an updated price of Evolet Hawk on the basis of its colours &amp; variants. The Evolet Hawk electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Evolet Hawk Range</strong></p><p>Evolet Hawk is fitted with a 72 V 40 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Evolet Hawk is aligned with a Automatic transmission.</p><p><strong>Evolet Hawk Brakes &amp; Suspension</strong></p><p>Evolet Hawk delivers a Range of 100 KM in single charge. The Hawk comes with a BLDC Hub motor of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Evolet Hawk Electric Bike</strong></p><p>Evolet Hawk at BikeJunction is available with complete information. In addition you can easily get the Evolet Hawk on-road price in India. You can easily compare Evolet Hawk Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 1587,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/dynam/flash",
    "content": "<p>The dynam Flash is a well known electric Bike in the Electric vehicle sector of India. This Flash Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of dynam Flash enhance the overall performance.</p><p><strong>dynam Flash Price In India</strong></p><p>dynam Flash price in India includes all 1 variants starts from ₹1 Lakh and goes upto ₹1.5 Lakh. The new model of this Flash electric Bike is available in :colours_count colours. In addition you can avail an updated price of dynam Flash on the basis of its colours &amp; variants. The dynam Flash electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>dynam Flash Range</strong></p><p>dynam Flash is fitted with a 72 V and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of dynam Flash is aligned with a Automatic transmission.</p><p><strong>dynam Flash Brakes &amp; Suspension</strong></p><p>dynam Flash delivers a Range of 125 KM in single charge. The Flash comes with a N/A of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy dynam Flash Electric Bike</strong></p><p>dynam Flash at BikeJunction is available with complete information. In addition you can easily get the dynam Flash on-road price in India. You can easily compare dynam Flash Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 1567,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/gogoro/supersport",
    "content": "<p>The gogoro Supersport is a well known electric Scooter in the Electric vehicle sector of India. This Supersport Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of gogoro Supersport enhance the overall performance.</p><p><strong>gogoro Supersport Price In India</strong></p><p>gogoro Supersport price in India starts from 2.97 Lakh. The new model of this Supersport electric Scooter is available in 1 colours. In addition you can avail an updated price of gogoro Supersport on the basis of its colours &amp; variants. The gogoro Supersport electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>gogoro Supersport Range</strong></p><p>gogoro Supersport is fitted with a 3.45 kwh and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of gogoro Supersport is aligned with a Automatic transmission.</p><p><strong>gogoro Supersport Brakes &amp; Suspension</strong></p><p>gogoro Supersport delivers a Range of N/A KM in single charge. The Supersport comes with a Liquid Cooled, permanent magnet psynchronous of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy gogoro Supersport Electric Scooter</strong></p><p>gogoro Supersport at BikeJunction is available with complete information. In addition you can easily get the gogoro Supersport on-road price in India. You can easily compare gogoro Supersport Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 816,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160",
    "content": "<p>TVS Apache RTR 160 Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 15.31 bhp @ 8,400 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>The TVS Apache RTR 160 is among the top street bikes in India. It has many significant features and comes with a price tag of <strong>Rs 1.14 - 1.25 Lakh</strong>. It boasts a sporty design, a powerful engine, and a range of features that make it a versatile and fun ride. The bike is available in <strong>5 variants </strong>and <strong>5 colours</strong>. Furthermore, with this bike you can easily achieve a mileage of <strong>50 kmpl </strong>and a top speed of <strong>107 Kmph</strong>.</p><p style='text-align:justify'>The bike is powered by a <strong>159.7 cc BS6 </strong>engine that delivers <strong>15.31 bhp</strong> power and <strong>13.9 Nm</strong> peak torque. The engine is equipped with <strong>Race Tuned Fuel Injection (RT-Fi)</strong> technology that improves power delivery, fuel economy, engine durability, and emission control. The engine is tuned to a <strong>5-speed super-slick gearbox</strong> that offers precise and smooth shifting.</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Engine Specifications</strong></p><p style='text-align:justify'>TVS Apache RTR 160 is powered by a<strong> fuel-injected 159.7 cc single-cylinder 2-valve SOHC air-cooled engine</strong>. It produces<strong> 15.31 bhp</strong> of power at <strong>8,400 rpm</strong> and <strong>13.9 Nm </strong>of peak torque at <strong>7,000 rpm</strong>. It is paired with a <strong>5-speed gearbox</strong> that offers a smooth and precise shifting experience. It also gets '<strong>Glide Through Technology</strong>', which maximise revs at low-throttle openings and prevents the engine from stalling.</p><p style='text-align:justify'>The engine has <strong>Race Tuned Fuel Injection (RT-Fi) technology</strong> that enhances power delivery, fuel economy, engine durability, and emission control. The engine also features <strong>Race Derived O3C technology</strong> that improves cooling efficiency and performance.</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Price In India</strong></p><p style='text-align:justify'>TVS Apache RTR 160 comes with a price starting at <strong>Rs 1.14 lakhs</strong> and goes up to <strong>Rs 1.25 lakhs</strong>.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>TVS Apache RTR 160</td><td style='text-align:justify'>Rs 1.14 - 1.25 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Mileage</strong></p><p style='text-align:justify'>The TVS Apache RTR 160 has an ARAI-certified mileage of <strong>50 kmpl.</strong> However, the mileage may vary depending on riding style, road conditions, traffic, maintenance, and fuel quality.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>TVS Apache RTR 160</td><td style='text-align:justify'>50 kmpl</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Technical Specifications</strong></p><p style='text-align:justify'>Here are some of the key technical specifications of the TVS Apache RTR 160:</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Frame</strong></td><td style='text-align:justify'>Double Cradle Synchro Stiff</td></tr><tr><td style='text-align:justify'><strong>Transmission</strong></td><td style='text-align:justify'>5-Speed Manual</td></tr><tr><td style='text-align:justify'><strong>Brakes</strong></td><td style='text-align:justify'>Front disc/rear drum or disc (single-channel or dual-channel ABS)</td></tr><tr><td style='text-align:justify'><strong>Suspensions</strong></td><td style='text-align:justify'>Telescopic Front forks/twin rear springs</td></tr><tr><td style='text-align:justify'><strong>Tyres</strong></td><td style='text-align:justify'>90/90-17 tubeless/rear - 110/80-17 tubeless&nbsp;</td></tr><tr><td style='text-align:justify'><strong>Wheels</strong></td><td style='text-align:justify'>17-inch Alloy Wheels</td></tr><tr><td style='text-align:justify'><strong>Kerb Weight</strong></td><td style='text-align:justify'>139 kg</td></tr><tr><td style='text-align:justify'><strong>Fuel Tank Capacity</strong></td><td style='text-align:justify'>12 Litres</td></tr><tr><td style='text-align:justify'><strong>Seat Height</strong></td><td style='text-align:justify'>790 mm</td></tr><tr><td style='text-align:justify'><strong>Wheelbase</strong></td><td style='text-align:justify'>1300 mm</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Additional Features</strong></p><p style='text-align:justify'>The TVS Apache RTR 160 has additional features that enhance its appeal and functionality. These features are-&nbsp;</p><ul><li style='text-align: justify;'><strong><strong>3 Ride Modes - </strong></strong>The bike gets three ride modes – Urban, Rain, and Sport – that adjust the ABS and engine performance according to different riding conditions.</li><li style='text-align: justify;'><strong><strong>SmartXonnect</strong> - </strong>SmartXonnect technology connects the bike with your smartphone via Bluetooth. It displays information such as speedometer, odometer, trip metre, gear indicator, fuel level, service reminder, navigation assist, etc.</li><li style='text-align: justify;'><strong><strong>Voice Assist</strong> -</strong> The SmartXonnect feature also comes with a voice assist function that lets you control various functions such as music playback, phone calls, ride modes etc.</li><li style='text-align: justify;'><strong><strong>Racing Double-Barrel Exhaust</strong> - </strong>The bike gets a double-barrel exhaust system that enhances the exhaust note and improves the engine performance by expelling gases faster.</li><li style='text-align: justify;'><strong><strong>Gear-shift Indicator</strong> - </strong>The bike gets a gear indicator on the instrument cluster that shows you which gear you are in for optimum performance.</li><li style='text-align: justify;'><strong><strong>Adjustable Levers</strong> - </strong>3-step adjustable brake and clutch levers feature CAM adjusters to keep you comfortable. In addition, the levers can be easily adjusted without any additional tools.</li></ul><p style='text-align:justify'><strong>TVS Apache RTR 160 Variants</strong></p><p style='text-align:justify'>The TVS Apache RTR 160 is offered in 5 variants for you to choose from. Here are the ex-showroom pricing of each model -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Variants Models</strong></td><td style='text-align:justify'><strong>Ex-showroom price in India</strong></td></tr><tr><td style='text-align:justify'>Apache RTR 160 Disc (2022)</td><td style='text-align:justify'>Rs 1.22 Lakh</td></tr><tr><td style='text-align:justify'>Apache RTR 160 Drum (2022)</td><td style='text-align:justify'>Rs 1.18 Lakh</td></tr><tr><td style='text-align:justify'>Apache RTR 160 Disc Bluetooth</td><td style='text-align:justify'>Rs 1.25 Lakh</td></tr><tr><td style='text-align:justify'>Apache RTR 160 Rear Disc - ABS - BS VI</td><td style='text-align:justify'>Rs 1.17 Lakh</td></tr><tr><td style='text-align:justify'>Apache RTR 160 Front Disc - ABS - BS VI</td><td style='text-align:justify'>RS 1.14 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'>The TVS Apache RTR 160 variants are available in five colour options, including Gloss Black, Pearl White, Racing Red, Matte Blue, and T-Grey.&nbsp;</p><p style='text-align:justify'><strong>TVS Apache RTR 160 Competitors in the Market</strong></p><p style='text-align:justify'>The TVS Apache RTR 160 faces competition from other street bikes in its segment, such as-</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Rivals</strong></td><td style='text-align:justify'><strong>Ex-Showroom Price in India</strong></td></tr><tr><td style='text-align:justify'>Bajaj Pulsar NS160</td><td style='text-align:justify'>Rs 1.25 Lakh</td></tr><tr><td style='text-align:justify'>Hero Xtreme 160R</td><td style='text-align:justify'>Rs 1.18 Lakh</td></tr><tr><td style='text-align:justify'>Honda X-Blade</td><td style='text-align:justify'>Rs 1.21 Lakh</td></tr><tr><td style='text-align:justify'>Suzuki Gixxer</td><td style='text-align:justify'>Rs 1.34 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>Why BikeJunction for TVS Apache RTR 160?</strong></p><p style='text-align:justify'>Are you looking for the best online platform to get all the information on TVS Apache RTR 160? Look no further than Bike Junction. We have done extensive research on this bike and its variants to provide you with the most reliable and comprehensive information. You can find fuel efficiency, engine performance, tank capacity and more on our website.&nbsp;</p><p style='text-align:justify'>Furthermore, you can also compare different models of TVS Apache RTR 160 with our handy bike comparison tool. It's quick and easy to see how they differ in features and prices with just a few clicks. So don't wait any longer; compare, choose and buy your TVS Apache RTR 160 with BikeJunction!</p>"
  },
  {
    "id": 1872,
    "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/heritage-classic",
    "content": "<p>Harley Davidson Heritage Classic Bike is one of India’s most reputed 2-wheelers. The Heritage Classic Bike is manufactured by Harley Davidson, popularly known for their technologically advanced manufacturing value. Harley Davidson Heritage Classic Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1868 CC engine that produces N/A power, 18.1 Kmpl mileage and giving the most superior driving experience to its users. Harley Davidson Heritage Classic Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Harley Davidson Heritage Classic Price In India</strong></p> <p>Harley Davidson Heritage Classic Price in India starts from ₹ 23.49 Lakh and goes up to ₹ 26.59 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Harley Davidson Heritage Classic Bike. However, it is necessary to know that the on-road price of the Heritage Classic Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Harley Davidson Heritage Classic Engine</strong></p><p>Harley Davidson Heritage Classic engine capacity is 1868 CC and engineered with Milwaukee-Eight™ 114 engine. This engine generates N/A and 155 Nm @ 3250 rpm of Torque. The engine of Heritage Classic is aligned with a 6 Speed gear transmission.</p> <p><strong>Harley Davidson Heritage Classic Mileage</strong></p><p>Harley Davidson Heritage Classic mileage is 18.1 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 18.9 l litres. This combination gives this Bike a good driving range.</p><p><strong>Harley Davidson Heritage Classic Brakes &amp; Suspension</strong></p><p>Harley Davidson Heritage Classic comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Heritage Classic Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Harley Davidson Heritage Classic</strong></p><p>Harley Davidson Heritage Classic at BikeJunction is available with complete information. In addition you can easily get the Harley Davidson Heritage Classic on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Harley Davidson Heritage Classic Bike with your other top choices.</p>"
  },
  {
    "id": 1886,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/super-splendor-xtec",
    "content": "<p>Hero Super Splendor Xtec Bike is one of India’s most reputed 2-wheelers. The Super Splendor Xtec Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Super Splendor Xtec Bike belongs to the Bike category. The Bike boasts high-tech specifications like 124.7 CC engine that produces 10.7 BHP @ 7500 rpm power, 70 Kmpl mileage and giving the most superior driving experience to its users. Hero Super Splendor Xtec Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Super Splendor Xtec Price In India</strong></p> <p>Hero Super Splendor Xtec Price in India starts from ₹ 82,618 and goes up to ₹ 87,218. BikeJunction provides you a complete list of the updated and accurate price range of Hero Super Splendor Xtec Bike. However, it is necessary to know that the on-road price of the Super Splendor Xtec Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Super Splendor Xtec Engine</strong></p><p>Hero Super Splendor Xtec engine capacity is 124.7 CC and engineered with Air Cooled,4-Stroke, Single cyllinder, OHC engine. This engine generates 10.7 BHP @ 7500 rpm and 10.6 Nm @ 6000 rpm of Torque. The engine of Super Splendor Xtec is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Super Splendor Xtec Mileage</strong></p><p>Hero Super Splendor Xtec mileage is 70 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Super Splendor Xtec Brakes &amp; Suspension</strong></p><p>Hero Super Splendor Xtec comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Super Splendor Xtec Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Super Splendor Xtec</strong></p><p>Hero Super Splendor Xtec at BikeJunction is available with complete information. In addition you can easily get the Hero Super Splendor Xtec on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Super Splendor Xtec Bike with your other top choices.</p>"
  },
  {
    "id": 1126,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v",
    "content": "<p>TVS Apache RTR 200 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 200 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 200 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 197.75 CC engine that produces 20.54 bhp @ 8500 rpm power, 38.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 200 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 200 4V Price In India</strong></p> <p>TVS Apache RTR 200 4V Price in India starts from ₹ 1.4 Lakh and goes up to ₹ 1.46 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 200 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 200 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 200 4V Engine</strong></p><p>TVS Apache RTR 200 4V engine capacity is 197.75 CC and engineered with Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. This engine generates 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm of Torque. The engine of Apache RTR 200 4V is aligned with a 5 Speed gear transmission.</p> <p><strong>TVS Apache RTR 200 4V Mileage</strong></p><p>TVS Apache RTR 200 4V mileage is 38.5 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 200 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 200 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 200 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 200 4V</strong></p><p>TVS Apache RTR 200 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 200 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 200 4V Bike with your other top choices.</p>"
  },
  {
    "id": 1051,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
    "content": "<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p><p style='text-align:justify'>The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2><p style='text-align:justify'>Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p><p style='text-align:justify'>In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350&nbsp;</td><td style='text-align:justify'>Rs 1.9 - 2.21 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Mileage</strong></h2><p style='text-align:justify'>The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350</td><td style='text-align:justify'>41.55 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2'><strong>Suspension:</strong></td><td style='text-align:center'><strong>Front Suspension:</strong></td><td style='text-align:center'>Telescopic, 41mm forks, 130mm trave</td></tr><tr><td style='text-align:center'><strong>Rear Suspension:</strong></td><td style='text-align:center'>Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Brakes:</strong></strong></td><td style='text-align:center'><strong>Front Brake:</strong></td><td style='text-align:center'>300 mm disc, 2-piston calliper</td></tr><tr><td style='text-align:center'><strong>Rear Brake: </strong></td><td style='text-align:center'>270 mm disc, single-piston calliper</td></tr><tr><td style='text-align:center'><strong>ABS: </strong></td><td style='text-align:center'>Single &amp; Dual-channel ABS</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Tyres:</strong></strong></td><td style='text-align:center'><strong>Front Tyre:</strong></td><td style='text-align:center'>90/90 - 19, 52P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Rear Tyre: </strong></td><td style='text-align:center'>110/90 - 18, 61P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Wheels</strong></td><td style='text-align:center'>Spoke/Alloy wheels</td></tr><tr><td colspan='1' rowspan='7'><strong><strong>Dimensions:</strong></strong></td><td style='text-align:center'><strong>Length:</strong></td><td style='text-align:center'>2,145 mm</td></tr><tr><td style='text-align:center'><strong>Width:</strong></td><td style='text-align:center'>785 mm</td></tr><tr><td style='text-align:center'><strong>Height:</strong></td><td style='text-align:center'>1,090 mm</td></tr><tr><td style='text-align:center'><strong>Wheelbase:</strong></td><td style='text-align:center'>1,390mm</td></tr><tr><td style='text-align:center'><strong>Ground Clearance:</strong></td><td style='text-align:center'>170 mm</td></tr><tr><td style='text-align:center'><strong>Seat Height:</strong></td><td style='text-align:center'>805 mm</td></tr><tr><td style='text-align:center'><strong>Kerb Weight:</strong></td><td style='text-align:center'>195kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Additional Features</strong></h2><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Dual-channel ABS</strong>:</td><td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td></tr><tr><td><strong>LED headlamp</strong>:</td><td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td></tr><tr><td><strong>Digital instrument cluster</strong>:</td><td>Displays information such as speed, odometer, fuel gauge, and more.</td></tr><tr><td><strong>Tubeless tyres</strong>:</td><td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td></tr><tr><td><strong>Electric start</strong>:</td><td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td></tr><tr><td><strong>Disc brakes</strong>:</td><td>Provides superior stopping power &amp; better control over the bike.</td></tr><tr><td><strong>Fuel injection system</strong>:</td><td>Delivers precise fueling and improves fuel efficiency.</td></tr><tr><td><strong>Split seats</strong>:</td><td>Offers added comfort to the rider &amp; the pillion.</td></tr><tr><td><strong>Stylish design</strong>:</td><td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Variants</strong></h3><p style='text-align:justify'>Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon - Single Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 1.93 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 2.11 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Dark - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Chrome - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.21 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Reddtich - Single Channel ABS</td><td style='text-align:justify'>Rs 1.19 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon&nbsp; - Dual Channel ABS</td><td style='text-align:justify'>Rs 1.99 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3><p style='text-align:justify'>The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Benelli Imperial 400</strong></td><td style='text-align:justify'>Rs 1.89 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa Perak</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB350RS</strong></td><td style='text-align:justify'>Rs 2.05 - 2.06 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa 42</strong></td><td style='text-align:justify'>Rs 1.67 - 1.81 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:center'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Classic 350&nbsp;</strong></td><td style='text-align:center'>20,682</td><td style='text-align:center'>26,134</td><td style='text-align:center'>27,461</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3><p style='text-align:justify'>We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p><p style='text-align:justify'>Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p><p style='text-align:justify'>And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes/' target='_blank'><span style='color:#f39c12'>Royal Enfield Bike</span></a></strong> today with BikeJunction!</p><h3 style='text-align:justify'><strong>Key Highlights of Royal Enfield Classic 350</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Engine Capacity</strong></td><td>349.34 cc</td></tr><tr><td><strong>Mileage</strong></td><td>41.55 kmpl</td></tr><tr><td><strong>Kerb Weight</strong></td><td>195 kg</td></tr><tr><td><strong>Fuel Tank Capacity</strong></td><td>13L</td></tr><tr><td><strong>Max Power</strong></td><td>20.21 PS @ 6100 rpm</td></tr></tbody></table>"
  },
  {
    "id": 1671,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/evolet/raptor",
    "content": "<p>The Evolet Raptor is a well known electric Scooter in the Electric vehicle sector of India. This Raptor Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Evolet Raptor enhance the overall performance.</p><p><strong>Evolet Raptor Price In India</strong></p><p>Evolet Raptor price in India starts from 1 Lakh. The new model of this Raptor electric Scooter is available in 1 colours. In addition you can avail an updated price of Evolet Raptor on the basis of its colours &amp; variants. The Evolet Raptor electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Evolet Raptor Range</strong></p><p>Evolet Raptor is fitted with a 72 V/40 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Evolet Raptor is aligned with a Automatic transmission.</p><p><strong>Evolet Raptor Brakes &amp; Suspension</strong></p><p>Evolet Raptor delivers a Range of 150 KM in single charge. The Raptor comes with a Brushless Motor of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Evolet Raptor Electric Scooter</strong></p><p>Evolet Raptor at BikeJunction is available with complete information. In addition you can easily get the Evolet Raptor on-road price in India. You can easily compare Evolet Raptor Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1016,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
    "content": "<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p><p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p><p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p><p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>"
  },
  {
    "id": 961,
    "url": "https://bikes.tractorjunction.com/en/yezdi-bikes/roadster",
    "content": "<p>Yezdi Roadster Bike is one of India’s most reputed 2-wheelers. The Roadster Bike is manufactured by Yezdi, popularly known for their technologically advanced manufacturing value. Yezdi Roadster Bike belongs to the Bike category. The Bike boasts high-tech specifications like 334 CC engine that produces 29.29 bhp @ 7300 rpm power, 28.53 Kmpl mileage and giving the most superior driving experience to its users. Yezdi Roadster Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Yezdi Roadster Price In India</strong></p> <p>Yezdi Roadster Price in India starts from ₹ 2.01 Lakh and goes up to ₹ 2.09 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Yezdi Roadster Bike. However, it is necessary to know that the on-road price of the Roadster Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Yezdi Roadster Engine</strong></p><p>Yezdi Roadster engine capacity is 334 CC and engineered with Single cylinder, 4 Stroke, Liquid Cooled, DOHC engine. This engine generates 29.29 bhp @ 7300 rpm and 29 Nm @ 6500 rpm of Torque. The engine of Roadster is aligned with a 6 Speed gear transmission.</p> <p><strong>Yezdi Roadster Mileage</strong></p><p>Yezdi Roadster mileage is 28.53 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12.5 l litres. This combination gives this Bike a good driving range.</p><p><strong>Yezdi Roadster Brakes &amp; Suspension</strong></p><p>Yezdi Roadster comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Roadster Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Yezdi Roadster</strong></p><p>Yezdi Roadster at BikeJunction is available with complete information. In addition you can easily get the Yezdi Roadster on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Yezdi Roadster Bike with your other top choices.</p>"
  },
  {
    "id": 1010,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v",
    "content": "<p>TVS Apache RTR 200 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 200 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 200 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 197.75 CC engine that produces 20.54 bhp @ 8500 rpm power, 38.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 200 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 200 4V Price In India</strong></p> <p>TVS Apache RTR 200 4V Price in India starts from ₹ 1.4 Lakh and goes up to ₹ 1.46 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 200 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 200 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 200 4V Engine</strong></p><p>TVS Apache RTR 200 4V engine capacity is 197.75 CC and engineered with Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. This engine generates 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm of Torque. The engine of Apache RTR 200 4V is aligned with a 5 Speed gear transmission.</p> <p><strong>TVS Apache RTR 200 4V Mileage</strong></p><p>TVS Apache RTR 200 4V mileage is 38.5 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 200 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 200 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 200 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 200 4V</strong></p><p>TVS Apache RTR 200 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 200 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 200 4V Bike with your other top choices.</p>"
  },
  {
    "id": 1910,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/super-splendor-xtec",
    "content": "<p>Hero Super Splendor Xtec Bike is one of India’s most reputed 2-wheelers. The Super Splendor Xtec Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Super Splendor Xtec Bike belongs to the Bike category. The Bike boasts high-tech specifications like 124.7 CC engine that produces 10.7 BHP @ 7500 rpm power, 70 Kmpl mileage and giving the most superior driving experience to its users. Hero Super Splendor Xtec Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Super Splendor Xtec Price In India</strong></p> <p>Hero Super Splendor Xtec Price in India starts from ₹ 82,618 and goes up to ₹ 87,218. BikeJunction provides you a complete list of the updated and accurate price range of Hero Super Splendor Xtec Bike. However, it is necessary to know that the on-road price of the Super Splendor Xtec Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Super Splendor Xtec Engine</strong></p><p>Hero Super Splendor Xtec engine capacity is 124.7 CC and engineered with Air Cooled,4-Stroke, Single cyllinder, OHC engine. This engine generates 10.7 BHP @ 7500 rpm and 10.6 Nm @ 6000 rpm of Torque. The engine of Super Splendor Xtec is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Super Splendor Xtec Mileage</strong></p><p>Hero Super Splendor Xtec mileage is 70 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Super Splendor Xtec Brakes &amp; Suspension</strong></p><p>Hero Super Splendor Xtec comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Super Splendor Xtec Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Super Splendor Xtec</strong></p><p>Hero Super Splendor Xtec at BikeJunction is available with complete information. In addition you can easily get the Hero Super Splendor Xtec on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Super Splendor Xtec Bike with your other top choices.</p>"
  },
  {
    "id": 1027,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
    "content": "<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p><p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p><p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p><p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>"
  },
  {
    "id": 1026,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
    "content": "<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p><p style='text-align:justify'>The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2><p style='text-align:justify'>Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p><p style='text-align:justify'>In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350&nbsp;</td><td style='text-align:justify'>Rs 1.9 - 2.21 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Mileage</strong></h2><p style='text-align:justify'>The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350</td><td style='text-align:justify'>41.55 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2'><strong>Suspension:</strong></td><td style='text-align:center'><strong>Front Suspension:</strong></td><td style='text-align:center'>Telescopic, 41mm forks, 130mm trave</td></tr><tr><td style='text-align:center'><strong>Rear Suspension:</strong></td><td style='text-align:center'>Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Brakes:</strong></strong></td><td style='text-align:center'><strong>Front Brake:</strong></td><td style='text-align:center'>300 mm disc, 2-piston calliper</td></tr><tr><td style='text-align:center'><strong>Rear Brake: </strong></td><td style='text-align:center'>270 mm disc, single-piston calliper</td></tr><tr><td style='text-align:center'><strong>ABS: </strong></td><td style='text-align:center'>Single &amp; Dual-channel ABS</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Tyres:</strong></strong></td><td style='text-align:center'><strong>Front Tyre:</strong></td><td style='text-align:center'>90/90 - 19, 52P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Rear Tyre: </strong></td><td style='text-align:center'>110/90 - 18, 61P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Wheels</strong></td><td style='text-align:center'>Spoke/Alloy wheels</td></tr><tr><td colspan='1' rowspan='7'><strong><strong>Dimensions:</strong></strong></td><td style='text-align:center'><strong>Length:</strong></td><td style='text-align:center'>2,145 mm</td></tr><tr><td style='text-align:center'><strong>Width:</strong></td><td style='text-align:center'>785 mm</td></tr><tr><td style='text-align:center'><strong>Height:</strong></td><td style='text-align:center'>1,090 mm</td></tr><tr><td style='text-align:center'><strong>Wheelbase:</strong></td><td style='text-align:center'>1,390mm</td></tr><tr><td style='text-align:center'><strong>Ground Clearance:</strong></td><td style='text-align:center'>170 mm</td></tr><tr><td style='text-align:center'><strong>Seat Height:</strong></td><td style='text-align:center'>805 mm</td></tr><tr><td style='text-align:center'><strong>Kerb Weight:</strong></td><td style='text-align:center'>195kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Additional Features</strong></h2><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Dual-channel ABS</strong>:</td><td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td></tr><tr><td><strong>LED headlamp</strong>:</td><td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td></tr><tr><td><strong>Digital instrument cluster</strong>:</td><td>Displays information such as speed, odometer, fuel gauge, and more.</td></tr><tr><td><strong>Tubeless tyres</strong>:</td><td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td></tr><tr><td><strong>Electric start</strong>:</td><td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td></tr><tr><td><strong>Disc brakes</strong>:</td><td>Provides superior stopping power &amp; better control over the bike.</td></tr><tr><td><strong>Fuel injection system</strong>:</td><td>Delivers precise fueling and improves fuel efficiency.</td></tr><tr><td><strong>Split seats</strong>:</td><td>Offers added comfort to the rider &amp; the pillion.</td></tr><tr><td><strong>Stylish design</strong>:</td><td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Variants</strong></h3><p style='text-align:justify'>Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon - Single Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 1.93 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 2.11 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Dark - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Chrome - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.21 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Reddtich - Single Channel ABS</td><td style='text-align:justify'>Rs 1.19 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon&nbsp; - Dual Channel ABS</td><td style='text-align:justify'>Rs 1.99 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3><p style='text-align:justify'>The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Benelli Imperial 400</strong></td><td style='text-align:justify'>Rs 1.89 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa Perak</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB350RS</strong></td><td style='text-align:justify'>Rs 2.05 - 2.06 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa 42</strong></td><td style='text-align:justify'>Rs 1.67 - 1.81 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:center'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Classic 350&nbsp;</strong></td><td style='text-align:center'>20,682</td><td style='text-align:center'>26,134</td><td style='text-align:center'>27,461</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3><p style='text-align:justify'>We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p><p style='text-align:justify'>Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p><p style='text-align:justify'>And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes/' target='_blank'><span style='color:#f39c12'>Royal Enfield Bike</span></a></strong> today with BikeJunction!</p><h3 style='text-align:justify'><strong>Key Highlights of Royal Enfield Classic 350</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Engine Capacity</strong></td><td>349.34 cc</td></tr><tr><td><strong>Mileage</strong></td><td>41.55 kmpl</td></tr><tr><td><strong>Kerb Weight</strong></td><td>195 kg</td></tr><tr><td><strong>Fuel Tank Capacity</strong></td><td>13L</td></tr><tr><td><strong>Max Power</strong></td><td>20.21 PS @ 6100 rpm</td></tr></tbody></table>"
  },
  {
    "id": 1152,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/maestro-edge-110",
    "content": "<p>Hero Maestro Edge 110 Scooter is one of India’s most reputed 2-wheelers. The Maestro Edge 110 Scooter is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Maestro Edge 110 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 110.9 CC engine that produces 8 bhp @ 7,500 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. Hero Maestro Edge 110 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Maestro Edge 110 Price In India</strong></p> <p>Hero Maestro Edge 110 Price in India starts from ₹ 70,639 and goes up to ₹ 76,137. BikeJunction provides you a complete list of the updated and accurate price range of Hero Maestro Edge 110 Scooter. However, it is necessary to know that the on-road price of the Maestro Edge 110 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Maestro Edge 110 Engine</strong></p><p>Hero Maestro Edge 110 engine capacity is 110.9 CC and engineered with Air Cooled , 1 Cylinder, 1 Valve engine. This engine generates 8 bhp @ 7,500 rpm and 8.75 Nm @ 5,500 rpm of Torque. The engine of Maestro Edge 110 is aligned with the Dry, Centrifugal clutch.</p><p> </p><p><strong>Hero Maestro Edge 110 Mileage</strong></p><p>Hero Maestro Edge 110 mileage is 45 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5 L litres. This combination gives this Scooter a good driving range.</p><p><strong>Hero Maestro Edge 110 Brakes &amp; Suspension</strong></p><p>Hero Maestro Edge 110 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Maestro Edge 110 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Maestro Edge 110</strong></p><p>Hero Maestro Edge 110 at BikeJunction is available with complete information. In addition you can easily get the Hero Maestro Edge 110 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Maestro Edge 110 Scooter with your other top choices.</p>"
  },
  {
    "id": 1102,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
    "content": "<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p><p style='text-align:justify'>The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2><p style='text-align:justify'>Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p><p style='text-align:justify'>In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350&nbsp;</td><td style='text-align:justify'>Rs 1.9 - 2.21 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Mileage</strong></h2><p style='text-align:justify'>The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350</td><td style='text-align:justify'>41.55 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2'><strong>Suspension:</strong></td><td style='text-align:center'><strong>Front Suspension:</strong></td><td style='text-align:center'>Telescopic, 41mm forks, 130mm trave</td></tr><tr><td style='text-align:center'><strong>Rear Suspension:</strong></td><td style='text-align:center'>Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Brakes:</strong></strong></td><td style='text-align:center'><strong>Front Brake:</strong></td><td style='text-align:center'>300 mm disc, 2-piston calliper</td></tr><tr><td style='text-align:center'><strong>Rear Brake: </strong></td><td style='text-align:center'>270 mm disc, single-piston calliper</td></tr><tr><td style='text-align:center'><strong>ABS: </strong></td><td style='text-align:center'>Single &amp; Dual-channel ABS</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Tyres:</strong></strong></td><td style='text-align:center'><strong>Front Tyre:</strong></td><td style='text-align:center'>90/90 - 19, 52P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Rear Tyre: </strong></td><td style='text-align:center'>110/90 - 18, 61P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Wheels</strong></td><td style='text-align:center'>Spoke/Alloy wheels</td></tr><tr><td colspan='1' rowspan='7'><strong><strong>Dimensions:</strong></strong></td><td style='text-align:center'><strong>Length:</strong></td><td style='text-align:center'>2,145 mm</td></tr><tr><td style='text-align:center'><strong>Width:</strong></td><td style='text-align:center'>785 mm</td></tr><tr><td style='text-align:center'><strong>Height:</strong></td><td style='text-align:center'>1,090 mm</td></tr><tr><td style='text-align:center'><strong>Wheelbase:</strong></td><td style='text-align:center'>1,390mm</td></tr><tr><td style='text-align:center'><strong>Ground Clearance:</strong></td><td style='text-align:center'>170 mm</td></tr><tr><td style='text-align:center'><strong>Seat Height:</strong></td><td style='text-align:center'>805 mm</td></tr><tr><td style='text-align:center'><strong>Kerb Weight:</strong></td><td style='text-align:center'>195kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Additional Features</strong></h2><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Dual-channel ABS</strong>:</td><td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td></tr><tr><td><strong>LED headlamp</strong>:</td><td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td></tr><tr><td><strong>Digital instrument cluster</strong>:</td><td>Displays information such as speed, odometer, fuel gauge, and more.</td></tr><tr><td><strong>Tubeless tyres</strong>:</td><td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td></tr><tr><td><strong>Electric start</strong>:</td><td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td></tr><tr><td><strong>Disc brakes</strong>:</td><td>Provides superior stopping power &amp; better control over the bike.</td></tr><tr><td><strong>Fuel injection system</strong>:</td><td>Delivers precise fueling and improves fuel efficiency.</td></tr><tr><td><strong>Split seats</strong>:</td><td>Offers added comfort to the rider &amp; the pillion.</td></tr><tr><td><strong>Stylish design</strong>:</td><td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Variants</strong></h3><p style='text-align:justify'>Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon - Single Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 1.93 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 2.11 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Dark - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Chrome - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.21 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Reddtich - Single Channel ABS</td><td style='text-align:justify'>Rs 1.19 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon&nbsp; - Dual Channel ABS</td><td style='text-align:justify'>Rs 1.99 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3><p style='text-align:justify'>The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Benelli Imperial 400</strong></td><td style='text-align:justify'>Rs 1.89 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa Perak</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB350RS</strong></td><td style='text-align:justify'>Rs 2.05 - 2.06 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa 42</strong></td><td style='text-align:justify'>Rs 1.67 - 1.81 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:center'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Classic 350&nbsp;</strong></td><td style='text-align:center'>20,682</td><td style='text-align:center'>26,134</td><td style='text-align:center'>27,461</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3><p style='text-align:justify'>We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p><p style='text-align:justify'>Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p><p style='text-align:justify'>And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes/' target='_blank'><span style='color:#f39c12'>Royal Enfield Bike</span></a></strong> today with BikeJunction!</p><h3 style='text-align:justify'><strong>Key Highlights of Royal Enfield Classic 350</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Engine Capacity</strong></td><td>349.34 cc</td></tr><tr><td><strong>Mileage</strong></td><td>41.55 kmpl</td></tr><tr><td><strong>Kerb Weight</strong></td><td>195 kg</td></tr><tr><td><strong>Fuel Tank Capacity</strong></td><td>13L</td></tr><tr><td><strong>Max Power</strong></td><td>20.21 PS @ 6100 rpm</td></tr></tbody></table>"
  },
  {
    "id": 943,
    "url": "https://bikes.tractorjunction.com/en/yamaha-scooters/fascino-125",
    "content": "<p></p><p>&nbsp;</p><quillbot-extension-portal></quillbot-extension-portal><p></p><p style='text-align:justify'>The <strong><a href='https://bikes.tractorjunction.com/en/yamaha-scooters' target='_blank'><span style='color:#e67e22'>Yamaha</span></a></strong> Fascino 125 is a scooter model from Yamaha Motor India with a price tag of <strong>Rs 78,600 - 91,030</strong>. This Yamaha scooter is powered by a <strong>125 cc, blue core, Air-cooled, 4-stroke, SOHC, 2-valve engine</strong> that churns out <strong>8.09 bhp &amp; 10.3 Nm</strong>. With this engine, you can easily achieve a mileage of <strong>68.75 Kmpl</strong> and reach a top speed of <strong>90 Kmph</strong>.&nbsp;</p><p style='text-align:justify'>This Yamaha scooter is available in <strong>6 colour variants</strong>- Vivid Red, Yellow Cocktail, Cyan Blue, Metallic Black, Cool Blue Metallic &amp; Dark Matte Blue. Moreover, the scooter boasts advanced features like <strong>E20 fuel compatibility</strong>, a <strong>Y-connect app </strong>&amp; <strong>Yamaha's Stop &amp; Start System</strong>.&nbsp;</p><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Engine Specifications</strong></h2><p style='text-align:justify'>Yamaha Fascino 125 scooter is powered by a <strong>125cc single-cylinder, air-cooled, fuel-injected engine. </strong>This BS6-compliant engine is capable of producing <strong>8.2 bhp of power at 6,500 rpm </strong>and <strong>10.3 Nm of torque at 5,000 rpm</strong>. The engine is tuned to a <strong>Continuously Variable Transmission (CVT)</strong>.&nbsp;</p><p style='text-align:justify'>The scooter has a fuel tank capacity of <strong>5.2 litres </strong>and has a claimed top speed of around <strong>90 Kmph</strong>. It also features Yamaha's “<strong>Stop &amp; Start</strong>” system, which automatically turns off the engine when the vehicle is stationary for more than 5 seconds and turns it on again when the throttle is twisted, resulting in improved fuel efficiency.</p><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Price In India</strong></h2><p style='text-align:justify'>The Yamaha Fascino 125 price in India is aggressively set. Available in 5 variants and a range of attractive colours, the price range of Fascino 125 ranges between Rs 78,600 - 91,030. This scooter is feature-packed and offers best-in-class performance making it a great choice, especially for the younger generation.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Yamaha Faascino 125</td><td style='text-align:justify'>Rs 78,600 - 91,030</td></tr></tbody></table><h2 style='text-align:justify'><strong>Yamaha Fascino Mileage</strong></h2><p style='text-align:justify'>Yamaha Fascino 125 is fitted with a powerful engine that lets you, as a rider, achieve a mileage of 68.75 Kmpl.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Yamaha Fascino 125</td><td style='text-align:justify'>68.75 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Technical Specifications</strong></h2><p style='text-align:justify'>Here are all the technical details of the Yamaha Fascino 125 that put it above all its rivals in the Indian market.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Technical Specifications</strong></td><td style='text-align:justify'><strong>Measurements</strong></td></tr><tr><td style='text-align:justify'>Frame</td><td style='text-align:justify'>Steel</td></tr><tr><td style='text-align:justify'>Suspensions</td><td style='text-align:justify'><strong>Front</strong>: Telescopic Fork&nbsp;<br><strong>Rear</strong>: Swing Arm</td></tr><tr><td style='text-align:justify'>Brakes</td><td style='text-align:justify'><strong>Front</strong>: 120 mm Drum Brake<br><strong>Rear</strong>: 120 mm Drum Brake<br><strong>Brake System: </strong>CBS</td></tr><tr><td style='text-align:justify'>Wheels&nbsp;</td><td style='text-align:justify'><strong>Type: </strong>Alloy<br><strong>Front</strong>: 12 inches<br><strong>Rear</strong>: 10 inches</td></tr><tr><td style='text-align:justify'>Tyres</td><td style='text-align:justify'><strong>Type</strong>: Tubeless<br><strong>Front</strong>: 90/90-12<br><strong>Rear</strong>: 90/100-10</td></tr><tr><td style='text-align:justify'>Dimensions</td><td style='text-align:justify'><strong>Overall Length</strong>: 1,870 mm<br><strong>Overall Width: </strong>690 mm<br><strong>Overall Height: </strong>1,160 mm<br><strong>Ground Clearance</strong>: 160 mm<br><strong>Seat Height: </strong>773 mm</td></tr><tr><td style='text-align:justify'>Kerb Weight</td><td style='text-align:justify'>104 Kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Additional Features</strong></h2><p style='text-align:justify'>The Yamaha Fascino 125 comes with several additional features that enhance the riding experience, which are as follows -</p><ul><li style='text-align:justify'><strong>LED Headlamps</strong>: Offers excellent visibility in low-light conditions.</li></ul><ul><li style='text-align:justify'><strong>Multi-Function Key Switch</strong>: Comes with several useful functions like a seat opener, fuel lid opener, and an external fuel filling cap for added convenience.</li></ul><ul><li style='text-align:justify'><strong>Side Stand Engine Cut-Off Switch</strong>: Ensures that the engine automatically switches off if the side stand is engaged, preventing accidents.</li></ul><ul><li style='text-align:justify'><strong>Smart Motor Generator System</strong>: Offers a smooth start &amp; stops function and saves fuel by automatically stopping the engine when idle for too long.</li></ul><ul><li style='text-align:justify'><strong>Combined Braking System</strong>: Ensures efficient &amp; safe braking by distributing braking force to both wheels simultaneously.</li></ul><ul><li style='text-align:justify'><strong>Large Under-Seat Storage Space</strong>: Offers ample under-seat space - 21.8 L, making it easy to carry essentials like a helmet, bag, or other items.</li></ul><ul><li style='text-align:justify'><strong>Easy-to-Read Instrument Panel</strong>: Features a speedometer, odometer, fuel gauge, and trip meter for added convenience.</li></ul><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Variants</strong></h2><p style='text-align:justify'>Yamaha Motor India offers Fascino 125 in 5 variants for you to choose from based on different braking systems; check the table below to see the prices -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Fascino 125 Hybrid - Disc Special Edition&nbsp;</td><td style='text-align:justify'>Rs 87,330</td></tr><tr><td style='text-align:justify'>Fascino 125 Hybrid - Disc Deluxe&nbsp;</td><td style='text-align:justify'>Rs 91,030</td></tr><tr><td style='text-align:justify'>Fascino 125 Hybrid - Drum Deluxe</td><td style='text-align:justify'>Rs 79,600</td></tr><tr><td style='text-align:justify'>Fascino 125 Hybrid - Disc</td><td style='text-align:justify'>Rs 88,230</td></tr><tr><td style='text-align:justify'>Fascino 125 Hybrid - Drum</td><td style='text-align:justify'>Rs 78,600</td></tr></tbody></table><h2 style='text-align:justify'><strong>Yamaha Fascino 125 Competitors in the Market</strong></h2><p style='text-align:justify'>Yamaha Fascino 125 directly competes with the following scooter models in the Indian 2-wheeler market -</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Yamaha Fascino 125 Rivals</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/tvs-scooters/ntorq-125' target='_blank'><span style='color:#e67e22'>TVS NTORQ 125</span></a></strong></td><td style='text-align:justify'>Rs 84,386 - 1,04 Lakh</td></tr><tr><td style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/honda-scooters/activa-6g'><span style='color:#e67e22'>Honda Activa 6G</span></a></strong></td><td style='text-align:justify'>Rs 73,531 - 78,016</td></tr><tr><td style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/honda-scooters/dio' target='_blank'><span style='color:#e67e22'>Honda Dio</span></a></strong></td><td style='text-align:justify'>Rs 67,817 - 74,353</td></tr><tr><td style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/tvs-scooters/jupiter-125' target='_blank'><span style='color:#e67e22'>TVS Jupiter 125</span></a></strong></td><td style='text-align:justify'>Rs 83,605 - 90,405</td></tr><tr><td style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/suzuki-scooters/access-125' target='_blank'><span style='color:#e67e22'>Suzuki Access 125</span></a></strong></td><td style='text-align:justify'>Rs 79,600 - 89,500</td></tr></tbody></table><h2 style='text-align:justify'><strong>Why BikeJunction for Yamaha Fascino 125?</strong></h2><p style='text-align:justify'>BikeJunction is an ideal platform for riders who want to stay up-to-date on the latest news and updates regarding Yamaha Fascino mileage &amp; more. We offer a wealth of information about this popular scooter, including everything from technical specifications and pricing details to expert reviews and user ratings. Whether you're a seasoned rider or simply a beginner, we can provide you with all the information you need to make an informed decision about purchasing a Yamaha Fascino 125.</p><p style='text-align:justify'>With a team of experienced writers and researchers, we are constantly scouring the internet and industry sources for the latest news &amp; developments related to this scooter. In addition, we offer an intelligent comparison tool that lets you compare Fascino 125 with other rivals in the market. So, choose BikeJunction, where you get access to the most engaging, informative articles &amp; reviews.&nbsp;</p><quillbot-extension-portal></quillbot-extension-portal>"
  },
  {
    "id": 1012,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/scram-411",
    "content": "<p>Royal Enfield Scram 411 Bike is one of India’s most reputed 2-wheelers. The Scram 411 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Scram 411 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 411 CC engine that produces 24.3BHP(17.88KW)@6500RPM power, 38.23 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Scram 411 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Royal Enfield Scram 411 Price In India</strong></p> <p>Royal Enfield Scram 411 Price in India starts from ₹ 2.45 Lakh and goes up to ₹ 2.51 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Royal Enfield Scram 411 Bike. However, it is necessary to know that the on-road price of the Scram 411 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Royal Enfield Scram 411 Engine</strong></p><p>Royal Enfield Scram 411 engine capacity is 411 CC and engineered with SINGLE CYLINDER, 4 STROKE, AIR COOLED, SOHC, FUEL INJECTION engine. This engine generates 24.3BHP(17.88KW)@6500RPM and 32NM@4250±250RPM of Torque. The engine of Scram 411 is aligned with a 5 Speed gear transmission.</p> <p><strong>Royal Enfield Scram 411 Mileage</strong></p><p>Royal Enfield Scram 411 mileage is 38.23 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p><p><strong>Royal Enfield Scram 411 Brakes &amp; Suspension</strong></p><p>Royal Enfield Scram 411 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Scram 411 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Royal Enfield Scram 411</strong></p><p>Royal Enfield Scram 411 at BikeJunction is available with complete information. In addition you can easily get the Royal Enfield Scram 411 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Royal Enfield Scram 411 Bike with your other top choices.</p>"
  },
  {
    "id": 1986,
    "url": "https://bikes.tractorjunction.com/en/honda-scooters/dio-125/",
    "content": "<p>Honda Dio 125 Scooter is one of India’s most reputed 2-wheelers. The Dio 125 Scooter is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda Dio 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 123.92 CC engine that produces 6.09 kW @ 6250 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. Honda Dio 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda Dio 125 Price In India</strong></p> <p>Honda Dio 125 Price in India starts from ₹ 83,400 and goes up to ₹ 91,300. BikeJunction provides you a complete list of the updated and accurate price range of Honda Dio 125 Scooter. However, it is necessary to know that the on-road price of the Dio 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Dio 125 Engine</strong></p><p>Honda Dio 125 engine capacity is 123.92 CC and engineered with 4 Stroke, SI Engine engine. This engine generates 6.09 kW @ 6250 rpm and 10.4 N-m@5000 rpm of Torque. The engine of Dio 125 is aligned with the Dry Type clutch.</p><p> </p><p><strong>Honda Dio 125 Mileage</strong></p><p>Honda Dio 125 mileage is 50 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5.3 litres. This combination gives this Scooter a good driving range.</p><p><strong>Honda Dio 125 Brakes &amp; Suspension</strong></p><p>Honda Dio 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Dio 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda Dio 125</strong></p><p>Honda Dio 125 at BikeJunction is available with complete information. In addition you can easily get the Honda Dio 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Dio 125 Scooter with your other top choices.</p>"
  },
  {
    "id": 1013,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
    "content": "<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p><p style='text-align:justify'>The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2><p style='text-align:justify'>Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p><p style='text-align:justify'>In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350&nbsp;</td><td style='text-align:justify'>Rs 1.9 - 2.21 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Mileage</strong></h2><p style='text-align:justify'>The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350</td><td style='text-align:justify'>41.55 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2'><strong>Suspension:</strong></td><td style='text-align:center'><strong>Front Suspension:</strong></td><td style='text-align:center'>Telescopic, 41mm forks, 130mm trave</td></tr><tr><td style='text-align:center'><strong>Rear Suspension:</strong></td><td style='text-align:center'>Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Brakes:</strong></strong></td><td style='text-align:center'><strong>Front Brake:</strong></td><td style='text-align:center'>300 mm disc, 2-piston calliper</td></tr><tr><td style='text-align:center'><strong>Rear Brake: </strong></td><td style='text-align:center'>270 mm disc, single-piston calliper</td></tr><tr><td style='text-align:center'><strong>ABS: </strong></td><td style='text-align:center'>Single &amp; Dual-channel ABS</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Tyres:</strong></strong></td><td style='text-align:center'><strong>Front Tyre:</strong></td><td style='text-align:center'>90/90 - 19, 52P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Rear Tyre: </strong></td><td style='text-align:center'>110/90 - 18, 61P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Wheels</strong></td><td style='text-align:center'>Spoke/Alloy wheels</td></tr><tr><td colspan='1' rowspan='7'><strong><strong>Dimensions:</strong></strong></td><td style='text-align:center'><strong>Length:</strong></td><td style='text-align:center'>2,145 mm</td></tr><tr><td style='text-align:center'><strong>Width:</strong></td><td style='text-align:center'>785 mm</td></tr><tr><td style='text-align:center'><strong>Height:</strong></td><td style='text-align:center'>1,090 mm</td></tr><tr><td style='text-align:center'><strong>Wheelbase:</strong></td><td style='text-align:center'>1,390mm</td></tr><tr><td style='text-align:center'><strong>Ground Clearance:</strong></td><td style='text-align:center'>170 mm</td></tr><tr><td style='text-align:center'><strong>Seat Height:</strong></td><td style='text-align:center'>805 mm</td></tr><tr><td style='text-align:center'><strong>Kerb Weight:</strong></td><td style='text-align:center'>195kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Additional Features</strong></h2><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Dual-channel ABS</strong>:</td><td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td></tr><tr><td><strong>LED headlamp</strong>:</td><td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td></tr><tr><td><strong>Digital instrument cluster</strong>:</td><td>Displays information such as speed, odometer, fuel gauge, and more.</td></tr><tr><td><strong>Tubeless tyres</strong>:</td><td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td></tr><tr><td><strong>Electric start</strong>:</td><td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td></tr><tr><td><strong>Disc brakes</strong>:</td><td>Provides superior stopping power &amp; better control over the bike.</td></tr><tr><td><strong>Fuel injection system</strong>:</td><td>Delivers precise fueling and improves fuel efficiency.</td></tr><tr><td><strong>Split seats</strong>:</td><td>Offers added comfort to the rider &amp; the pillion.</td></tr><tr><td><strong>Stylish design</strong>:</td><td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Variants</strong></h3><p style='text-align:justify'>Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon - Single Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 1.93 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 2.11 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Dark - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Chrome - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.21 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Reddtich - Single Channel ABS</td><td style='text-align:justify'>Rs 1.19 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon&nbsp; - Dual Channel ABS</td><td style='text-align:justify'>Rs 1.99 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3><p style='text-align:justify'>The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Benelli Imperial 400</strong></td><td style='text-align:justify'>Rs 1.89 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa Perak</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB350RS</strong></td><td style='text-align:justify'>Rs 2.05 - 2.06 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa 42</strong></td><td style='text-align:justify'>Rs 1.67 - 1.81 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:center'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Classic 350&nbsp;</strong></td><td style='text-align:center'>20,682</td><td style='text-align:center'>26,134</td><td style='text-align:center'>27,461</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3><p style='text-align:justify'>We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p><p style='text-align:justify'>Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p><p style='text-align:justify'>And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes/' target='_blank'><span style='color:#f39c12'>Royal Enfield Bike</span></a></strong> today with BikeJunction!</p><h3 style='text-align:justify'><strong>Key Highlights of Royal Enfield Classic 350</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Engine Capacity</strong></td><td>349.34 cc</td></tr><tr><td><strong>Mileage</strong></td><td>41.55 kmpl</td></tr><tr><td><strong>Kerb Weight</strong></td><td>195 kg</td></tr><tr><td><strong>Fuel Tank Capacity</strong></td><td>13L</td></tr><tr><td><strong>Max Power</strong></td><td>20.21 PS @ 6100 rpm</td></tr></tbody></table>"
  },
  {
    "id": 938,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/splendor-plus",
    "content": "<p></p><p>Hero Splendor Plus is one of India’s most reputed 2-wheelers. Splendor Plus is among the highest-selling commuter bikes by Hero MotoCorp in the Indian market. Splendor Plus is manufactured by Hero, popularly known for their technologically advanced manufacturing value. With a sturdy bulletproof built quality, simple design, high mileage of 60 Kmpl &amp; a top speed of 87 kmph, Hero Splendor Plus is among the highest-selling commuter bikes in India. The ex-showroom price range of Hero Splendor Plus is Rs 70,933 to Rs 72,125.</p><p></p><p style='text-align:justify'>Hero Splendor Plus boasts high-tech specifications like a 97.2 CC engine that produces 5.9 kW @ 8000 rpm power and powered by a <strong>BS6-compliant 97.2cc, air-cooled, 4-stroke single-cylinder engine</strong>. The bike further features an <strong>electric start, integrated braking system, i3S technology, tubeless tyres</strong> and more. Hero Splendor Plus has a <strong>fuel tank capacity of 9.8 litres</strong>. This bike is available in <strong>9 different colour options</strong> and <strong>4 different variants</strong>.&nbsp;</p><h3 style='text-align:justify'><strong>Hero Splendor Plus Engine Specifications</strong></h3><p style='text-align:justify'>Hero Splendor Plus is fitted with a <strong>97.2 CC Air-Cooled, 4-Stroke, Single Cylinder, OHC</strong> engine type. This<strong> BS6-Compliant engine</strong> generates a total power output of <strong>7.91 bhp @ 8000 rpm</strong> and <strong>8.05 nm torque @ 6000 rpm</strong>. This engine is perfectly tuned with a <strong>4-speed gearbox</strong>.</p><h2 style='text-align:justify'><strong>Hero Splendor Plus Price In India</strong></h2><p style='text-align:justify'>Hero Splendor Plus Price in India starts from Rs. 72,076 and goes up to Rs. 74,396. BikeJunction provides you a complete list of the updated and accurate price range of Hero Splendor Plus. However, it is necessary to know that the on-road price of the Splendor Plus may differ from state to state, depending upon their specific government taxation policies.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>EX-showroom Price (Delhi)</strong></td></tr><tr><td style='text-align:justify'>Hero Splendor Plus</td><td style='text-align:justify'>Rs 72,076 - 74,396</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h2 style='text-align:justify'><strong>Hero Splendor Plus Mileage</strong></h2><p style='text-align:justify'>The BS6 Hero Splendor Plus has a <strong>9.8-litre</strong> fuel tank capacity along with<strong> i3S technology</strong> (<strong>Idle Stop-Start System</strong>). In addition, it boasts a <strong>programmed fuel injection fuel system</strong> that significantly helps boost the bike mileage. The mileage of Hero Splendor Plus is 60 Kmpl which is very adequate and provides a good driving range.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Hero Splendor Plus&nbsp;</td><td style='text-align:justify'>60 Kmpl</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h2 style='text-align:justify'><strong>Hero Splendor Plus Technical Specifications</strong></h2><p style='text-align:justify'>The technical specifications of the new Hero bike are simple but reliable.&nbsp;</p><ul><li style='text-align: justify;'><strong>Braking System</strong> - The braking duties on the bike are handled by<strong> 130 mm drum brakes</strong> fitted on <strong>both front and rear</strong>. The bike features a <strong>combined braking system as standard</strong>.</li><li style='text-align:justify'><strong>Suspension System</strong><strong> -</strong> For suspension duties, the bike is built with <strong>Telescopic Hydraulic Shock Absorbers</strong> at the front and a <strong>Swingarm with 5-step Adjustable Hydraulic Shock Absorbers</strong> at the rear.&nbsp;</li><li style='text-align:justify'><strong>Type of Tyres</strong> - Splendor+ comes with <strong>tubeless 18-inch tyres</strong> on both front and rear.</li><li style='text-align:justify'><strong>Dimensions</strong> - Splendor+ is <strong>2000 mm in length</strong>, <strong>720 mm in width</strong> and <strong>1236 mm in height</strong>. Furthermore, it has a <strong>wheelbase of 1236 mm</strong> and a<strong> ground clearance of 165 mm.&nbsp;</strong></li><li style='text-align:justify'><strong><strong>Weight</strong> - This Hero bike has a <strong>kerb weight of 123 kg</strong>.</strong></li></ul><h2 style='text-align:justify'><strong>Hero Splendor Plus Additional Features</strong></h2><p style='text-align:justify'>Here are multiple value-adding features of Hero Splendor Plus, setting it apart from its rivals:</p><ul><li style='text-align:justify'><strong><strong>xSens Programmed Fi Technology</strong> - The tech uses a total of nine sensors to improve the performance, durability, safety, reliability and fuel economy of the bike.</strong></li></ul><ul><li style='text-align:justify'><strong>i3S Technology</strong> - i3s stands for Idle Stop-Start System, which Hero MotoCorp developed to enhance the mileage of their bikes.</li></ul><ul><li style='text-align:justify'><strong>Integrated Braking System</strong> - This system is designed to distribute the braking force throughout the bike, giving users a quick &amp; smooth braking experience.</li></ul><ul><li style='text-align:justify'><strong>Side Stand Indicator</strong> - This sensor provides added safety by cutting off the engine when the bike is on the side stand. The indicator is in the instrument cluster, adding to rider convenience.&nbsp;</li></ul><ul><li style='text-align:justify'><strong>5-Year Warranty</strong> - Hero MotoCorp offers a warranty of 5 years on this exclusive bike.</li></ul><h2 style='text-align:justify'><strong>Hero Splendor Plus Variants</strong></h2><p style='text-align:justify'>This model is available in 4 variants. Here is the list of all 4 Hero Splendor variants along with their <strong>ex-showroom price (Delhi)</strong>.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Splendor Plus Variants</strong></td><td style='text-align:justify'><strong>Ex-showroom Price (Delhi)</strong></td></tr><tr><td style='text-align:justify'>Splendor+ Drum Self Cast</td><td style='text-align:justify'>Rs 72,076</td></tr><tr><td style='text-align:justify'>Splendor+ i3S Drum Self Cast Black and Accent&nbsp;</td><td style='text-align:justify'>Rs 73,396</td></tr><tr><td style='text-align:justify'>Splendor+ i3S Drum Self Cast&nbsp;</td><td style='text-align:justify'>Rs 73,396</td></tr><tr><td style='text-align:justify'>Splendor+ i3S Drum Self Cast Matt Shield Gold</td><td style='text-align:justify'>Rs 74,396</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h2 style='text-align:justify'><strong>Hero Splendor Plus Competitors</strong></h2><p style='text-align:justify'>Hero Splendor Plus is counted as one of the most popular commuter bikes in India. It directly competes with the following models in the Indian 2-wheeler market.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Hero Splendor Plus Rivals</strong></td><td style='text-align:justify'><strong>Price Range</strong></td></tr><tr><td style='text-align:justify'>Honda Shine 100</td><td style='text-align:justify'>Rs 64,900</td></tr><tr><td style='text-align:justify'>TVS Radeon&nbsp;</td><td style='text-align:justify'>Rs 60,925</td></tr><tr><td style='text-align:justify'>TVS Sport</td><td style='text-align:justify'>Rs 64,050</td></tr><tr><td style='text-align:justify'>Honda CD 110 Dream</td><td style='text-align:justify'>Rs 71,133</td></tr><tr><td style='text-align:justify'>Bajaj CT 110</td><td style='text-align:justify'>Rs 67,322</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h2 style='text-align:justify'><strong>Why BikeJunction for Hero Splendor Plus?</strong></h2><p style='text-align:justify'>BikeJunction is a one-stop destination where you can explore and learn all the information regarding the new Hero Splendor Plus price, technical specifications and more. In addition, you can use our innovative and easy-to-use comparison tool. This tool allows you to put Splendor Plus against your other preferred options easily.&nbsp;</p><p style='text-align:justify'>We have also made an exclusive section where you can find all the authentic Hero dealership showrooms in your preferred city, along with their address and contact details.</p><p style='text-align:justify'>Furthermore, you get all the latest bike and brand updates through our news section. So now you can find Hero Splendor Plus mileage, engine type, power output, weight, handling, ergonomics and more all under one roof. So, what are you waiting for? Bring home the keys to your new Hero Splendor Plus bike today with BikeJunction!</p>"
  },
  {
    "id": 960,
    "url": "https://bikes.tractorjunction.com/en/yezdi-bikes/scrambler",
    "content": "<p>Yezdi Scrambler Bike is one of India’s most reputed 2-wheelers. The Scrambler Bike is manufactured by Yezdi, popularly known for their technologically advanced manufacturing value. Yezdi Scrambler Bike belongs to the Bike category. The Bike boasts high-tech specifications like 334 CC engine that produces 28.7 bhp @ 8,000 rpm power, 28 Kmpl mileage and giving the most superior driving experience to its users. Yezdi Scrambler Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Yezdi Scrambler Price In India</strong></p> <p>Yezdi Scrambler Price in India starts from ₹ 2.08 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Yezdi Scrambler Bike. However, it is necessary to know that the on-road price of the Scrambler Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Yezdi Scrambler Engine</strong></p><p>Yezdi Scrambler engine capacity is 334 CC and engineered with Liquid Cooled , 1 Cylinder, 4 Valve engine. This engine generates 28.7 bhp @ 8,000 rpm and 28.2 Nm @ 6,750 rpm of Torque. The engine of Scrambler is aligned with a 1 Down 5 Up gear transmission.</p> <p><strong>Yezdi Scrambler Mileage</strong></p><p>Yezdi Scrambler mileage is 28 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12.5 L litres. This combination gives this Bike a good driving range.</p><p><strong>Yezdi Scrambler Brakes &amp; Suspension</strong></p><p>Yezdi Scrambler comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Scrambler Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Yezdi Scrambler</strong></p><p>Yezdi Scrambler at BikeJunction is available with complete information. In addition you can easily get the Yezdi Scrambler on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Yezdi Scrambler Bike with your other top choices.</p>"
  },
  {
    "id": 1123,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/himalayan",
    "content": "<p>Royal Enfield Himalayan Bike is one of India’s most reputed 2-wheelers. The Himalayan Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Himalayan Bike belongs to the Bike category. The Bike boasts high-tech specifications like 411 CC engine that produces 24.3 bhp @ 6,500 rpm power, 32.4 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Himalayan Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>The Royal Enfield Himalayan is India’s most powerful adventure bike, available at a price ranging between <strong>Rs 2.15 to 2.22 Lakh.</strong> The Himalayan BS6 is specifically manufactured for your off-roading adventures with a robust <strong>411cc, air-cooled, single-cylinder, SOHC engine</strong>. This adventure bike offers a maximum power output of <strong>24.3 bhp &amp; 32 Nm</strong>.</p><p style='text-align:justify'>The Royal Enfield Himalayan <strong>mileage is 32.4 Kmpl </strong>with a total <strong>fuel tank capacity of 15 Litres</strong>. With this bike, you can easily reach a<strong> top speed of 145 kmph</strong>. In addition, you get additional features like <strong>dual-channel ABS</strong>, a <strong>windshield</strong>, a <strong>skid plate </strong>and <strong>luggage mounts</strong>, making it a perfect choice for your long-distance trips. Additionally, it features a <strong>compass</strong>, a unique feature that helps you navigate through unfamiliar terrain easily. Royal Enfield Himalayan <strong>color options </strong>include-<strong> Sleet Black</strong>,<strong> Gravel Grey</strong>,<strong> Granite Black</strong>,<strong> Pine Green</strong>,<strong> Glacier Blue</strong>, and <strong>Dune Brown</strong>.</p><h2 style='text-align:justify'><strong>Royal Enfield Himalayan Engine Specifications</strong></h2><p style='text-align:justify'>At the heart of Himalayan Royal Enfield lies a powerful <strong>411 cc, single-cylinder, air-cooled engine</strong>. This RE engine is capable of delivering a maximum output power of <strong>24.3 bhp @ 6,500 rpm</strong> and <strong>32 Nm @ 4,500 rpm of peak torque</strong>. The engine is further paired with a <strong>5-speed gearbox</strong> and features a <strong>fuel injection system</strong> that ensures smooth &amp; efficient power delivery.&nbsp;</p><p style='text-align:justify'>With these features, the Himalayan can easily reach a <strong>top speed of 145 kmph</strong>, making it an ideal option for riders who crave speed and adventure.</p><h2 style='text-align:justify'><strong>Royal Enfield Himalayan Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Himalayan Price in India is among the most popular aspects of this bike. The bike’s price starts at<strong> Rs 2.15 Lakhs</strong> and goes up to <strong>Rs 2.22 Lakhs</strong>.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'>Model Name</td><td style='text-align:justify'>Price in India</td></tr><tr><td style='text-align:justify'>Royal Enfield Himalayan</td><td style='text-align:justify'>Rs 2.15 - 2.22 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><strong>New Royal Enfield Himalayan Mileage</strong></h2><p style='text-align:justify'>The Royal Enfield Himalayan&nbsp;350 mileage is among the biggest selling points of the bike. This bike offers a high<strong> mileage of 32.4 kmpl</strong> which adds to better fuel economy.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield&nbsp;</td><td style='text-align:justify'>32.4 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Himalayan Technical Specifications</strong></h2><p style='text-align:justify'>Himalayan Royal Enfield is power-packed with the following specifications that make it a most suitable choice for off-roading, touring, or simply commuting around the city.</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Hardware</strong></td><td style='text-align:justify'><strong>Type of Hardware</strong></td></tr><tr><td style='text-align:justify'>Frame</td><td style='text-align:justify'>Half- Duplex Split cradle Frame</td></tr><tr><td style='text-align:justify'>Suspensions&nbsp;</td><td style='text-align:justify'><strong>Front- </strong>Telescopic, 41 mm forks, 200 mm travel<br><strong>Rear - </strong>Monoshock with linkage, 180 mm wheel travel&nbsp;&nbsp;</td></tr><tr><td style='text-align:justify'>Brake</td><td style='text-align:justify'><strong>Front </strong>- Disc<br><strong>Rear </strong>- Disc<br><strong>ABS </strong>as standard&nbsp;</td></tr><tr><td style='text-align:justify'>Wheel Size (Spoke)</td><td style='text-align:justify'><strong>Front </strong>- 21 inch<br><strong>Rear </strong>- 17 inch</td></tr><tr><td style='text-align:justify'>Tyre Size (Tubed)</td><td style='text-align:justify'><strong>Front </strong>- 90/90<br><strong>Rear </strong>- 120/90</td></tr><tr><td style='text-align:justify'>Dimensions&nbsp;</td><td style='text-align:justify'><strong>Length </strong>- 2,190 mm<br><strong>Width </strong>- 840 mm<br><strong>Height </strong>- 1,370 mm<br><strong>Wheelbase </strong>- 1,465 mm<br><strong>Ground clearance </strong>- 220 mm<br><strong>Seat Height </strong>- 800 mm</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Himalayan Additional Features</strong></h2><p style='text-align:justify'>The Royal Enfield Himalayan 2023 is a popular adventure-touring bike with multiple additional features that support off-road riding &amp; long-distance touring.</p><ul><li style='text-align:justify'><strong>Long-Travel Suspension</strong>: It features a 41 mm telescopic fork at the front and a mono-shock at the rear, which helps to absorb bumps and rough terrain easily.</li></ul><ul><li style='text-align:justify'><strong>Spoked Wheels</strong>: Provides better grip and stability on off-road terrain.</li></ul><ul><li style='text-align:justify'><strong>Dual-Purpose Tyres</strong>: Offers good traction on both on-road and off-road surfaces.</li></ul><ul><li style='text-align:justify'><strong>Ground Clearance</strong>: The Himalayan has a high ground clearance of 220mm, making navigating rough terrain and obstacles easier.</li></ul><ul><li style='text-align:justify'><strong>Windshield</strong>: The tall windshield provides protection from wind and debris while riding at higher speeds.</li></ul><ul><li style='text-align:justify'><strong>ABS</strong>: The dual-channel ABS helps to prevent the wheels from locking up during sudden braking.</li></ul><ul><li style='text-align:justify'><strong>Fuel Tank</strong>: The large fuel tank, with a capacity of 15 litres, enables longer rides without the need for frequent refuelling.</li></ul><ul><li style='text-align:justify'><strong>Comfortable Seat</strong>: The comfortable, long seat allows for extended hours of riding without causing discomfort.</li></ul><h3 style='text-align:justify'><strong>Royal Enfield Himalayan Variants</strong></h3><p style='text-align:justify'><strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes' target='_blank'><span style='color:#f39c12'>Royal Enfield</span></a></strong> offers its Himalayan motorcycle with 3 variants for users to choose from, which are as follows:</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'><strong>Himalayan Pine Green and Granite Black&nbsp;</strong></td><td style='text-align:justify'>Rs 2.22 Lakh&nbsp;</td></tr><tr><td style='text-align:justify'><strong>Himalayan Dual Tone - BS VI (2021)</strong></td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'><strong>Himalayan Standard - BS VI (2021)</strong></td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr></tbody></table><h3 style='text-align:justify'><strong>Royal Enfield Himalayan Competitors in the Market</strong></h3><p style='text-align:justify'>Royal Enfield Himalayan directly competes with the following cruiser bike models in the Indian 2-wheeler market -</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Hero Xpulse 200 BS6</strong></td><td style='text-align:justify'>Rs 1.27 Lakh</td></tr><tr><td style='text-align:justify'><strong>KTM Adventure 250&nbsp;</strong></td><td style='text-align:justify'>Rs 2.44 Lakh</td></tr><tr><td style='text-align:justify'><strong>Yezdi Adventure</strong></td><td style='text-align:justify'>Rs 2.13 - 2.24 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB300F</strong></td><td style='text-align:justify'>Rs 2.26 Lakh - 2.29 Lakh</td></tr><tr><td style='text-align:justify'><strong>Bajaj Dominar 400</strong></td><td style='text-align:justify'>Rs 2.25 Lakh</td></tr><tr><td style='text-align:justify'><strong>JAWA Perak&nbsp;</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr></tbody></table><h3 style='text-align:justify'><strong>Royal Enfield Himalayan Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Himalayan monthly sales figures looked like in the last 3 months -</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:justify'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Himalayan</strong></td><td style='text-align:justify'>2,257</td><td style='text-align:justify'>2,499</td><td style='text-align:justify'>2,841</td></tr></tbody></table><h3 style='text-align:justify'><strong>Why BikeJunction for Royal Enfield Himalayan?</strong></h3><p style='text-align:justify'>At BikeJunction, we strive to deliver you the most accurate and updated information on Royal Enfield Himalayan specs. With us, you can easily scroll through all the details, including engine specs, power output, handling, mileage, value-adding features and more.&nbsp;</p><p style='text-align:justify'>In addition, you can also use our innovative &amp; easy-to-use comparison tool that lets you put RE Himalayan against your other preferred options. We have made it simple for you to get the most accurate Royal Enfield Himalayan Ex showroom price in the country.&nbsp;</p><p style='text-align:justify'>And last but not least, if you wish to know more about the brand Royal Enfield, you can explore our news section. In this exclusive section, we regularly provide you updates on the brand and all its upcoming launches.&nbsp;</p>"
  },
  {
    "id": 1309,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-150",
    "content": "<p>Bajaj Pulsar 150 Bike is one of India’s most reputed 2-wheelers. The Pulsar 150 Bike is manufactured by Bajaj, popularly known for their technologically advanced manufacturing value. Bajaj Pulsar 150 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 149.5 CC engine that produces 13.81 bhp @ 8500 rpm power, 48 Kmpl mileage and giving the most superior driving experience to its users. Bajaj Pulsar 150 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Bajaj Pulsar 150 Price In India</strong></p> <p>Bajaj Pulsar 150 Price in India starts from ₹ 1.04 Lakh and goes up to ₹ 1.2 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Bajaj Pulsar 150 Bike. However, it is necessary to know that the on-road price of the Pulsar 150 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Bajaj Pulsar 150 Engine</strong></p><p>Bajaj Pulsar 150 engine capacity is 149.5 CC and engineered with 4-Stroke, 2-Valve, Twin Spark BSVI Compliant DTS-i FI Engine engine. This engine generates 13.81 bhp @ 8500 rpm and 13.25 Nm @ 6500 rpm of Torque. The engine of Pulsar 150 is aligned with a 5 Speed gear transmission.</p> <p><strong>Bajaj Pulsar 150 Mileage</strong></p><p>Bajaj Pulsar 150 mileage is 48 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p><p><strong>Bajaj Pulsar 150 Brakes &amp; Suspension</strong></p><p>Bajaj Pulsar 150 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Pulsar 150 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Bajaj Pulsar 150</strong></p><p>Bajaj Pulsar 150 at BikeJunction is available with complete information. In addition you can easily get the Bajaj Pulsar 150 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Bajaj Pulsar 150 Bike with your other top choices.</p>"
  },
  {
    "id": 1007,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
    "content": "<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p><p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p><p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p><p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>"
  },
  {
    "id": 891,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/pleasure-plus-xtec",
    "content": "<p>Hero Pleasure + Xtec Scooter is one of India’s most reputed 2-wheelers. The Pleasure + Xtec Scooter is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Pleasure + Xtec Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 110.9 CC engine that produces 7.99 bhp @ 7000 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. Hero Pleasure + Xtec Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Pleasure + Xtec Price In India</strong></p> <p>Hero Pleasure + Xtec Price in India starts from ₹ 68,368 and goes up to ₹ 77,268. BikeJunction provides you a complete list of the updated and accurate price range of Hero Pleasure + Xtec Scooter. However, it is necessary to know that the on-road price of the Pleasure + Xtec Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Pleasure + Xtec Engine</strong></p><p>Hero Pleasure + Xtec engine capacity is 110.9 CC and engineered with Air cooled, 4-Stroke Single Cylinder OHC engine. This engine generates 7.99 bhp @ 7000 rpm and 8.70 Nm @ 5500 rpm of Torque. The engine of Pleasure + Xtec is aligned with the Dry Automatic Centrifugal Clutch clutch.</p><p> </p><p><strong>Hero Pleasure + Xtec Mileage</strong></p><p>Hero Pleasure + Xtec mileage is 50 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 4.8 L litres. This combination gives this Scooter a good driving range.</p><p><strong>Hero Pleasure + Xtec Brakes &amp; Suspension</strong></p><p>Hero Pleasure + Xtec comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Pleasure + Xtec Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Pleasure + Xtec</strong></p><p>Hero Pleasure + Xtec at BikeJunction is available with complete information. In addition you can easily get the Hero Pleasure + Xtec on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Pleasure + Xtec Scooter with your other top choices.</p>"
  },
  {
    "id": 1543,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/tork/kratos-r",
    "content": "<p>The Tork Kratos R is a well known electric Bike in the Electric vehicle sector of India. This Kratos R Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Tork Kratos R enhance the overall performance.</p><p><strong>Tork Kratos R Price In India</strong></p><p>Tork Kratos R price in India starts from 1.58 Lakh. The new model of this Kratos R electric Bike is available in 1 colours. In addition you can avail an updated price of Tork Kratos R on the basis of its colours &amp; variants. The Tork Kratos R electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Tork Kratos R Range</strong></p><p>Tork Kratos R is fitted with a N/A and has a Li-ion type of battery. This battery pack generates 9000 W power and N/A of Torque. The battery of Tork Kratos R is aligned with a Clutchless Single Speed transmission.</p><p><strong>Tork Kratos R Brakes &amp; Suspension</strong></p><p>Tork Kratos R delivers a Range of N/A KM in single charge. The Kratos R comes with a Axial Flux of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Tork Kratos R Electric Bike</strong></p><p>Tork Kratos R at BikeJunction is available with complete information. In addition you can easily get the Tork Kratos R on-road price in India. You can easily compare Tork Kratos R Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 1969,
    "url": "https://bikes.tractorjunction.com/en/honda-scooters/dio-125/",
    "content": "<p>Honda Dio 125 Scooter is one of India’s most reputed 2-wheelers. The Dio 125 Scooter is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda Dio 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 123.92 CC engine that produces 6.09 kW @ 6250 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. Honda Dio 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda Dio 125 Price In India</strong></p> <p>Honda Dio 125 Price in India starts from ₹ 83,400 and goes up to ₹ 91,300. BikeJunction provides you a complete list of the updated and accurate price range of Honda Dio 125 Scooter. However, it is necessary to know that the on-road price of the Dio 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Dio 125 Engine</strong></p><p>Honda Dio 125 engine capacity is 123.92 CC and engineered with 4 Stroke, SI Engine engine. This engine generates 6.09 kW @ 6250 rpm and 10.4 N-m@5000 rpm of Torque. The engine of Dio 125 is aligned with the Dry Type clutch.</p><p> </p><p><strong>Honda Dio 125 Mileage</strong></p><p>Honda Dio 125 mileage is 50 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5.3 litres. This combination gives this Scooter a good driving range.</p><p><strong>Honda Dio 125 Brakes &amp; Suspension</strong></p><p>Honda Dio 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Dio 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda Dio 125</strong></p><p>Honda Dio 125 at BikeJunction is available with complete information. In addition you can easily get the Honda Dio 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Dio 125 Scooter with your other top choices.</p>"
  },
  {
    "id": 929,
    "url": "https://bikes.tractorjunction.com/en/yamaha-bikes/mt-15-v2",
    "content": "<p>Yamaha MT 15 V2 Bike is one of India’s most reputed 2-wheelers. The MT 15 V2 Bike is manufactured by Yamaha, popularly known for their technologically advanced manufacturing value. Yamaha MT 15 V2 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 155 CC engine that produces 18.14 bhp @ 10,000 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. Yamaha MT 15 V2 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Yamaha MT 15 V2 Price In India</strong></p> <p>Yamaha MT 15 V2 Price in India starts from ₹ 1.68 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Yamaha MT 15 V2 Bike. However, it is necessary to know that the on-road price of the MT 15 V2 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Yamaha MT 15 V2 Engine</strong></p><p>Yamaha MT 15 V2 engine capacity is 155 CC and engineered with Liquid cooled, 4-stroke, SOHC, 4-valve engine. This engine generates 18.14 bhp @ 10,000 rpm and 14.1 Nm @ 7,500 rpm of Torque. The engine of MT 15 V2 is aligned with a 6 Speed gear transmission.</p> <p><strong>Yamaha MT 15 V2 Mileage</strong></p><p>Yamaha MT 15 V2 mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 10 L litres. This combination gives this Bike a good driving range.</p><p><strong>Yamaha MT 15 V2 Brakes &amp; Suspension</strong></p><p>Yamaha MT 15 V2 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the MT 15 V2 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Yamaha MT 15 V2</strong></p><p>Yamaha MT 15 V2 at BikeJunction is available with complete information. In addition you can easily get the Yamaha MT 15 V2 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Yamaha MT 15 V2 Bike with your other top choices.</p>"
  },
  {
    "id": 1570,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/gogoro/s1",
    "content": "<p>The gogoro S1 is a well known electric Scooter in the Electric vehicle sector of India. This S1 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of gogoro S1 enhance the overall performance.</p><p><strong>gogoro S1 Price In India</strong></p><p>gogoro S1 price in India starts from 1.5 Lakh. The new model of this S1 electric Scooter is available in 1 colours. In addition you can avail an updated price of gogoro S1 on the basis of its colours &amp; variants. The gogoro S1 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>gogoro S1 Range</strong></p><p>gogoro S1 is fitted with a N/A and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of gogoro S1 is aligned with a Automatic transmission.</p><p><strong>gogoro S1 Brakes &amp; Suspension</strong></p><p>gogoro S1 delivers a Range of N/A KM in single charge. The S1 comes with a Liquid Cooled, permanent magnet psynchronous of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy gogoro S1 Electric Scooter</strong></p><p>gogoro S1 at BikeJunction is available with complete information. In addition you can easily get the gogoro S1 on-road price in India. You can easily compare gogoro S1 Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1287,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/maestro-edge-125",
    "content": "<p>Hero Maestro Edge 125 Scooter is one of India’s most reputed 2-wheelers. The Maestro Edge 125 Scooter is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Maestro Edge 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 124.6 CC engine that produces 8.98 bhp @ 7000 rpm power, 65 Kmpl mileage and giving the most superior driving experience to its users. Hero Maestro Edge 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Hero Maestro Edge 125 is among the most popular scooters manufactured by Hero MotoCorp, priced at <strong>Rs 77,896 - 86,766</strong>. Maestro Edge 125 is powered by a powerful <strong>124.6 CC engine</strong> and features an aerodynamic design, offering an ideal combination of power and comfort. Moreover, the scooter offers a fantastic mileage delivery of <strong>65 Kmpl</strong>, making it a highly efficient scooter option in the market. Additionally, this scooter can easily achieve a top speed of <strong>90 Kmph</strong>.&nbsp;</p><p style='text-align:justify'>Along with an attractive Hero Maestro Edge price point, it also features a <strong>range of future-forward tech</strong> promoting best-in-class performance. These features include - <strong>a digital speedometer, a remote key</strong> and an <strong>external fuel-filling system.</strong> This BS6-compliant scooter is available in<strong> multiple colour options</strong> &amp; <strong>4 variants</strong>. It perfectly caters to the needs of riders looking for a versatile &amp; reliable scooter for their daily commute around the city.&nbsp;</p><p style='text-align:justify'><strong>Hero Maestro Edge 125 Engine Specifications</strong></p><p style='text-align:justify'>The Hero Maestro Edge 125 is fitted with a powerful &amp; efficient <strong>BS6-compliant engine</strong>. It is powered by a <strong>124.6cc, air-cooled, 4-stroke, SI, single-cylinder engine</strong>. This engine can effortlessly belt out a maximum power of <strong>8.98 bhp @ 7,000 rpm</strong> &amp; a peak torque of <strong>10.4 Nm @ 5,500 rpm</strong>. Additionally, Maestro Edge has a <strong>Variomatic Drive transmission </strong>that offers smooth &amp; effortless acceleration.</p><p style='text-align:justify'>The engine is tuned to a <strong>Fuel Injection system</strong>, ensuring precise &amp; efficient fuel delivery that results in improved engine performance with reduced emissions. In addition, this scooter is further equipped with an <strong>Advanced Sensor Technology (AST) system</strong>. This system provides users with real-time feedback to the engine control unit, enabling it to adjust the fuel injection &amp; ignition timing for optimum performance.</p><p style='text-align:justify'><strong>Hero Maestro Edge Price In India</strong></p><p style='text-align:justify'>Hero Maestro Edge’s price is highly competitive in the market. Offering 4 various variants, the price range of the scooter ranges between <strong>Rs 77,896 - 86,766 in India</strong>.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Hero Maestro Edge 125</td><td style='text-align:justify'>Rs 77,896 - 86,766</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>Hero Maestro Edge 125 Mileage</strong></p><p style='text-align:justify'>Equipped with an advanced Fuel Injection system, the Hero Maestro Edge 125 mileage is quite high - <strong>65 Kmpl</strong>, making it a fuel-efficient option for users.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Hero Maestro Edge 125</td><td style='text-align:justify'>65 Kmpl</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>Hero Maestro Edge 125 Technical Specifications</strong></p><p style='text-align:justify'>Following are the technical specifications of the Hero Maestro Edge 125 that provide a balance of power, efficiency, comfort, and safety.</p><ul><li style='text-align: justify;'><strong>Transmission</strong>: <strong>Variomatic Drive transmission</strong> offers smooth and effortless acceleration. This transmission is low-maintenance &amp; user-friendly, which makes it an ideal scooter for city commutes and long rides.</li></ul><ul><li style='text-align: justify;'><strong>Suspension</strong>: Comes with a telescopic hydraulic shock absorber at the front and unit swing with a spring-loaded hydraulic damper at the rear. This setup provides better stability and control.</li></ul><ul><li style='text-align: justify;'><strong>Brakes</strong>: Equipped with an Integrated Braking System (IBS), which synchronises the front &amp; rear brakes for better control and stopping power. The front brake is a 130mm disc brake, while the rear brake is a 130mm drum brake.</li></ul><ul><li style='text-align: justify;'><strong>Wheels &amp; Tyres</strong>: Has 457.2 mm alloy wheels that provide better stability &amp; handling, especially at high speeds. The wheels are paired with tubeless tyres with sizes 80/100 - 18 (front) and 100/80 - 18 (rear), which offer better grip and traction, even on wet roads.&nbsp;</li></ul><ul><li style='text-align: justify;'><strong>Dimensions &amp; Weight</strong>:&nbsp;<ul><li>Comes with dimensions of 1,843mm (length) x 715mm (width) x 1,190mm (height).&nbsp;</li><li>It has a wheelbase of 1,261mm and a ground clearance of 155mm.&nbsp;</li><li>It has a kerb weight of 111 kg, making it easy to handle &amp; manoeuvre in traffic.&nbsp;</li><li>The seat height of 775mm is also comfortable for riders of various heights.</li></ul></li></ul><p style='text-align:justify'><strong>Hero Maestro Edge 125 Additional Features</strong></p><p style='text-align:justify'>Here are a few of the additional advanced features of the Hero Maestro Edge 125:</p><ul><li style='text-align: justify;'><strong>Side Stand Indicator</strong>: Reminds the rider to retract the side stand before starting the engine. This helps prevent accidental damage to the scooter’s engine and also enhances the rider’s safety.</li></ul><ul><li style='text-align: justify;'><strong>External Fuel Filling</strong>: This makes it easy to refuel the scooter without having to open the seat or remove any parts. This feature adds to the user’s convenience and saves time.</li></ul><ul><li style='text-align: justify;'><strong>Mobile Charging Port</strong>: Allows riders to charge their mobile phones or other electronic devices on the go. This is a handy feature for riders who like to stay connected on the go.</li></ul><ul><li style='text-align: justify;'><strong>Boot Light</strong>: Illuminates the under-seat storage compartment, making it easy to locate and access items stored in the compartment. This feature is especially useful in low-light conditions.</li></ul><ul><li style='text-align: justify;'><strong>LED Tail Lamp &amp; Turn Indicators</strong>: Provide better visibility and enhance the scooter’s safety. LED lights are brighter and consume less power compared to conventional bulbs, which also contributes to better fuel efficiency.</li></ul><ul><li style='text-align: justify;'><strong>Digital Instrument Console</strong>: Displays various information such as speed, fuel level, odometer, trip metre, and a service reminder. This feature provides the rider with important information at a glance and helps keep track of the scooter’s performance and maintenance schedule.</li></ul><p style='text-align:justify'><strong>Hero Maestro Edge 125- Variants</strong></p><p style='text-align:justify'>Hero Maestro Edge 125 is offered in 4 variant models for you to choose from.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Maestro Edge 125 Connected - 2021</td><td style='text-align:justify'>Rs 86,766</td></tr><tr><td style='text-align:justify'>Maestro Edge 125 Disc - 2021</td><td style='text-align:justify'>Rs 82,346</td></tr><tr><td style='text-align:justify'>Maestro Edge 125 Drum - 2021</td><td style='text-align:justify'>Rs 77,896</td></tr><tr><td style='text-align:justify'>Maestro Edge 125 Prismatic Color Tech - BS VI</td><td style='text-align:justify'>Rs 82,766</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>Hero Maestro Edge 125 Competitors in the Market</strong></p><p style='text-align:justify'>Hero Maestro Edge 125 directly compete with the following scooters in the Indian market -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td style='text-align:justify'><strong>Name of the Model</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Honda Activa 6G</td><td style='text-align:justify'>Rs 73,531 - 78,016</td></tr><tr><td style='text-align:justify'>TVS NTORQ 125</td><td style='text-align:justify'>Rs 84,386 - 1.04 Lakh</td></tr><tr><td style='text-align:justify'>Suzuki Burgman Street 125&nbsp;</td><td style='text-align:justify'>Rs 89,287 - 92,851</td></tr><tr><td style='text-align:justify'>TVS Jupiter 125</td><td style='text-align:justify'>Rs 83,605 - 90,405</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><p style='text-align:justify'><strong>Why BikeJunction for Hero Maestro Edge 125?</strong></p><p style='text-align:justify'>BikeJunction is an ideal platform for riders looking to stay up-to-date on the latest updates regarding Hero Maestro Edge mileage &amp; more. We offer you a range of information about this popular scooter, including everything from technical specifications and pricing details to expert reviews and user ratings. We offer all the necessary details to make your Hero Maestro Edge 125 buying process hassle free.&nbsp;</p><p style='text-align:justify'>Our team of bike enthusiasts constantly scours the internet and industry sources for the latest news &amp; developments related to this scooter. In addition, we offer an intelligent comparison tool that lets you compare Maestro Edge 125 with other rivals in the market. So, choose BikeJunction, where you can access the most engaging, informative articles &amp; reviews.</p>"
  },
  {
    "id": 2008,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1",
    "content": "<p>The OLA S1 is a well known electric Scooter in the Electric vehicle sector of India. This S1 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 enhance the overall performance.</p><p><strong>OLA S1 Price In India</strong></p><p>OLA S1 price in India starts from 99,999. The new model of this S1 electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 on the basis of its colours &amp; variants. The OLA S1 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 Range</strong></p><p>OLA S1 is fitted with a 3 kWh and has a Lithium Ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of OLA S1 is aligned with a Automatic transmission.</p><p><strong>OLA S1 Brakes &amp; Suspension</strong></p><p>OLA S1 delivers a Range of 128 km/charge KM in single charge. The S1 comes with a Mid Drive IPM of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 Electric Scooter</strong></p><p>OLA S1 at BikeJunction is available with complete information. In addition you can easily get the OLA S1 on-road price in India. You can easily compare OLA S1 Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1858,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/xtreme-200s",
    "content": "<p>Hero Xtreme 200S Bike is one of India’s most reputed 2-wheelers. The Xtreme 200S Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Xtreme 200S Bike belongs to the Bike category. The Bike boasts high-tech specifications like 199.6 CC engine that produces 17.83 bhp @ 8500 rpm power, 40 Kmpl mileage and giving the most superior driving experience to its users. Hero Xtreme 200S Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Xtreme 200S Price In India</strong></p> <p>Hero Xtreme 200S Price in India starts from ₹ 1.35 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Hero Xtreme 200S Bike. However, it is necessary to know that the on-road price of the Xtreme 200S Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Xtreme 200S Engine</strong></p><p>Hero Xtreme 200S engine capacity is 199.6 CC and engineered with Oil cooled, 4 Stroke single cylinder OHC engine. This engine generates 17.83 bhp @ 8500 rpm and 16.45 Nm @ 6500 rpm of Torque. The engine of Xtreme 200S is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Xtreme 200S Mileage</strong></p><p>Hero Xtreme 200S mileage is 40 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12.8 L litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Xtreme 200S Brakes &amp; Suspension</strong></p><p>Hero Xtreme 200S comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Xtreme 200S Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Xtreme 200S</strong></p><p>Hero Xtreme 200S at BikeJunction is available with complete information. In addition you can easily get the Hero Xtreme 200S on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Xtreme 200S Bike with your other top choices.</p>"
  },
  {
    "id": 944,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/scram-411",
    "content": "<p>Royal Enfield Scram 411 Bike is one of India’s most reputed 2-wheelers. The Scram 411 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Scram 411 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 411 CC engine that produces 24.3BHP(17.88KW)@6500RPM power, 38.23 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Scram 411 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Royal Enfield Scram 411 Price In India</strong></p> <p>Royal Enfield Scram 411 Price in India starts from ₹ 2.45 Lakh and goes up to ₹ 2.51 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Royal Enfield Scram 411 Bike. However, it is necessary to know that the on-road price of the Scram 411 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Royal Enfield Scram 411 Engine</strong></p><p>Royal Enfield Scram 411 engine capacity is 411 CC and engineered with SINGLE CYLINDER, 4 STROKE, AIR COOLED, SOHC, FUEL INJECTION engine. This engine generates 24.3BHP(17.88KW)@6500RPM and 32NM@4250±250RPM of Torque. The engine of Scram 411 is aligned with a 5 Speed gear transmission.</p> <p><strong>Royal Enfield Scram 411 Mileage</strong></p><p>Royal Enfield Scram 411 mileage is 38.23 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p><p><strong>Royal Enfield Scram 411 Brakes &amp; Suspension</strong></p><p>Royal Enfield Scram 411 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Scram 411 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Royal Enfield Scram 411</strong></p><p>Royal Enfield Scram 411 at BikeJunction is available with complete information. In addition you can easily get the Royal Enfield Scram 411 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Royal Enfield Scram 411 Bike with your other top choices.</p>"
  },
  {
    "id": 1304,
    "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-150",
    "content": "<p>Bajaj Pulsar 150 Bike is one of India’s most reputed 2-wheelers. The Pulsar 150 Bike is manufactured by Bajaj, popularly known for their technologically advanced manufacturing value. Bajaj Pulsar 150 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 149.5 CC engine that produces 13.81 bhp @ 8500 rpm power, 48 Kmpl mileage and giving the most superior driving experience to its users. Bajaj Pulsar 150 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Bajaj Pulsar 150 Price In India</strong></p> <p>Bajaj Pulsar 150 Price in India starts from ₹ 1.04 Lakh and goes up to ₹ 1.2 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Bajaj Pulsar 150 Bike. However, it is necessary to know that the on-road price of the Pulsar 150 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Bajaj Pulsar 150 Engine</strong></p><p>Bajaj Pulsar 150 engine capacity is 149.5 CC and engineered with 4-Stroke, 2-Valve, Twin Spark BSVI Compliant DTS-i FI Engine engine. This engine generates 13.81 bhp @ 8500 rpm and 13.25 Nm @ 6500 rpm of Torque. The engine of Pulsar 150 is aligned with a 5 Speed gear transmission.</p> <p><strong>Bajaj Pulsar 150 Mileage</strong></p><p>Bajaj Pulsar 150 mileage is 48 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p><p><strong>Bajaj Pulsar 150 Brakes &amp; Suspension</strong></p><p>Bajaj Pulsar 150 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Pulsar 150 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Bajaj Pulsar 150</strong></p><p>Bajaj Pulsar 150 at BikeJunction is available with complete information. In addition you can easily get the Bajaj Pulsar 150 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Bajaj Pulsar 150 Bike with your other top choices.</p>"
  },
  {
    "id": 1265,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/xl100-heavy-duty",
    "content": "<p>TVS XL100 Heavy Duty Bike is one of India’s most reputed 2-wheelers. The XL100 Heavy Duty Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS XL100 Heavy Duty Bike belongs to the Bike category. The Bike boasts high-tech specifications like 99.7 CC engine that produces 4.34 bhp @ 6000 rpm power, 80 Kmpl mileage and giving the most superior driving experience to its users. TVS XL100 Heavy Duty Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS XL100 Heavy Duty Price In India</strong></p> <p>TVS XL100 Heavy Duty Price in India starts from ₹ 49,191 and goes up to ₹ 57,532. BikeJunction provides you a complete list of the updated and accurate price range of TVS XL100 Heavy Duty Bike. However, it is necessary to know that the on-road price of the XL100 Heavy Duty Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS XL100 Heavy Duty Engine</strong></p><p>TVS XL100 Heavy Duty engine capacity is 99.7 CC and engineered with 4 Stroke Single Cylinder engine. This engine generates 4.34 bhp @ 6000 rpm and 6.5 Nm @ 3500 rpm of Torque. The engine of XL100 Heavy Duty is aligned with a Single Speed Gear Box gear transmission.</p> <p><strong>TVS XL100 Heavy Duty Mileage</strong></p><p>TVS XL100 Heavy Duty mileage is 80 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 4 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS XL100 Heavy Duty Brakes &amp; Suspension</strong></p><p>TVS XL100 Heavy Duty comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the XL100 Heavy Duty Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS XL100 Heavy Duty</strong></p><p>TVS XL100 Heavy Duty at BikeJunction is available with complete information. In addition you can easily get the TVS XL100 Heavy Duty on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS XL100 Heavy Duty Bike with your other top choices.</p>"
  },
  {
    "id": 1203,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v",
    "content": "<p>TVS Apache RTR 200 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 200 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 200 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 197.75 CC engine that produces 20.54 bhp @ 8500 rpm power, 38.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 200 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 200 4V Price In India</strong></p> <p>TVS Apache RTR 200 4V Price in India starts from ₹ 1.4 Lakh and goes up to ₹ 1.46 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 200 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 200 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 200 4V Engine</strong></p><p>TVS Apache RTR 200 4V engine capacity is 197.75 CC and engineered with Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. This engine generates 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm of Torque. The engine of Apache RTR 200 4V is aligned with a 5 Speed gear transmission.</p> <p><strong>TVS Apache RTR 200 4V Mileage</strong></p><p>TVS Apache RTR 200 4V mileage is 38.5 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 200 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 200 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 200 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 200 4V</strong></p><p>TVS Apache RTR 200 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 200 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 200 4V Bike with your other top choices.</p>"
  },
  {
    "id": 1040,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
    "content": "<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p style='text-align:justify'>Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p><p style='text-align:justify'>The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2><p style='text-align:justify'>Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p><p style='text-align:justify'>In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Price In India</strong></h2><p style='text-align:justify'>Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350&nbsp;</td><td style='text-align:justify'>Rs 1.9 - 2.21 Lakh</td></tr></tbody></table><h2 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Mileage</strong></h2><p style='text-align:justify'>The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Model Name</strong></td><td style='text-align:justify'><strong>Mileage</strong></td></tr><tr><td style='text-align:justify'>Royal Enfield Classic 350</td><td style='text-align:justify'>41.55 Kmpl</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td colspan='1' rowspan='2'><strong>Suspension:</strong></td><td style='text-align:center'><strong>Front Suspension:</strong></td><td style='text-align:center'>Telescopic, 41mm forks, 130mm trave</td></tr><tr><td style='text-align:center'><strong>Rear Suspension:</strong></td><td style='text-align:center'>Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Brakes:</strong></strong></td><td style='text-align:center'><strong>Front Brake:</strong></td><td style='text-align:center'>300 mm disc, 2-piston calliper</td></tr><tr><td style='text-align:center'><strong>Rear Brake: </strong></td><td style='text-align:center'>270 mm disc, single-piston calliper</td></tr><tr><td style='text-align:center'><strong>ABS: </strong></td><td style='text-align:center'>Single &amp; Dual-channel ABS</td></tr><tr><td colspan='1' rowspan='3'><strong><strong>Tyres:</strong></strong></td><td style='text-align:center'><strong>Front Tyre:</strong></td><td style='text-align:center'>90/90 - 19, 52P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Rear Tyre: </strong></td><td style='text-align:center'>110/90 - 18, 61P, Tubeless</td></tr><tr><td style='text-align:center'><strong>Wheels</strong></td><td style='text-align:center'>Spoke/Alloy wheels</td></tr><tr><td colspan='1' rowspan='7'><strong><strong>Dimensions:</strong></strong></td><td style='text-align:center'><strong>Length:</strong></td><td style='text-align:center'>2,145 mm</td></tr><tr><td style='text-align:center'><strong>Width:</strong></td><td style='text-align:center'>785 mm</td></tr><tr><td style='text-align:center'><strong>Height:</strong></td><td style='text-align:center'>1,090 mm</td></tr><tr><td style='text-align:center'><strong>Wheelbase:</strong></td><td style='text-align:center'>1,390mm</td></tr><tr><td style='text-align:center'><strong>Ground Clearance:</strong></td><td style='text-align:center'>170 mm</td></tr><tr><td style='text-align:center'><strong>Seat Height:</strong></td><td style='text-align:center'>805 mm</td></tr><tr><td style='text-align:center'><strong>Kerb Weight:</strong></td><td style='text-align:center'>195kg</td></tr></tbody></table><h2 style='text-align:justify'><strong>Royal Enfield Classic 350 Additional Features</strong></h2><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Dual-channel ABS</strong>:</td><td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td></tr><tr><td><strong>LED headlamp</strong>:</td><td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td></tr><tr><td><strong>Digital instrument cluster</strong>:</td><td>Displays information such as speed, odometer, fuel gauge, and more.</td></tr><tr><td><strong>Tubeless tyres</strong>:</td><td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td></tr><tr><td><strong>Electric start</strong>:</td><td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td></tr><tr><td><strong>Disc brakes</strong>:</td><td>Provides superior stopping power &amp; better control over the bike.</td></tr><tr><td><strong>Fuel injection system</strong>:</td><td>Delivers precise fueling and improves fuel efficiency.</td></tr><tr><td><strong>Split seats</strong>:</td><td>Offers added comfort to the rider &amp; the pillion.</td></tr><tr><td><strong>Stylish design</strong>:</td><td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Royal Enfield Classic 350 Variants</strong></h3><p style='text-align:justify'>Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Variants</strong></td><td style='text-align:justify'><strong>Price in India</strong></td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon - Single Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 1.93 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td><td style='text-align:justify'>Rs 2.11 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Dark - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.18 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Classic Chrome - Dual Channel ABS</td><td style='text-align:justify'>Rs 2.21 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Reddtich - Single Channel ABS</td><td style='text-align:justify'>Rs 1.19 Lakh</td></tr><tr><td style='text-align:justify'>Classic 350 Halcyon&nbsp; - Dual Channel ABS</td><td style='text-align:justify'>Rs 1.99 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3><p style='text-align:justify'>The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td style='text-align:justify'><strong>Benelli Imperial 400</strong></td><td style='text-align:justify'>Rs 1.89 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa Perak</strong></td><td style='text-align:justify'>Rs 2.09 Lakh</td></tr><tr><td style='text-align:justify'><strong>Honda CB350RS</strong></td><td style='text-align:justify'>Rs 2.05 - 2.06 Lakh</td></tr><tr><td style='text-align:justify'><strong>Jawa 42</strong></td><td style='text-align:justify'>Rs 1.67 - 1.81 Lakh</td></tr></tbody></table><p style='text-align:justify'>&nbsp;</p><h3 style='text-align:justify'><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3><p style='text-align:justify'>Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p><table border='1' cellpadding='1' cellspacing='1'><tbody><tr><td colspan='1' rowspan='2' style='text-align:justify'><strong>Model Name&nbsp;</strong></td><td colspan='3' rowspan='1' style='text-align:center'><strong>Units Sold in March 2023</strong></td></tr><tr><td style='text-align:justify'><strong>December 2022</strong></td><td style='text-align:justify'><strong>January 2023</strong></td><td style='text-align:justify'><strong>February 2023</strong></td></tr><tr><td style='text-align:justify'><strong>Royal Enfield Classic 350&nbsp;</strong></td><td style='text-align:center'>20,682</td><td style='text-align:center'>26,134</td><td style='text-align:center'>27,461</td></tr></tbody></table><h3 style='text-align:justify'><br><strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3><p style='text-align:justify'>We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p><p style='text-align:justify'>Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p><p style='text-align:justify'>And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href='https://bikes.tractorjunction.com/en/royal-enfield-bikes/' target='_blank'><span style='color:#f39c12'>Royal Enfield Bike</span></a></strong> today with BikeJunction!</p><h3 style='text-align:justify'><strong>Key Highlights of Royal Enfield Classic 350</strong></h3><table border='2' cellpadding='1' cellspacing='1' style='width:500px'><tbody><tr><td><strong>Engine Capacity</strong></td><td>349.34 cc</td></tr><tr><td><strong>Mileage</strong></td><td>41.55 kmpl</td></tr><tr><td><strong>Kerb Weight</strong></td><td>195 kg</td></tr><tr><td><strong>Fuel Tank Capacity</strong></td><td>13L</td></tr><tr><td><strong>Max Power</strong></td><td>20.21 PS @ 6100 rpm</td></tr></tbody></table>"
  },
  {
    "id": 1560,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/tork/kratos-x",
    "content": "<p>The Tork Kratos X is a well known electric Bike in the Electric vehicle sector of India. This Kratos X Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Tork Kratos X enhance the overall performance.</p><p><strong>Tork Kratos X Price In India</strong></p><p>Tork Kratos X price in India includes all 1 variants starts from ₹1.8 Lakh and goes upto ₹1.9 Lakh. The new model of this Kratos X electric Bike is available in :colours_count colours. In addition you can avail an updated price of Tork Kratos X on the basis of its colours &amp; variants. The Tork Kratos X electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Tork Kratos X Range</strong></p><p>Tork Kratos X is fitted with a N/A and has a Li-ion type of battery. This battery pack generates 7500 W power and 28 Nm of Torque. The battery of Tork Kratos X is aligned with a Clutchless Single Speed transmission.</p><p><strong>Tork Kratos X Brakes &amp; Suspension</strong></p><p>Tork Kratos X delivers a Range of N/A KM in single charge. The Kratos X comes with a Axial Flux of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Tork Kratos X Electric Bike</strong></p><p>Tork Kratos X at BikeJunction is available with complete information. In addition you can easily get the Tork Kratos X on-road price in India. You can easily compare Tork Kratos X Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 1109,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v",
    "content": "<p>TVS Apache RTR 200 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 200 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 200 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 197.75 CC engine that produces 20.54 bhp @ 8500 rpm power, 38.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 200 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 200 4V Price In India</strong></p> <p>TVS Apache RTR 200 4V Price in India starts from ₹ 1.4 Lakh and goes up to ₹ 1.46 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 200 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 200 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 200 4V Engine</strong></p><p>TVS Apache RTR 200 4V engine capacity is 197.75 CC and engineered with Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. This engine generates 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm of Torque. The engine of Apache RTR 200 4V is aligned with a 5 Speed gear transmission.</p> <p><strong>TVS Apache RTR 200 4V Mileage</strong></p><p>TVS Apache RTR 200 4V mileage is 38.5 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 200 4V Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 200 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 200 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 200 4V</strong></p><p>TVS Apache RTR 200 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 200 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 200 4V Bike with your other top choices.</p>"
  }
]
