[
  {
    "id": 1975,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/crink-pro-standard",
    "content": "<p>The Enigma Crink Pro standard is a well known electric Scooter in the Electric vehicle sector of India. This Crink Pro standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Crink Pro standard enhance the overall performance.</p><p><strong>Enigma Crink Pro standard Price In India</strong></p><p>Enigma Crink Pro standard price in India starts from 1.15 Lakh. The new model of this Crink Pro standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma Crink Pro standard on the basis of its colours &amp; variants. The Enigma Crink Pro standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Crink Pro standard Range</strong></p><p>Enigma Crink Pro standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Crink Pro standard is aligned with a N/A transmission.</p><p><strong>Enigma Crink Pro standard Brakes &amp; Suspension</strong></p><p>Enigma Crink Pro standard delivers a Range of N/A KM in single charge. The Crink Pro standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Crink Pro standard Electric Scooter</strong></p><p>Enigma Crink Pro standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Crink Pro standard on-road price in India. You can easily compare Enigma Crink Pro standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1973,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/bmw/ce-02-standard",
    "content": "<p>The BMW CE 02 standard is a well known electric Scooter in the Electric vehicle sector of India. This CE 02 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of BMW CE 02 standard enhance the overall performance.</p><p><strong>BMW CE 02 standard Price In India</strong></p><p>BMW CE 02 standard price in India includes all 0 variants starts from ₹6.23 Lakh and goes upto ₹6.95 Lakh. The new model of this CE 02 standard electric Scooter is available in :colours_count colours. In addition you can avail an updated price of BMW CE 02 standard on the basis of its colours &amp; variants. The BMW CE 02 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>BMW CE 02 standard Range</strong></p><p>BMW CE 02 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of BMW CE 02 standard is aligned with a N/A transmission.</p><p><strong>BMW CE 02 standard Brakes &amp; Suspension</strong></p><p>BMW CE 02 standard delivers a Range of N/A KM in single charge. The CE 02 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy BMW CE 02 standard Electric Scooter</strong></p><p>BMW CE 02 standard at BikeJunction is available with complete information. In addition you can easily get the BMW CE 02 standard on-road price in India. You can easily compare BMW CE 02 standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1977,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/ambier-standard",
    "content": "<p>The Enigma Ambier standard is a well known electric Scooter in the Electric vehicle sector of India. This Ambier standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Ambier standard enhance the overall performance.</p><p><strong>Enigma Ambier standard Price In India</strong></p><p>Enigma Ambier standard price in India starts from 45,000. The new model of this Ambier standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma Ambier standard on the basis of its colours &amp; variants. The Enigma Ambier standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Ambier standard Range</strong></p><p>Enigma Ambier standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Ambier standard is aligned with a N/A transmission.</p><p><strong>Enigma Ambier standard Brakes &amp; Suspension</strong></p><p>Enigma Ambier standard delivers a Range of N/A KM in single charge. The Ambier standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Ambier standard Electric Scooter</strong></p><p>Enigma Ambier standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Ambier standard on-road price in India. You can easily compare Enigma Ambier standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1967,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/bmw/ce-04-standard",
    "content": "<p>The BMW CE 04 standard is a well known electric Scooter in the Electric vehicle sector of India. This CE 04 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of BMW CE 04 standard enhance the overall performance.</p><p><strong>BMW CE 04 standard Price In India</strong></p><p>BMW CE 04 standard price in India includes all 0 variants starts from ₹10.01 Lakh and goes upto ₹10.2 Lakh. The new model of this CE 04 standard electric Scooter is available in :colours_count colours. In addition you can avail an updated price of BMW CE 04 standard on the basis of its colours &amp; variants. The BMW CE 04 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>BMW CE 04 standard Range</strong></p><p>BMW CE 04 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of BMW CE 04 standard is aligned with a N/A transmission.</p><p><strong>BMW CE 04 standard Brakes &amp; Suspension</strong></p><p>BMW CE 04 standard delivers a Range of N/A KM in single charge. The CE 04 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy BMW CE 04 standard Electric Scooter</strong></p><p>BMW CE 04 standard at BikeJunction is available with complete information. In addition you can easily get the BMW CE 04 standard on-road price in India. You can easily compare BMW CE 04 standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1976,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/crink-v1-standard",
    "content": "<p>The Enigma Crink V1 standard is a well known electric Scooter in the Electric vehicle sector of India. This Crink V1 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Crink V1 standard enhance the overall performance.</p><p><strong>Enigma Crink V1 standard Price In India</strong></p><p>Enigma Crink V1 standard price in India starts from 94,000. The new model of this Crink V1 standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma Crink V1 standard on the basis of its colours &amp; variants. The Enigma Crink V1 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Crink V1 standard Range</strong></p><p>Enigma Crink V1 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Crink V1 standard is aligned with a N/A transmission.</p><p><strong>Enigma Crink V1 standard Brakes &amp; Suspension</strong></p><p>Enigma Crink V1 standard delivers a Range of N/A KM in single charge. The Crink V1 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Crink V1 standard Electric Scooter</strong></p><p>Enigma Crink V1 standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Crink V1 standard on-road price in India. You can easily compare Enigma Crink V1 standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1988,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/ambier-n8-standard",
    "content": "<p>The Enigma Ambier N8 standard is a well known electric Scooter in the Electric vehicle sector of India. This Ambier N8 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Ambier N8 standard enhance the overall performance.</p><p><strong>Enigma Ambier N8 standard Price In India</strong></p><p>Enigma Ambier N8 standard price in India starts from 1.05 Lakh. The new model of this Ambier N8 standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma Ambier N8 standard on the basis of its colours &amp; variants. The Enigma Ambier N8 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Ambier N8 standard Range</strong></p><p>Enigma Ambier N8 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Ambier N8 standard is aligned with a N/A transmission.</p><p><strong>Enigma Ambier N8 standard Brakes &amp; Suspension</strong></p><p>Enigma Ambier N8 standard delivers a Range of N/A KM in single charge. The Ambier N8 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Ambier N8 standard Electric Scooter</strong></p><p>Enigma Ambier N8 standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Ambier N8 standard on-road price in India. You can easily compare Enigma Ambier N8 standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1993,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/crink-standard",
    "content": "<p>The Enigma Crink standard is a well known electric Scooter in the Electric vehicle sector of India. This Crink standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Crink standard enhance the overall performance.</p><p><strong>Enigma Crink standard Price In India</strong></p><p>Enigma Crink standard price in India starts from 96,835. The new model of this Crink standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma Crink standard on the basis of its colours &amp; variants. The Enigma Crink standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Crink standard Range</strong></p><p>Enigma Crink standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Crink standard is aligned with a N/A transmission.</p><p><strong>Enigma Crink standard Brakes &amp; Suspension</strong></p><p>Enigma Crink standard delivers a Range of N/A KM in single charge. The Crink standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Crink standard Electric Scooter</strong></p><p>Enigma Crink standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Crink standard on-road price in India. You can easily compare Enigma Crink standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 2004,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/enigma/gt-450-pro-standard",
    "content": "<p>The Enigma GT 450 Pro standard is a well known electric Scooter in the Electric vehicle sector of India. This GT 450 Pro standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma GT 450 Pro standard enhance the overall performance.</p><p><strong>Enigma GT 450 Pro standard Price In India</strong></p><p>Enigma GT 450 Pro standard price in India starts from 86,909. The new model of this GT 450 Pro standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Enigma GT 450 Pro standard on the basis of its colours &amp; variants. The Enigma GT 450 Pro standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma GT 450 Pro standard Range</strong></p><p>Enigma GT 450 Pro standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma GT 450 Pro standard is aligned with a N/A transmission.</p><p><strong>Enigma GT 450 Pro standard Brakes &amp; Suspension</strong></p><p>Enigma GT 450 Pro standard delivers a Range of N/A KM in single charge. The GT 450 Pro standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma GT 450 Pro standard Electric Scooter</strong></p><p>Enigma GT 450 Pro standard at BikeJunction is available with complete information. In addition you can easily get the Enigma GT 450 Pro standard on-road price in India. You can easily compare Enigma GT 450 Pro standard Scooter with the other Scooter of this segment.</p> "
  },
  {
    "id": 1991,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/karizma-xmr-standard",
    "content": "<p>Hero Karizma XMR standard Bike is one of India’s most reputed 2-wheelers. The Karizma XMR standard Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 210 CC engine that produces N/A power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Hero Karizma XMR standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Karizma XMR standard Price In India</strong></p> <p>Hero Karizma XMR standard Price in India starts from ₹ 1.9 Lakh and goes up to ₹ 2 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Hero Karizma XMR standard Bike. However, it is necessary to know that the on-road price of the Karizma XMR standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Karizma XMR standard Engine</strong></p><p>Hero Karizma XMR standard engine capacity is 210 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of Karizma XMR standard is aligned with a N/A gear transmission.</p> <p><strong>Hero Karizma XMR standard Mileage</strong></p><p>Hero Karizma XMR standard mileage is 41.55 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Karizma XMR standard Brakes &amp; Suspension</strong></p><p>Hero Karizma XMR standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Karizma XMR standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Karizma XMR standard</strong></p><p>Hero Karizma XMR standard at BikeJunction is available with complete information. In addition you can easily get the Hero Karizma XMR standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Karizma XMR standard Bike with your other top choices.</p> "
  },
  {
    "id": 1960,
    "url": "https://bikes.tractorjunction.com/en/hero-bikes/xtreme-200s-4v-2023",
    "content": "<p>Hero Xtreme 200S 4V (2023) Bike is one of India’s most reputed 2-wheelers. The Xtreme 200S 4V (2023) Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 199.6 CC engine that produces 19.1 Ps @ 8500 rpm power, 54 Kmpl mileage and giving the most superior driving experience to its users. Hero Xtreme 200S 4V (2023) Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Xtreme 200S 4V (2023) Price In India</strong></p> <p>Hero Xtreme 200S 4V (2023) Price in India starts from ₹ 1.65 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Hero Xtreme 200S 4V (2023) Bike. However, it is necessary to know that the on-road price of the Xtreme 200S 4V (2023) Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Xtreme 200S 4V (2023) Engine</strong></p><p>Hero Xtreme 200S 4V (2023) engine capacity is 199.6 CC and engineered with Oil cooled, 4 Stroke 4 Valve single cylinder OHC engine. This engine generates 19.1 Ps @ 8500 rpm and 17.35 Nm @ 6500 rpm of Torque. The engine of Xtreme 200S 4V (2023) is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Xtreme 200S 4V (2023) Mileage</strong></p><p>Hero Xtreme 200S 4V (2023) mileage is 54 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12.8 L litres. This combination gives this Bike a good driving range.</p><p><strong>Hero Xtreme 200S 4V (2023) Brakes &amp; Suspension</strong></p><p>Hero Xtreme 200S 4V (2023) comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Xtreme 200S 4V (2023) Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Xtreme 200S 4V (2023)</strong></p><p>Hero Xtreme 200S 4V (2023) at BikeJunction is available with complete information. In addition you can easily get the Hero Xtreme 200S 4V (2023) on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Xtreme 200S 4V (2023) Bike with your other top choices.</p> "
  }
]
