{
  "id": 219,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/odysse/e2go",
  "content": "\n<p>The Odysse E2Go is a well known electric Scooter in the Electric vehicle sector of India. This E2Go Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Odysse E2Go enhance the overall performance.</p>\n<p><strong>Odysse E2Go Price In India</strong>\n</p><p>Odysse E2Go price in India includes all 2 variants starts from ₹59,663 and goes upto ₹70,900. The new model of this E2Go electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Odysse E2Go on the basis of its colours &amp; variants. The Odysse E2Go electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Odysse E2Go Range</strong>\n</p><p>Odysse E2Go is fitted with a 1.68 kWh and has a VRLA Battery (Gel Based) type of battery. This battery pack generates 250 W power and -- of Torque. The battery of Odysse E2Go is aligned with a Automatic transmission.</p>\n<p><strong>Odysse E2Go Brakes &amp; Suspension</strong>\n</p><p>Odysse E2Go delivers a Range of N/A KM in single charge. The E2Go comes with a BLDC motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Odysse E2Go Electric Scooter</strong>\n</p><p>Odysse E2Go at BikeJunction is available with complete information. In addition you can easily get the Odysse E2Go on-road price in India. You can easily compare Odysse E2Go Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 106,
  "url": "https://bikes.tractorjunction.com/en/tvs-scooters/ntorq-125",
  "content": "\n<p>TVS Ntorq 125 Scooter is one of India’s most reputed 2-wheelers. The Ntorq 125 Scooter is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Ntorq 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 124.8 CC engine that produces 10.06 bhp @ 7000 rpm power, 40.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Ntorq 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>TVS Ntorq 125 Price In India</strong></p> <p>TVS Ntorq 125 Price in India starts from ₹ 84,386 and goes up to ₹ 1.04 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Ntorq 125 Scooter. However, it is necessary to know that the on-road price of the Ntorq 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Ntorq 125 Engine</strong></p>\n<p>TVS Ntorq 125 engine capacity is 124.8 CC and engineered with Single Cylinder, 4 - Stroke, SI, Air Cooled, Fuel Injected engine. This engine generates 10.06 bhp @ 7000 rpm and 10.5 Nm @ 5500 rpm of Torque. The engine of Ntorq 125 is aligned with the Automatic Centrifugal Clutch clutch.</p><p> </p><p><strong>TVS Ntorq 125 Mileage</strong></p>\n<p>TVS Ntorq 125 mileage is 40.5 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5.8 L litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>TVS Ntorq 125 Brakes &amp; Suspension</strong></p>\n<p>TVS Ntorq 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Ntorq 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For TVS Ntorq 125</strong></p>\n<p>TVS Ntorq 125 at BikeJunction is available with complete information. In addition you can easily get the TVS Ntorq 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Ntorq 125 Scooter with your other top choices.</p>\n"
}{
  "id": 191,
  "url": "https://bikes.tractorjunction.com/en/cfmoto-bikes/650gt",
  "content": "\n<p>CFMoto 650GT Bike is one of India’s most reputed 2-wheelers. The 650GT Bike is manufactured by CFMoto, popularly known for their technologically advanced manufacturing value. CFMoto 650GT Bike belongs to the Bike category. The Bike boasts high-tech specifications like 649.3 CC engine that produces 61.68 bhp @ 9000 rpm power, 20 Kmpl mileage and giving the most superior driving experience to its users. CFMoto 650GT Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>CFMoto 650GT Price In India</strong></p> <p>CFMoto 650GT Price in India starts from ₹ 5.59 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of CFMoto 650GT Bike. However, it is necessary to know that the on-road price of the 650GT Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>CFMoto 650GT Engine</strong></p>\n<p>CFMoto 650GT engine capacity is 649.3 CC and engineered with 2-cylinder inline, 4-stroke, Liquid cooled engine. This engine generates 61.68 bhp @ 9000 rpm and 58.5 Nm @ 7000 rpm of Torque. The engine of 650GT is aligned with a 6 Speed gear transmission.</p> <p><strong>CFMoto 650GT Mileage</strong></p>\n<p>CFMoto 650GT mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 19 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>CFMoto 650GT Brakes &amp; Suspension</strong></p>\n<p>CFMoto 650GT comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 650GT Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For CFMoto 650GT</strong></p>\n<p>CFMoto 650GT at BikeJunction is available with complete information. In addition you can easily get the CFMoto 650GT on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the CFMoto 650GT Bike with your other top choices.</p>\n"
}{
  "id": 180,
  "url": "https://bikes.tractorjunction.com/en/aprilia-scooters/sr-125",
  "content": "\n<p>Aprilia SR 125 Scooter is one of India’s most reputed 2-wheelers. The SR 125 Scooter is manufactured by Aprilia, popularly known for their technologically advanced manufacturing value. Aprilia SR 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 124.45 CC engine that produces 9.78 bhp @ 7700 rpm power, 40 Kmpl mileage and giving the most superior driving experience to its users. Aprilia SR 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Aprilia SR 125 Price In India</strong></p> <p>Aprilia SR 125 Price in India starts from ₹ 1.21 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Aprilia SR 125 Scooter. However, it is necessary to know that the on-road price of the SR 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Aprilia SR 125 Engine</strong></p>\n<p>Aprilia SR 125 engine capacity is 124.45 CC and engineered with Single Cylinder, 4 stroke,Air cooled, SOHC, 3 valves engine. This engine generates 9.78 bhp @ 7700 rpm and 9.7 Nm @ 6000 rpm of Torque. The engine of SR 125 is aligned with the Self Ventilating Dry - Centrifugal Clutch clutch.</p><p> </p><p><strong>Aprilia SR 125 Mileage</strong></p>\n<p>Aprilia SR 125 mileage is 40 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 6 L litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>Aprilia SR 125 Brakes &amp; Suspension</strong></p>\n<p>Aprilia SR 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the SR 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Aprilia SR 125</strong></p>\n<p>Aprilia SR 125 at BikeJunction is available with complete information. In addition you can easily get the Aprilia SR 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Aprilia SR 125 Scooter with your other top choices.</p>\n"
}{
  "id": 735,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/okaya/faast-f3",
  "content": "\n<p>The Okaya Faast F3 is a well known electric Scooter in the Electric vehicle sector of India. This Faast F3 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Okaya Faast F3 enhance the overall performance.</p>\n<p><strong>Okaya Faast F3 Price In India</strong>\n</p><p>Okaya Faast F3 price in India starts from 99,999. The new model of this Faast F3 electric Scooter is available in 1 colours. In addition you can avail an updated price of Okaya Faast F3 on the basis of its colours &amp; variants. The Okaya Faast F3 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Okaya Faast F3 Range</strong>\n</p><p>Okaya Faast F3 is fitted with a 72 V/48 Ah and has a LFP type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Okaya Faast F3 is aligned with a N/A transmission.</p>\n<p><strong>Okaya Faast F3 Brakes &amp; Suspension</strong>\n</p><p>Okaya Faast F3 delivers a Range of 120-130 KM in single charge. The Faast F3 comes with a BLDC Hub Moter Waterproof of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Okaya Faast F3 Electric Scooter</strong>\n</p><p>Okaya Faast F3 at BikeJunction is available with complete information. In addition you can easily get the Okaya Faast F3 on-road price in India. You can easily compare Okaya Faast F3 Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 217,
  "url": "https://bikes.tractorjunction.com/en/bmw-scooters/c-400-gt",
  "content": "\n<p>BMW C 400 GT Scooter is one of India’s most reputed 2-wheelers. The C 400 GT Scooter is manufactured by BMW, popularly known for their technologically advanced manufacturing value. BMW C 400 GT Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 350 CC engine that produces 33.53 bhp @ 7500 rpm power, 28.6 Kmpl mileage and giving the most superior driving experience to its users. BMW C 400 GT Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>BMW C 400 GT Price In India</strong></p> <p>BMW C 400 GT Price in India starts from ₹ 10.75 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of BMW C 400 GT Scooter. However, it is necessary to know that the on-road price of the C 400 GT Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>BMW C 400 GT Engine</strong></p>\n<p>BMW C 400 GT engine capacity is 350 CC and engineered with Water-cooled, single-cylinder, four-stroke engine featuring four valves per cylinder, overhead camshaft with rocker and wet-sump lubrication engine. This engine generates 33.53 bhp @ 7500 rpm and 35 Nm @ 5750 rpm of Torque. The engine of C 400 GT is aligned with the Centrifugal dry clutch clutch.</p><p> </p><p><strong>BMW C 400 GT Mileage</strong></p>\n<p>BMW C 400 GT mileage is 28.6 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 12.8 l litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>BMW C 400 GT Brakes &amp; Suspension</strong></p>\n<p>BMW C 400 GT comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the C 400 GT Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For BMW C 400 GT</strong></p>\n<p>BMW C 400 GT at BikeJunction is available with complete information. In addition you can easily get the BMW C 400 GT on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the BMW C 400 GT Scooter with your other top choices.</p>\n"
}{
  "id": 226,
  "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/road-king",
  "content": "\n<p>Harley Davidson Road King Bike is one of India’s most reputed 2-wheelers. The Road King Bike is manufactured by Harley Davidson, popularly known for their technologically advanced manufacturing value. Harley Davidson Road King Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1745 CC engine that produces N/A power, 18 Kmpl mileage and giving the most superior driving experience to its users. Harley Davidson Road King Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Harley Davidson Road King Price In India</strong></p> <p>Harley Davidson Road King Price in India starts from ₹ 28.49 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Harley Davidson Road King Bike. However, it is necessary to know that the on-road price of the Road King Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Harley Davidson Road King Engine</strong></p>\n<p>Harley Davidson Road King engine capacity is 1745 CC and engineered with Milwaukee-Eight 107 engine. This engine generates N/A and 150 Nm @ 3250 rpm of Torque. The engine of Road King is aligned with a 6 Speed gear transmission.</p> <p><strong>Harley Davidson Road King Mileage</strong></p>\n<p>Harley Davidson Road King mileage is 18 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 22.7 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Harley Davidson Road King Brakes &amp; Suspension</strong></p>\n<p>Harley Davidson Road King comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Road King Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Harley Davidson Road King</strong></p>\n<p>Harley Davidson Road King at BikeJunction is available with complete information. In addition you can easily get the Harley Davidson Road King on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Harley Davidson Road King Bike with your other top choices.</p>\n"
}{
  "id": 288,
  "url": "https://bikes.tractorjunction.com/en/honda-bikes/cb1000r",
  "content": "\n<p>Honda CB1000R Bike is one of India’s most reputed 2-wheelers. The CB1000R Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda CB1000R Bike belongs to the Bike category. The Bike boasts high-tech specifications like 998 CC engine that produces 141.4 bhp power, 18 Kmpl mileage and giving the most superior driving experience to its users. Honda CB1000R Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Honda CB1000R Price In India</strong></p> <p>Honda CB1000R Price in India starts from ₹ 15 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Honda CB1000R Bike. However, it is necessary to know that the on-road price of the CB1000R Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda CB1000R Engine</strong></p>\n<p>Honda CB1000R engine capacity is 998 CC and engineered with Not Available engine. This engine generates 141.4 bhp and 104 Nm of Torque. The engine of CB1000R is aligned with a -- gear transmission.</p> <p><strong>Honda CB1000R Mileage</strong></p>\n<p>Honda CB1000R mileage is 18 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of -- litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Honda CB1000R Brakes &amp; Suspension</strong></p>\n<p>Honda CB1000R comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the CB1000R Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Honda CB1000R</strong></p>\n<p>Honda CB1000R at BikeJunction is available with complete information. In addition you can easily get the Honda CB1000R on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda CB1000R Bike with your other top choices.</p>\n"
}{
  "id": 279,
  "url": "https://bikes.tractorjunction.com/en/bajaj-bikes/pulsar-125",
  "content": "\n<p></p><p>&nbsp;</p>\n<quillbot-extension-portal></quillbot-extension-portal><p></p>\n<p style=\"text-align:justify\"><strong><a href=\"https://bikes.tractorjunction.com/en/bajaj-bikes\" target=\"_blank\"><span style=\"color:#e67e22\">Bajaj</span></a></strong> Pulsar 125 is a popular entry-level bike available for a price ranging between <strong>Rs 81,389 - 89,254</strong>. It is fitted with a <strong>124.4cc, air-cooled, single-cylinder engine</strong>, delivering a maximum power output of <strong>11.64 bhp </strong>and a peak torque of <strong>11 Nm</strong>. This bike can easily reach a top speed of<strong> 110 kmph</strong> &amp;<strong> 50 Kmpl </strong>mileage, making it a good option for city &amp; highway riding. The bike further comes with a total fuel tank capacity of<strong> 11.5 litres</strong>.</p>\n<p style=\"text-align:justify\">The engine is tuned to an efficient <strong>5-speed gearbox</strong> &amp; features<strong> Bajaj's DTS-i technology</strong>, enhancing the combustion process and improving power delivery and fuel efficiency. The motorcycle also has an <strong>LED tail lamp, a clip-on handlebar, a maintenance-free battery, and a nitrox mono-shock absorber</strong>. It also features a<strong> CBS (Combined Braking System)</strong>, which ensures better braking stability and control.</p>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Engine Specifications</strong></h2>\n<p style=\"text-align:justify\">The Bajaj Pulsar 125 is built to have a <strong>124.4cc, air-cooled, single-cylinder engine</strong>. This BS6 delivers a maximum power output of <strong>11.64 bhp @ 8500 rpm &amp; a peak torque of 10.8 Nm @ 6500 rpm</strong>. The engine is tuned to a powerful <strong>5-speed gearbox </strong>and features <strong>Bajaj's DTS-i </strong>(Digital Twin Spark Ignition) technology. This enhances the combustion process and improves fuel efficiency. The engine also features a <strong>counter-balancer,</strong> which reduces vibrations and ensures a smoother ride.</p>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Price In India</strong></h2>\n<p style=\"text-align:justify\">Bajaj Pulsar 125 ex-showroom price in India ranges between Rs 81,389 - 89,254, depending on the various variants available.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Bajaj Pulsar 125</td>\n<td style=\"text-align:justify\">Rs 81,389 - 89,254</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Mileage</strong></h2>\n<p style=\"text-align:justify\">Bajaj Pulsar 125 mileage is one of the most attractive aspects of the bike. Check the table below to know the average mileage of the bike-&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Bajaj Pulsar 125</td>\n<td style=\"text-align:justify\">50 Kmpl</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Technical Specifications</strong></h2>\n<p style=\"text-align:justify\">Here are all the technical specifications of Bajaj Pulsar 125 that make it such a popular choice in the Indian market -</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Technical Specifications</strong></td>\n<td style=\"text-align:justify\"><strong>Measurements</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Frame</td>\n<td style=\"text-align:justify\">Single down tube chassis frame</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Suspension</td>\n<td style=\"text-align:justify\"><strong>Front:</strong> Telescopic<br>\n<strong>Rear:</strong> Swing Arm</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Brake&nbsp;</td>\n<td style=\"text-align:justify\"><strong>Front: </strong>240 mm Disc Brakes<br>\n<strong>Rear: </strong>130 mm Drum Brakes<br>\n<strong>Brake System:</strong> CBS (Combi Brake System)&nbsp;&nbsp;</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Wheels&nbsp;</td>\n<td style=\"text-align:justify\"><strong>Type: </strong>Alloy<br>\n<strong>Front: </strong>431.8 mm<br>\n<strong>Rear:</strong>&nbsp;431.8 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Tyres</td>\n<td style=\"text-align:justify\"><strong>Type:</strong> Tubeless<br>\n<strong>Front: </strong>80/100-17&nbsp;<br>\n<strong>Rear: </strong>100/90-17</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Dimensions</td>\n<td style=\"text-align:justify\"><strong>Overall Length: </strong>2,042 mm<br>\n<strong>Overall Width: </strong>765 mm<br>\n<strong>Overall Height: </strong>1,060 mm<br>\n<strong>Ground Clearance: </strong>165 mm<br>\n<strong>Seat Height: </strong>790 mm&nbsp;&nbsp;</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Kerb Weight</td>\n<td style=\"text-align:justify\">142 Kg</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Additional Features</strong></h2>\n<p style=\"text-align:justify\">The additional features that make the Bajaj Pulsar 125 a well-rounded motorcycle offering excellent performance, comfort &amp; safety at an affordable price point are-</p>\n<ul>\n<li style=\"text-align:justify\"><strong>Semi-Digital Instrument Cluster</strong>: Displays all the important info such as speed, fuel level, odometer, and trip meter. The digital screen is easy to read and provides all the necessary information that a rider needs while riding.</li>\n</ul>\n<ul>\n<li style=\"text-align:justify\"><strong>LED Tail Lamp</strong>: Enhances its overall looks and provides better visibility &amp; safety while riding.</li>\n</ul>\n<ul>\n<li style=\"text-align:justify\"><strong>Clip-On Handlebar</strong>: Provides a sporty riding position &amp; better control over the motorcycle. The handlebar also gives the motorcycle a more aggressive look.</li>\n</ul>\n<ul>\n<li style=\"text-align:justify\"><strong>Nitrox Mono-Shock Absorber</strong>: Provides excellent ride comfort and handling. This suspension system is designed to absorb shocks &amp; vibrations, which results in a smoother &amp; more comfortable ride.</li>\n</ul>\n<ul>\n<li style=\"text-align:justify\"><strong>Tubeless Tyres</strong>: Offer better grip and handling on the road. The tubeless tires also reduce the chances of sudden deflation, improving the motorcycle's overall safety.</li>\n</ul>\n<ul>\n<li style=\"text-align:justify\"><strong>Maintenance-Free Battery</strong>: The motorcycle comes equipped with a maintenance-free battery, which requires no regular maintenance and provides long-lasting performance.</li>\n</ul>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Variants</strong></h2>\n<p style=\"text-align:justify\">Bajaj Auto offers Pulsar 125 in 4 variants, which are as follows -</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Pulsar 125 Drum - Split Seat</td>\n<td style=\"text-align:justify\">Rs 84,000</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Pulsar 125 Disc - Split Seat</td>\n<td style=\"text-align:justify\">Rs 89,254</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Pulsar 125 Drum - BS VI</td>\n<td style=\"text-align:justify\">Rs 81,389</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Pulsar 125 Disc - BS VI</td>\n<td style=\"text-align:justify\">Rs 89,254</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Bajaj Pulsar 125 Competitors in the Market</strong></h2>\n<p style=\"text-align:justify\">Bajaj Pulsar 125 directly competes with the following cruiser bike models in the Indian 2-wheeler market -</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Bajaj&nbsp; Pulsar 125 Rivals</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong><a href=\"https://bikes.tractorjunction.com/en/honda-bikes/shine\" target=\"_blank\"><span style=\"color:#e67e22\">Honda Shine</span></a></strong></td>\n<td style=\"text-align:justify\">Rs 78,687 - 84,187</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong><a href=\"https://bikes.tractorjunction.com/en/hero-bikes/splendor-plus\" target=\"_blank\"><span style=\"color:#e67e22\">Hero Splendor Plus</span></a></strong></td>\n<td style=\"text-align:justify\">Rs 72,076 - 74,396</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Hero Livo</td>\n<td style=\"text-align:justify\">Rs 75,820 - 79,820</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong><a href=\"https://bikes.tractorjunction.com/en/hero-bikes/passion-xtec\" target=\"_blank\"><span style=\"color:#e67e22\">Hero Passion Xtec</span></a></strong></td>\n<td style=\"text-align:justify\">Rs 77,358 - 81,758</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Why BikeJunction for Bajaj Pulsar 125?</strong></h2>\n<p style=\"text-align:justify\">Looking for the latest news &amp; updates on Bajaj Pulsar 125 mileage and more? Look no further than BikeJunction, an ideal platform for riders who want to stay informed. We offer a wealth of information about this popular scooter, including everything from technical specifications and pricing details to expert reviews and user ratings. Whether you're a seasoned rider or simply a beginner, we can provide you with all the information you may need to make an informed decision about purchasing a Bajaj Pulsar 125.</p>\n<p style=\"text-align:justify\">With a team of experienced writers and researchers, we are constantly scouring the internet and industry sources for the latest news &amp; developments related to this scooter. In addition, we offer an intelligent comparison tool that lets you compare Bajaj Pulsar 125 with other rivals in the market. So, choose BikeJunction, where you get access to the most engaging, informative articles &amp; reviews.&nbsp;</p>\n<quillbot-extension-portal></quillbot-extension-portal>\n"
}{
  "id": 315,
  "url": "https://bikes.tractorjunction.com/en/vespa-scooters/elegante-150",
  "content": "\n<p>Vespa Elegante 150 Scooter is one of India’s most reputed 2-wheelers. The Elegante 150 Scooter is manufactured by Vespa, popularly known for their technologically advanced manufacturing value. Vespa Elegante 150 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 149.5 CC engine that produces 10.33 bhp @ 7600 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. Vespa Elegante 150 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Vespa Elegante 150 Price In India</strong></p> <p>Vespa Elegante 150 Price in India starts from ₹ 1.55 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Vespa Elegante 150 Scooter. However, it is necessary to know that the on-road price of the Elegante 150 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Vespa Elegante 150 Engine</strong></p>\n<p>Vespa Elegante 150 engine capacity is 149.5 CC and engineered with Single Cylinder 4 stroke, Air cooled, SOHC, 3 valves FI engine. This engine generates 10.33 bhp @ 7600 rpm and 10.6 Nm @ 5500 rpm of Torque. The engine of Elegante 150 is aligned with the Automatic clutch.</p><p> </p><p><strong>Vespa Elegante 150 Mileage</strong></p>\n<p>Vespa Elegante 150 mileage is 45 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 7.4 L litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>Vespa Elegante 150 Brakes &amp; Suspension</strong></p>\n<p>Vespa Elegante 150 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Elegante 150 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Vespa Elegante 150</strong></p>\n<p>Vespa Elegante 150 at BikeJunction is available with complete information. In addition you can easily get the Vespa Elegante 150 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Vespa Elegante 150 Scooter with your other top choices.</p>\n"
}{
  "id": 76,
  "url": "https://bikes.tractorjunction.com/en/keeway-bikes/v302c",
  "content": "\n<p>Keeway V302C Bike is one of India’s most reputed 2-wheelers. The V302C Bike is manufactured by Keeway, popularly known for their technologically advanced manufacturing value. Keeway V302C Bike belongs to the Bike category. The Bike boasts high-tech specifications like 298 CC engine that produces 29.49 hp @ 8500 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. Keeway V302C Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Keeway V302C Price In India</strong></p> <p>Keeway V302C Price in India starts from ₹ 4.2 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Keeway V302C Bike. However, it is necessary to know that the on-road price of the V302C Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Keeway V302C Engine</strong></p>\n<p>Keeway V302C engine capacity is 298 CC and engineered with Twin cylinder liquid cooled engine, 4 stroke 8 valves, SOHC engine. This engine generates 29.49 hp @ 8500 rpm and 26.5 Nm @ 6500 rpm of Torque. The engine of V302C is aligned with a 6 Speed gear transmission.</p> <p><strong>Keeway V302C Mileage</strong></p>\n<p>Keeway V302C mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Keeway V302C Brakes &amp; Suspension</strong></p>\n<p>Keeway V302C comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the V302C Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Keeway V302C</strong></p>\n<p>Keeway V302C at BikeJunction is available with complete information. In addition you can easily get the Keeway V302C on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Keeway V302C Bike with your other top choices.</p>\n"
}{
  "id": 150,
  "url": "https://bikes.tractorjunction.com/en/ducati-bikes/streetfighter-v4",
  "content": "\n<p>Ducati Streetfighter V4 Bike is one of India’s most reputed 2-wheelers. The Streetfighter V4 Bike is manufactured by Ducati, popularly known for their technologically advanced manufacturing value. Ducati Streetfighter V4 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1103 CC engine that produces 205.15 bhp @ 13000 rpm power, 13.15 Kmpl mileage and giving the most superior driving experience to its users. Ducati Streetfighter V4 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Ducati Streetfighter V4 Price In India</strong></p> <p>Ducati Streetfighter V4 Price in India starts from ₹ 22.15 Lakh and goes up to ₹ 72 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Ducati Streetfighter V4 Bike. However, it is necessary to know that the on-road price of the Streetfighter V4 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Ducati Streetfighter V4 Engine</strong></p>\n<p>Ducati Streetfighter V4 engine capacity is 1103 CC and engineered with Desmosedici Stradale 90° V4, rearward-rotating crankshaft 4 Desmodromically actuated valves per cylinders, liquid cooled. engine. This engine generates 205.15 bhp @ 13000 rpm and 123 Nm @ 11500 rpm of Torque. The engine of Streetfighter V4 is aligned with a 6 Speed gear transmission.</p> <p><strong>Ducati Streetfighter V4 Mileage</strong></p>\n<p>Ducati Streetfighter V4 mileage is 13.15 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 16 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Ducati Streetfighter V4 Brakes &amp; Suspension</strong></p>\n<p>Ducati Streetfighter V4 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Streetfighter V4 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Ducati Streetfighter V4</strong></p>\n<p>Ducati Streetfighter V4 at BikeJunction is available with complete information. In addition you can easily get the Ducati Streetfighter V4 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Ducati Streetfighter V4 Bike with your other top choices.</p>\n"
}{
  "id": 265,
  "url": "https://bikes.tractorjunction.com/en/bmw-bikes/r-ninet-racer",
  "content": "\n<p>BMW R nineT Racer Bike is one of India’s most reputed 2-wheelers. The R nineT Racer Bike is manufactured by BMW, popularly known for their technologically advanced manufacturing value. BMW R nineT Racer Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1170 CC engine that produces 107.28 bhp @ 7,250 rpm power, 19.6 Kmpl mileage and giving the most superior driving experience to its users. BMW R nineT Racer Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>BMW R nineT Racer Price In India</strong></p> <p>BMW R nineT Racer Price in India starts from ₹ 18.66 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of BMW R nineT Racer Bike. However, it is necessary to know that the on-road price of the R nineT Racer Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>BMW R nineT Racer Engine</strong></p>\n<p>BMW R nineT Racer engine capacity is 1170 CC and engineered with Air/Oil Cooled , 2 Cylinder, 4 Valve engine. This engine generates 107.28 bhp @ 7,250 rpm and 116 Nm @ 6,000 rpm of Torque. The engine of R nineT Racer is aligned with a 1 Down 5 Up gear transmission.</p> <p><strong>BMW R nineT Racer Mileage</strong></p>\n<p>BMW R nineT Racer mileage is 19.6 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 18 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>BMW R nineT Racer Brakes &amp; Suspension</strong></p>\n<p>BMW R nineT Racer comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the R nineT Racer Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For BMW R nineT Racer</strong></p>\n<p>BMW R nineT Racer at BikeJunction is available with complete information. In addition you can easily get the BMW R nineT Racer on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the BMW R nineT Racer Bike with your other top choices.</p>\n"
}{
  "id": 86,
  "url": "https://bikes.tractorjunction.com/en/bmw-bikes/r-1250-rt",
  "content": "\n<p>BMW R 1250 RT Bike is one of India’s most reputed 2-wheelers. The R 1250 RT Bike is manufactured by BMW, popularly known for their technologically advanced manufacturing value. BMW R 1250 RT Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1254 CC engine that produces 134.04 bhp @ 7750 rpm power, 21 Kmpl mileage and giving the most superior driving experience to its users. BMW R 1250 RT Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>BMW R 1250 RT Price In India</strong></p> <p>BMW R 1250 RT Price in India starts from ₹ 23.95 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of BMW R 1250 RT Bike. However, it is necessary to know that the on-road price of the R 1250 RT Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>BMW R 1250 RT Engine</strong></p>\n<p>BMW R 1250 RT engine capacity is 1254 CC and engineered with 2-Cylinder-boxer–engine, Air-/coolant Cooled engine. This engine generates 134.04 bhp @ 7750 rpm and 143 Nm @ 6250 rpm of Torque. The engine of R 1250 RT is aligned with a 6 Speed gear transmission.</p> <p><strong>BMW R 1250 RT Mileage</strong></p>\n<p>BMW R 1250 RT mileage is 21 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 25 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>BMW R 1250 RT Brakes &amp; Suspension</strong></p>\n<p>BMW R 1250 RT comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the R 1250 RT Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For BMW R 1250 RT</strong></p>\n<p>BMW R 1250 RT at BikeJunction is available with complete information. In addition you can easily get the BMW R 1250 RT on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the BMW R 1250 RT Bike with your other top choices.</p>\n"
}{
  "id": 157,
  "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
  "content": "\n<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p style=\"text-align:justify\">Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p>\n<p style=\"text-align:justify\">The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2>\n<p style=\"text-align:justify\">Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p>\n<p style=\"text-align:justify\">In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Price In India</strong></h2>\n<p style=\"text-align:justify\">Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Royal Enfield Classic 350&nbsp;</td>\n<td style=\"text-align:justify\">Rs 1.9 - 2.21 Lakh</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><br>\n<strong>Royal Enfield Classic 350 Mileage</strong></h2>\n<p style=\"text-align:justify\">The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Royal Enfield Classic 350</td>\n<td style=\"text-align:justify\">41.55 Kmpl</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\"><strong>Suspension:</strong></td>\n<td style=\"text-align:center\"><strong>Front Suspension:</strong></td>\n<td style=\"text-align:center\">Telescopic, 41mm forks, 130mm trave</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Suspension:</strong></td>\n<td style=\"text-align:center\">Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"3\"><strong><strong>Brakes:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Front Brake:</strong></td>\n<td style=\"text-align:center\">300 mm disc, 2-piston calliper</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Brake: </strong></td>\n<td style=\"text-align:center\">270 mm disc, single-piston calliper</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>ABS: </strong></td>\n<td style=\"text-align:center\">Single &amp; Dual-channel ABS</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"3\"><strong><strong>Tyres:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Front Tyre:</strong></td>\n<td style=\"text-align:center\">90/90 - 19, 52P, Tubeless</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Tyre: </strong></td>\n<td style=\"text-align:center\">110/90 - 18, 61P, Tubeless</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Wheels</strong></td>\n<td style=\"text-align:center\">Spoke/Alloy wheels</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"7\"><strong><strong>Dimensions:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Length:</strong></td>\n<td style=\"text-align:center\">2,145 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Width:</strong></td>\n<td style=\"text-align:center\">785 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Height:</strong></td>\n<td style=\"text-align:center\">1,090 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Wheelbase:</strong></td>\n<td style=\"text-align:center\">1,390mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Ground Clearance:</strong></td>\n<td style=\"text-align:center\">170 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Seat Height:</strong></td>\n<td style=\"text-align:center\">805 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Kerb Weight:</strong></td>\n<td style=\"text-align:center\">195kg</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Additional Features</strong></h2>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td><strong>Dual-channel ABS</strong>:</td>\n<td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td>\n</tr>\n<tr>\n<td><strong>LED headlamp</strong>:</td>\n<td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td>\n</tr>\n<tr>\n<td><strong>Digital instrument cluster</strong>:</td>\n<td>Displays information such as speed, odometer, fuel gauge, and more.</td>\n</tr>\n<tr>\n<td><strong>Tubeless tyres</strong>:</td>\n<td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td>\n</tr>\n<tr>\n<td><strong>Electric start</strong>:</td>\n<td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td>\n</tr>\n<tr>\n<td><strong>Disc brakes</strong>:</td>\n<td>Provides superior stopping power &amp; better control over the bike.</td>\n</tr>\n<tr>\n<td><strong>Fuel injection system</strong>:</td>\n<td>Delivers precise fueling and improves fuel efficiency.</td>\n</tr>\n<tr>\n<td><strong>Split seats</strong>:</td>\n<td>Offers added comfort to the rider &amp; the pillion.</td>\n</tr>\n<tr>\n<td><strong>Stylish design</strong>:</td>\n<td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td>\n</tr>\n</tbody>\n</table>\n<h3 style=\"text-align:justify\"><br>\n<strong>Royal Enfield Classic 350 Variants</strong></h3>\n<p style=\"text-align:justify\">Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Halcyon - Single Channel ABS&nbsp;</td>\n<td style=\"text-align:justify\">Rs 1.93 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td>\n<td style=\"text-align:justify\">Rs 2.11 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Dark - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 2.18 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Chrome - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 2.21 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Reddtich - Single Channel ABS</td>\n<td style=\"text-align:justify\">Rs 1.19 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Halcyon&nbsp; - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 1.99 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3>\n<p style=\"text-align:justify\">The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Benelli Imperial 400</strong></td>\n<td style=\"text-align:justify\">Rs 1.89 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Jawa Perak</strong></td>\n<td style=\"text-align:justify\">Rs 2.09 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Honda CB350RS</strong></td>\n<td style=\"text-align:justify\">Rs 2.05 - 2.06 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Jawa 42</strong></td>\n<td style=\"text-align:justify\">Rs 1.67 - 1.81 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3>\n<p style=\"text-align:justify\">Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\" style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td colspan=\"3\" rowspan=\"1\" style=\"text-align:center\"><strong>Units Sold in March 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>December 2022</strong></td>\n<td style=\"text-align:justify\"><strong>January 2023</strong></td>\n<td style=\"text-align:justify\"><strong>February 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Royal Enfield Classic 350&nbsp;</strong></td>\n<td style=\"text-align:center\">20,682</td>\n<td style=\"text-align:center\">26,134</td>\n<td style=\"text-align:center\">27,461</td>\n</tr>\n</tbody>\n</table>\n<h3 style=\"text-align:justify\"><br>\n<strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3>\n<p style=\"text-align:justify\">We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p>\n<p style=\"text-align:justify\">Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p>\n<p style=\"text-align:justify\">And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href=\"https://bikes.tractorjunction.com/en/royal-enfield-bikes/\" target=\"_blank\"><span style=\"color:#f39c12\">Royal Enfield Bike</span></a></strong> today with BikeJunction!</p>\n<h3 style=\"text-align:justify\"><strong>Key Highlights of Royal Enfield Classic 350</strong></h3>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td><strong>Engine Capacity</strong></td>\n<td>349.34 cc</td>\n</tr>\n<tr>\n<td><strong>Mileage</strong></td>\n<td>41.55 kmpl</td>\n</tr>\n<tr>\n<td><strong>Kerb Weight</strong></td>\n<td>195 kg</td>\n</tr>\n<tr>\n<td><strong>Fuel Tank Capacity</strong></td>\n<td>13L</td>\n</tr>\n<tr>\n<td><strong>Max Power</strong></td>\n<td>20.21 PS @ 6100 rpm</td>\n</tr>\n</tbody>\n</table>\n"
}{
  "id": 336,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/bajaj/chetak",
  "content": "\n<p>The Bajaj Chetak is a well known electric Scooter in the Electric vehicle sector of India. This Chetak Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Bajaj Chetak enhance the overall performance.</p>\n<p><strong>Bajaj Chetak Price In India</strong>\n</p><p>Bajaj Chetak price in India starts from 1.54 Lakh. The new model of this Chetak electric Scooter is available in 1 colours. In addition you can avail an updated price of Bajaj Chetak on the basis of its colours &amp; variants. The Bajaj Chetak electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Bajaj Chetak Range</strong>\n</p><p>Bajaj Chetak is fitted with a 50.4 V/60.4 Ah and has a Lithium Ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Bajaj Chetak is aligned with a Automatic transmission.</p>\n<p><strong>Bajaj Chetak Brakes &amp; Suspension</strong>\n</p><p>Bajaj Chetak delivers a Range of 95 km/charge KM in single charge. The Chetak comes with a BLDC of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Bajaj Chetak Electric Scooter</strong>\n</p><p>Bajaj Chetak at BikeJunction is available with complete information. In addition you can easily get the Bajaj Chetak on-road price in India. You can easily compare Bajaj Chetak Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 322,
  "url": "https://bikes.tractorjunction.com/en/honda-bikes/livo",
  "content": "\n<p>Honda Livo Bike is one of India’s most reputed 2-wheelers. The Livo Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda Livo Bike belongs to the Bike category. The Bike boasts high-tech specifications like 109.51 CC engine that produces 8.67 bhp @ 7500 rpm power, 74 Kmpl mileage and giving the most superior driving experience to its users. Honda Livo Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Honda Livo Price In India</strong></p> <p>Honda Livo Price in India starts from ₹ 75,820 and goes up to ₹ 79,820. BikeJunction provides you a complete list of the updated and accurate price range of Honda Livo Bike. However, it is necessary to know that the on-road price of the Livo Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Livo Engine</strong></p>\n<p>Honda Livo engine capacity is 109.51 CC and engineered with Air Cooled, 4 Stroke, SI, BS-VI Engine engine. This engine generates 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm of Torque. The engine of Livo is aligned with a 4 Speed gear transmission.</p> <p><strong>Honda Livo Mileage</strong></p>\n<p>Honda Livo mileage is 74 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 9 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Honda Livo Brakes &amp; Suspension</strong></p>\n<p>Honda Livo comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Livo Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Honda Livo</strong></p>\n<p>Honda Livo at BikeJunction is available with complete information. In addition you can easily get the Honda Livo on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Livo Bike with your other top choices.</p>\n"
}{
  "id": 220,
  "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/kx250",
  "content": "\n<p>Kawasaki KX250 Bike is one of India’s most reputed 2-wheelers. The KX250 Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. Kawasaki KX250 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 249 CC engine that produces N/A power, 20 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki KX250 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Kawasaki KX250 Price In India</strong></p> <p>Kawasaki KX250 Price in India starts from ₹ 7.99 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki KX250 Bike. However, it is necessary to know that the on-road price of the KX250 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki KX250 Engine</strong></p>\n<p>Kawasaki KX250 engine capacity is 249 CC and engineered with Liquid-cooled, 4-stroke Single engine. This engine generates N/A and N/A of Torque. The engine of KX250 is aligned with a 5-Speed gear transmission.</p> <p><strong>Kawasaki KX250 Mileage</strong></p>\n<p>Kawasaki KX250 mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 6.2 l litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Kawasaki KX250 Brakes &amp; Suspension</strong></p>\n<p>Kawasaki KX250 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the KX250 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Kawasaki KX250</strong></p>\n<p>Kawasaki KX250 at BikeJunction is available with complete information. In addition you can easily get the Kawasaki KX250 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki KX250 Bike with your other top choices.</p>\n"
}{
  "id": 83,
  "url": "https://bikes.tractorjunction.com/en/hero-bikes/splendor-plus-xtec",
  "content": "\n<p>Hero Splendor Plus Xtec Bike is one of India’s most reputed 2-wheelers. The Splendor Plus Xtec Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Splendor Plus Xtec Bike belongs to the Bike category. The Bike boasts high-tech specifications like 97.2 CC engine that produces 5.9 kW @ 8000 rpm power, 81 Kmpl mileage and giving the most superior driving experience to its users. Hero Splendor Plus Xtec Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Hero Splendor Plus Xtec Price In India</strong></p> <p>Hero Splendor Plus Xtec Price in India starts from ₹ 76,346. BikeJunction provides you a complete list of the updated and accurate price range of Hero Splendor Plus Xtec Bike. However, it is necessary to know that the on-road price of the Splendor Plus Xtec Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Splendor Plus Xtec Engine</strong></p>\n<p>Hero Splendor Plus Xtec engine capacity is 97.2 CC and engineered with Air cooled, 4-stroke, Single cylinder, OHC engine. This engine generates 5.9 kW @ 8000 rpm and 8.05 Nm @ 6,000 rpm of Torque. The engine of Splendor Plus Xtec is aligned with a 4 Speed gear transmission.</p> <p><strong>Hero Splendor Plus Xtec Mileage</strong></p>\n<p>Hero Splendor Plus Xtec mileage is 81 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 9.8 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Hero Splendor Plus Xtec Brakes &amp; Suspension</strong></p>\n<p>Hero Splendor Plus Xtec comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Splendor Plus Xtec Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Hero Splendor Plus Xtec</strong></p>\n<p>Hero Splendor Plus Xtec at BikeJunction is available with complete information. In addition you can easily get the Hero Splendor Plus Xtec on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Splendor Plus Xtec Bike with your other top choices.</p>\n"
}{
  "id": 683,
  "url": "https://bikes.tractorjunction.com/en/ktm-bikes/1290-gs",
  "content": "\n<p>KTM 1290 GS Bike is one of India’s most reputed 2-wheelers. The 1290 GS Bike is manufactured by KTM, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 1301 CC engine that produces 158 HP power, 14 Kmpl mileage and giving the most superior driving experience to its users. KTM 1290 GS Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>KTM 1290 GS Price In India</strong></p> <p>KTM 1290 GS Price in India starts from ₹ 12.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of KTM 1290 GS Bike. However, it is necessary to know that the on-road price of the 1290 GS Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>KTM 1290 GS Engine</strong></p>\n<p>KTM 1290 GS engine capacity is 1301 CC and engineered with N/A engine. This engine generates 158 HP and 140 Nm of Torque. The engine of 1290 GS is aligned with a 6 Speed gear transmission.</p> <p><strong>KTM 1290 GS Mileage</strong></p>\n<p>KTM 1290 GS mileage is 14 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 23 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>KTM 1290 GS Brakes &amp; Suspension</strong></p>\n<p>KTM 1290 GS comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 1290 GS Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For KTM 1290 GS</strong></p>\n<p>KTM 1290 GS at BikeJunction is available with complete information. In addition you can easily get the KTM 1290 GS on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the KTM 1290 GS Bike with your other top choices.</p>\n"
}{
  "id": 326,
  "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/fat-boy",
  "content": "\n<p>Harley Davidson Fat Boy Bike is one of India’s most reputed 2-wheelers. The Fat Boy Bike is manufactured by Harley Davidson, popularly known for their technologically advanced manufacturing value. Harley Davidson Fat Boy Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1868 CC engine that produces 93.8 bhp @ 5,020 rpm power, 20 Kmpl mileage and giving the most superior driving experience to its users. Harley Davidson Fat Boy Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Harley Davidson Fat Boy Price In India</strong></p> <p>Harley Davidson Fat Boy Price in India starts from ₹ 21.99 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Harley Davidson Fat Boy Bike. However, it is necessary to know that the on-road price of the Fat Boy Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Harley Davidson Fat Boy Engine</strong></p>\n<p>Harley Davidson Fat Boy engine capacity is 1868 CC and engineered with Liquid Cooled , 2 Cylinder, 4 Valve engine. This engine generates 93.8 bhp @ 5,020 rpm and 155 Nm @ 3,250 rpm of Torque. The engine of Fat Boy is aligned with a 1 Down 5 Up gear transmission.</p> <p><strong>Harley Davidson Fat Boy Mileage</strong></p>\n<p>Harley Davidson Fat Boy mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 18.9 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Harley Davidson Fat Boy Brakes &amp; Suspension</strong></p>\n<p>Harley Davidson Fat Boy comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Fat Boy Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Harley Davidson Fat Boy</strong></p>\n<p>Harley Davidson Fat Boy at BikeJunction is available with complete information. In addition you can easily get the Harley Davidson Fat Boy on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Harley Davidson Fat Boy Bike with your other top choices.</p>\n"
}{
  "id": 256,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/joy-e-bike/wolf",
  "content": "\n<p>The Joy e-bike Wolf is a well known electric Scooter in the Electric vehicle sector of India. This Wolf Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Joy e-bike Wolf enhance the overall performance.</p>\n<p><strong>Joy e-bike Wolf Price In India</strong>\n</p><p>Joy e-bike Wolf price in India starts from 79,900. The new model of this Wolf electric Scooter is available in 1 colours. In addition you can avail an updated price of Joy e-bike Wolf on the basis of its colours &amp; variants. The Joy e-bike Wolf electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Joy e-bike Wolf Range</strong>\n</p><p>Joy e-bike Wolf is fitted with a 60 V / 23 Ah and has a Lithium-Ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Joy e-bike Wolf is aligned with a Automatic transmission.</p>\n<p><strong>Joy e-bike Wolf Brakes &amp; Suspension</strong>\n</p><p>Joy e-bike Wolf delivers a Range of 60 km/charge KM in single charge. The Wolf comes with a BLDC of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Joy e-bike Wolf Electric Scooter</strong>\n</p><p>Joy e-bike Wolf at BikeJunction is available with complete information. In addition you can easily get the Joy e-bike Wolf on-road price in India. You can easily compare Joy e-bike Wolf Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 100,
  "url": "https://bikes.tractorjunction.com/en/hero-bikes/glamour",
  "content": "\n<p>Hero Glamour Bike is one of India’s most reputed 2-wheelers. The Glamour Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Glamour Bike belongs to the Bike category. The Bike boasts high-tech specifications like 124.7 CC engine that produces 10.69 bhp @ 7500 rpm power, 70 Kmpl mileage and giving the most superior driving experience to its users. Hero Glamour Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Hero Glamour Price In India</strong></p> <p>Hero Glamour Price in India starts from ₹ 78,768 and goes up to ₹ 82,768. BikeJunction provides you a complete list of the updated and accurate price range of Hero Glamour Bike. However, it is necessary to know that the on-road price of the Glamour Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Glamour Engine</strong></p>\n<p>Hero Glamour engine capacity is 124.7 CC and engineered with Air cooled 4 stroke engine. This engine generates 10.69 bhp @ 7500 rpm and 10.6 Nm @ 6000 rpm of Torque. The engine of Glamour is aligned with a 5 Speed Constant Mesh gear transmission.</p> <p><strong>Hero Glamour Mileage</strong></p>\n<p>Hero Glamour mileage is 70 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 10 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Hero Glamour Brakes &amp; Suspension</strong></p>\n<p>Hero Glamour comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Glamour Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Hero Glamour</strong></p>\n<p>Hero Glamour at BikeJunction is available with complete information. In addition you can easily get the Hero Glamour on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Glamour Bike with your other top choices.</p>\n"
}{
  "id": 274,
  "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/z-h2",
  "content": "\n<p>Kawasaki Z H2 Bike is one of India’s most reputed 2-wheelers. The Z H2 Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. Kawasaki Z H2 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 998 CC engine that produces 197.26 bhp @ 1100 rpm power, 15 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki Z H2 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Kawasaki Z H2 Price In India</strong></p> <p>Kawasaki Z H2 Price in India starts from ₹ 23.02 Lakh and goes up to ₹ 26.95 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki Z H2 Bike. However, it is necessary to know that the on-road price of the Z H2 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki Z H2 Engine</strong></p>\n<p>Kawasaki Z H2 engine capacity is 998 CC and engineered with Liquid-cooled, 4-stroke In-Line Four with Supercharger engine. This engine generates 197.26 bhp @ 1100 rpm and 137 Nm @ 8500 rpm of Torque. The engine of Z H2 is aligned with a 6 Speed gear transmission.</p> <p><strong>Kawasaki Z H2 Mileage</strong></p>\n<p>Kawasaki Z H2 mileage is 15 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 19 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Kawasaki Z H2 Brakes &amp; Suspension</strong></p>\n<p>Kawasaki Z H2 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Z H2 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Kawasaki Z H2</strong></p>\n<p>Kawasaki Z H2 at BikeJunction is available with complete information. In addition you can easily get the Kawasaki Z H2 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki Z H2 Bike with your other top choices.</p>\n"
}{
  "id": 411,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/fujiyama/vespar",
  "content": "\n<p>The Fujiyama Vespar is a well known electric Scooter in the Electric vehicle sector of India. This Vespar Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Fujiyama Vespar enhance the overall performance.</p>\n<p><strong>Fujiyama Vespar Price In India</strong>\n</p><p>Fujiyama Vespar price in India includes all 1 variants starts from ₹55,000 and goes upto ₹60,000. The new model of this Vespar electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Fujiyama Vespar on the basis of its colours &amp; variants. The Fujiyama Vespar electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Fujiyama Vespar Range</strong>\n</p><p>Fujiyama Vespar is fitted with a 48V/60V and has a Lead &amp; Lithium Compatible type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Fujiyama Vespar is aligned with a N/A transmission.</p>\n<p><strong>Fujiyama Vespar Brakes &amp; Suspension</strong>\n</p><p>Fujiyama Vespar delivers a Range of 90 KM in single charge. The Vespar comes with a JM Hub Motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Fujiyama Vespar Electric Scooter</strong>\n</p><p>Fujiyama Vespar at BikeJunction is available with complete information. In addition you can easily get the Fujiyama Vespar on-road price in India. You can easily compare Fujiyama Vespar Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 271,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/joy-e-bike/monster",
  "content": "\n<p>The Joy e-bike Monster is a well known electric Bike in the Electric vehicle sector of India. This Monster Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Joy e-bike Monster enhance the overall performance.</p>\n<p><strong>Joy e-bike Monster Price In India</strong>\n</p><p>Joy e-bike Monster price in India starts from 1.1 Lakh. The new model of this Monster electric Bike is available in 1 colours. In addition you can avail an updated price of Joy e-bike Monster on the basis of its colours &amp; variants. The Joy e-bike Monster electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Joy e-bike Monster Range</strong>\n</p><p>Joy e-bike Monster is fitted with a 72 V / 23 Ah and has a Lithium-Ion (Fixed Type) type of battery. This battery pack generates N/A power and 30 Nm of Torque. The battery of Joy e-bike Monster is aligned with a Automatic transmission.</p>\n<p><strong>Joy e-bike Monster Brakes &amp; Suspension</strong>\n</p><p>Joy e-bike Monster delivers a Range of 75 km/charge KM in single charge. The Monster comes with a DC Brushless of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Joy e-bike Monster Electric Bike</strong>\n</p><p>Joy e-bike Monster at BikeJunction is available with complete information. In addition you can easily get the Joy e-bike Monster on-road price in India. You can easily compare Joy e-bike Monster Bike with the other Bike of this segment.</p>\n"
}{
  "id": 391,
  "url": "https://bikes.tractorjunction.com/en/benelli-bikes/302s",
  "content": "\n<p>Benelli 302S Bike is one of India’s most reputed 2-wheelers. The 302S Bike is manufactured by Benelli, popularly known for their technologically advanced manufacturing value. Benelli 302S Bike belongs to the Bike category. The Bike boasts high-tech specifications like 300 CC engine that produces 26.5 bhp power, 23.2 Kmpl mileage and giving the most superior driving experience to its users. Benelli 302S Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Benelli 302S Price In India</strong></p> <p>Benelli 302S Price in India starts from ₹ 3.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Benelli 302S Bike. However, it is necessary to know that the on-road price of the 302S Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Benelli 302S Engine</strong></p>\n<p>Benelli 302S engine capacity is 300 CC and engineered with Not Available engine. This engine generates 26.5 bhp and 37.7 Nm of Torque. The engine of 302S is aligned with a -- gear transmission.</p> <p><strong>Benelli 302S Mileage</strong></p>\n<p>Benelli 302S mileage is 23.2 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of -- litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Benelli 302S Brakes &amp; Suspension</strong></p>\n<p>Benelli 302S comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 302S Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Benelli 302S</strong></p>\n<p>Benelli 302S at BikeJunction is available with complete information. In addition you can easily get the Benelli 302S on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Benelli 302S Bike with your other top choices.</p>\n"
}{
  "id": 517,
  "url": "https://bikes.tractorjunction.com/en/zontes-scooters/350e",
  "content": "\n<p>Zontes 350E Scooter is one of India’s most reputed 2-wheelers. The 350E Scooter is manufactured by Zontes, popularly known for their technologically advanced manufacturing value. The Scooter boasts high-tech specifications like 350 CC engine that produces 36 Bhp @ 7500rpm power, 28 Kmpl mileage and giving the most superior driving experience to its users. Zontes 350E Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Zontes 350E Price In India</strong></p> <p>Zontes 350E Price in India starts from ₹ 5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Zontes 350E Scooter. However, it is necessary to know that the on-road price of the 350E Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Zontes 350E Engine</strong></p>\n<p>Zontes 350E engine capacity is 350 CC and engineered with Single Cylinder,Liquid Cooled engine. This engine generates 36 Bhp @ 7500rpm and 38 Nm @ 6000rpm of Torque. The engine of 350E is aligned with the N/A clutch.</p><p> </p><p><strong>Zontes 350E Mileage</strong></p>\n<p>Zontes 350E mileage is 28 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 16 litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>Zontes 350E Brakes &amp; Suspension</strong></p>\n<p>Zontes 350E comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 350E Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Zontes 350E</strong></p>\n<p>Zontes 350E at BikeJunction is available with complete information. In addition you can easily get the Zontes 350E on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Zontes 350E Scooter with your other top choices.</p>\n"
}{
  "id": 148,
  "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/z650rs",
  "content": "\n<p>Kawasaki Z650RS Bike is one of India’s most reputed 2-wheelers. The Z650RS Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. Kawasaki Z650RS Bike belongs to the Bike category. The Bike boasts high-tech specifications like 649 CC engine that produces 67.07 bhp @ 8000 rpm power, 23.2 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki Z650RS Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Kawasaki Z650RS Price In India</strong></p> <p>Kawasaki Z650RS Price in India starts from ₹ 6.92 Lakh and goes up to ₹ 6.99 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki Z650RS Bike. However, it is necessary to know that the on-road price of the Z650RS Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki Z650RS Engine</strong></p>\n<p>Kawasaki Z650RS engine capacity is 649 CC and engineered with Liquid-cooled, 4-stroke Parallel Twin engine. This engine generates 67.07 bhp @ 8000 rpm and 64 Nm @ 6700 rpm of Torque. The engine of Z650RS is aligned with a 6 speed gear transmission.</p> <p><strong>Kawasaki Z650RS Mileage</strong></p>\n<p>Kawasaki Z650RS mileage is 23.2 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Kawasaki Z650RS Brakes &amp; Suspension</strong></p>\n<p>Kawasaki Z650RS comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Z650RS Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Kawasaki Z650RS</strong></p>\n<p>Kawasaki Z650RS at BikeJunction is available with complete information. In addition you can easily get the Kawasaki Z650RS on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki Z650RS Bike with your other top choices.</p>\n"
}{
  "id": 436,
  "url": "https://bikes.tractorjunction.com/en/qj-motor-bikes/srk-400",
  "content": "\n<p>QJ Motor SRK 400 Bike is one of India’s most reputed 2-wheelers. The SRK 400 Bike is manufactured by QJ Motor, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 400 CC engine that produces 40.9 Bhp @ 9000rpm power, 20 Kmpl mileage and giving the most superior driving experience to its users. QJ Motor SRK 400 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>QJ Motor SRK 400 Price In India</strong></p> <p>QJ Motor SRK 400 Price in India starts from ₹ 3.59 Lakh and goes up to ₹ 3.69 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of QJ Motor SRK 400 Bike. However, it is necessary to know that the on-road price of the SRK 400 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>QJ Motor SRK 400 Engine</strong></p>\n<p>QJ Motor SRK 400 engine capacity is 400 CC and engineered with Inline Twin Cylinder, Inline Twin Cylinder, Liquid Cooled/4stroke/8valves, DOHC/4stroke/8valves, DOHC engine. This engine generates 40.9 Bhp @ 9000rpm and 37 Nm @ 7500rpm of Torque. The engine of SRK 400 is aligned with a 6 Speed gear transmission.</p> <p><strong>QJ Motor SRK 400 Mileage</strong></p>\n<p>QJ Motor SRK 400 mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 13.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>QJ Motor SRK 400 Brakes &amp; Suspension</strong></p>\n<p>QJ Motor SRK 400 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the SRK 400 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For QJ Motor SRK 400</strong></p>\n<p>QJ Motor SRK 400 at BikeJunction is available with complete information. In addition you can easily get the QJ Motor SRK 400 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the QJ Motor SRK 400 Bike with your other top choices.</p>\n"
}{
  "id": 341,
  "url": "https://bikes.tractorjunction.com/en/benelli-bikes/302r",
  "content": "\n<p>Benelli 302R Bike is one of India’s most reputed 2-wheelers. The 302R Bike is manufactured by Benelli, popularly known for their technologically advanced manufacturing value. Benelli 302R Bike belongs to the Bike category. The Bike boasts high-tech specifications like 300 CC engine that produces 38.26 bhp @ 11500 rpm power, 25 Kmpl mileage and giving the most superior driving experience to its users. Benelli 302R Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Benelli 302R Price In India</strong></p> <p>Benelli 302R Price in India starts from ₹ 3.6 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Benelli 302R Bike. However, it is necessary to know that the on-road price of the 302R Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Benelli 302R Engine</strong></p>\n<p>Benelli 302R engine capacity is 300 CC and engineered with In-line 2 Cylinder, 4-stroke, 8-Valve, DOHC engine. This engine generates 38.26 bhp @ 11500 rpm and 26.5 Nm @10000 rpm of Torque. The engine of 302R is aligned with a 6 Speed gear transmission.</p> <p><strong>Benelli 302R Mileage</strong></p>\n<p>Benelli 302R mileage is 25 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 14 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Benelli 302R Brakes &amp; Suspension</strong></p>\n<p>Benelli 302R comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 302R Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Benelli 302R</strong></p>\n<p>Benelli 302R at BikeJunction is available with complete information. In addition you can easily get the Benelli 302R on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Benelli 302R Bike with your other top choices.</p>\n"
}{
  "id": 435,
  "url": "https://bikes.tractorjunction.com/en/qj-motor-bikes/src-500",
  "content": "\n<p>QJ Motor SRC 500 Bike is one of India’s most reputed 2-wheelers. The SRC 500 Bike is manufactured by QJ Motor, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 480 CC engine that produces 25.5 Bhp @ 5750rpm power, 20 Kmpl mileage and giving the most superior driving experience to its users. QJ Motor SRC 500 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>QJ Motor SRC 500 Price In India</strong></p> <p>QJ Motor SRC 500 Price in India starts from ₹ 2.69 Lakh and goes up to ₹ 2.79 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of QJ Motor SRC 500 Bike. However, it is necessary to know that the on-road price of the SRC 500 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>QJ Motor SRC 500 Engine</strong></p>\n<p>QJ Motor SRC 500 engine capacity is 480 CC and engineered with Single Cylinder, Air cooled, 2valves, SOHC engine. This engine generates 25.5 Bhp @ 5750rpm and 36 Nm @ 4250rpm of Torque. The engine of SRC 500 is aligned with a 5 Speed gear transmission.</p> <p><strong>QJ Motor SRC 500 Mileage</strong></p>\n<p>QJ Motor SRC 500 mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>QJ Motor SRC 500 Brakes &amp; Suspension</strong></p>\n<p>QJ Motor SRC 500 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the SRC 500 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For QJ Motor SRC 500</strong></p>\n<p>QJ Motor SRC 500 at BikeJunction is available with complete information. In addition you can easily get the QJ Motor SRC 500 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the QJ Motor SRC 500 Bike with your other top choices.</p>\n"
}{
  "id": 118,
  "url": "https://bikes.tractorjunction.com/en/hero-bikes/passion-pro",
  "content": "\n<p>Hero Passion Pro Bike is one of India’s most reputed 2-wheelers. The Passion Pro Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Passion Pro Bike belongs to the Bike category. The Bike boasts high-tech specifications like 110 CC engine that produces 6.73 KW @ 7,500 rpm power, 60 Kmpl mileage and giving the most superior driving experience to its users. Hero Passion Pro Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p style=\"text-align:justify\">Hero Passion Pro is a popular <strong>commuter bike</strong> manufactured by Hero MotoCorp, a leading 2-wheeler brand in India. The bike embodies a unique good design, low fuel consumption and a reasonable price. It comes in <strong>3 variants</strong>, <strong>5 colours</strong>, with a price ranging between <strong>Rs 74,408 - 77,408.&nbsp;</strong></p>\n<p style=\"text-align:justify\">The passion pro comes with a <strong>Single-Cylinder, 4 Stroke, 2 valves, and Air Cooled Engine</strong> that can easily churn out<strong> 9.02 bhp &amp; 9.89 Nm torque</strong>. The bike further features <strong>drum brakes </strong>on either side of the wheels. Additionally, it features cool techs like <strong>digital-analogue metre</strong>, <strong>auto sail technology, i3S system</strong> &amp; an<strong> engine cut-off </strong>in case of any malfunction.</p>\n<p style=\"text-align:justify\"><strong>Hero Passion Pro Engine Specifications</strong></p>\n<p style=\"text-align:justify\">The Hero Passion Pro is fitted with a<strong> 113.2 cc air-cooled, 4-stroke single-cylinder</strong> engine. This BS6-compliant engine churns out a maximum power of <strong>9.15 bhp at 7500 rpm</strong> &amp; a peak torque of <strong>9.79 Nm at 5000 rpm</strong>.&nbsp;</p>\n<p style=\"text-align:justify\">In addition, the engine is equipped with Hero's innovative <strong>i3S technology</strong>, which automatically turns off the engine when idle and restarts it when needed, thereby saving fuel and reducing emissions. Furthermore, the Hero Passion Pro has a <strong>constant mesh 4-speed gearbox</strong> that delivers smooth and precise shifts.&nbsp;&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Hero Passion Pro Price In India</strong></p>\n<p style=\"text-align:justify\">Hero Passion Pro price is among the most affordable commuter bikes in India that range between <strong>Rs 74,408 - 77,408.</strong></p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Hero Passion Pro</td>\n<td style=\"text-align:justify\">Rs 74,408 - 77,408</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Hero Passion Pro Mileage</strong></p>\n<p style=\"text-align:justify\">Hero Passion Pro delivers good mileage and has some attractive features. This Hero bike has a 110 cc engine and i3S system that helps conserve fuel by turning off the engine when not in use. The Hero passion pro mileage is around <strong>60 Kmpl</strong>, which makes it one of the most economical bikes in its segment.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Hero Passion Pro&nbsp;</td>\n<td style=\"text-align:justify\">60 Kmpl</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>&nbsp;</strong><strong>Hero Passion Pro Technical Specifications</strong></p>\n<p style=\"text-align:justify\">The Hero Passion Pro is a standard commuter motorcycle that offers a blend of style, performance &amp; efficiency with advanced technological specifications, including -</p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Frame</strong>: Diamond</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Suspension</strong>:&nbsp;\n<ul>\n<li>Front - Telescopic</li>\n<li>Rear - Hydraulic Type</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Brakes</strong>:\n<ul>\n<li>Front - Disc, 130 mm</li>\n<li>Rear - Drum, 130 mm</li>\n<li>Type - Combi Brake System</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Wheels:&nbsp;</strong>\n<ul>\n<li>Front - 457.2 mm</li>\n<li>Rear - 457.2 mm</li>\n<li>Type - Alloy</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Tyres</strong>:&nbsp;\n<ul>\n<li>Front - 80/100-18</li>\n<li>Rear - 80/100-18</li>\n<li>Type - Tubeless</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Dimensions</strong>:&nbsp;\n<ul>\n<li>Overall Length: 2,046 mm</li>\n<li>Overall Width:&nbsp; 737 mm</li>\n<li>Overall Height:&nbsp; 1,116 mm</li>\n<li>Ground Clearance:&nbsp; 162 mm</li>\n<li>Seat Height:&nbsp; 791 mm</li>\n<li>Fuel Tank Capacity: 10 Litres</li>\n</ul>\n</li>\n</ul>\n<p style=\"text-align:justify\">&nbsp;<strong>Hero Passion Pro Additional Features</strong></p>\n<p style=\"text-align:justify\">The Hero Passion Pro is a stylish and efficient bike with many additional features to enhance its performance and comfort. The bike has a <strong>combined braking system (CBS)</strong> that ensures better control and safety on the road. The <strong>BS6 version</strong> of the bike has a <strong>higher ground clearance of 162 mm</strong> and a raised <strong>front telescopic suspension</strong>, making it suitable for different terrains.&nbsp;</p>\n<p style=\"text-align:justify\">The bike also has a <strong>brighter headlamp</strong> that <strong>improves visibility at night</strong> and <strong>triple-tone graphics on the fuel tank</strong> that add to its <strong>aesthetic appeal</strong>. The bike has a <strong>digital analogue console</strong> that displays information such as <strong>speed, fuel level, odometer, etc.</strong> This bike comes with <strong>tubeless tyres and alloy wheels</strong> that give better traction &amp; stability.</p>\n<p style=\"text-align:justify\">Some additional features Hero Passion Pro comes with are -&nbsp;</p>\n<ul>\n<li style=\"text-align: justify;\"><strong>i3S Technology</strong> - An Idle Start-Stop System that automatically switches off the engine when idling in neutral &amp; restarts when the clutch is pressed, helping to save fuel and reduce emissions.</li>\n<li style=\"text-align: justify;\"><strong>iSmart Technology</strong> - An advanced fuel-injection system that optimizes the engine's performance and fuel efficiency while also reducing emissions.</li>\n<li style=\"text-align: justify;\"><strong>Digital-Analogue Instrument Cluster</strong> - The bike comes with a modern and stylish digital-analogue instrument cluster, displaying important information such as speed, fuel level, and trip meter.</li>\n</ul>\n<p style=\"text-align:justify\"><strong>Hero Passion Pro Variants</strong></p>\n<p style=\"text-align:justify\"><strong>&nbsp;</strong>Hero Passion Pro comes in 3 different variants, which are-</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Passion Pro Disc - BS VI</td>\n<td style=\"text-align:justify\">Rs 77,408</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Passion Pro Drum - BS VI</td>\n<td style=\"text-align:justify\">Rs 74,408</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Passion Pro (2023)</td>\n<td style=\"text-align:justify\">Rs 90,056</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Hero Passion Pro Competitors in the Market</strong></p>\n<p style=\"text-align:justify\">Hero Passion Pro has multiple competitors in the market. They differ slightly in prices and specifications. Some of these competitors are-&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Hero Passion Pro Rivals</strong></td>\n<td style=\"text-align:justify\"><strong>Price Range</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Bajaj Pulsar 125</td>\n<td style=\"text-align:justify\">Rs 81,389 - 89,254</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Hero Splendor plus</td>\n<td style=\"text-align:justify\">Rs 72,076 - 74,396</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Honda SP 125</td>\n<td style=\"text-align:justify\">Rs 85,131 - 89,131</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Honda Shine</td>\n<td style=\"text-align:justify\">Rs 78,687 - 84,187</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\">&nbsp;<strong>Why BikeJunction for Hero Passion Pro?</strong></p>\n<p style=\"text-align:justify\">Bike Junction provides you with all the information about the stylish and powerful bike from Hero. Our website has all the details you need to know about the Hero passion pro and its variants. You can find the Hero passion pro mileage, engine capacity, fuel tank size and more on our site.&nbsp;</p>\n<p style=\"text-align:justify\">You can also compare different models of Passion Pro with our handy tool. Select the features and prices to compare and see the results in seconds. So don't wait any longer; pick, compare and buy your Passion Pro with BikeJunction!</p>\n"
}{
  "id": 122,
  "url": "https://bikes.tractorjunction.com/en/ktm-bikes/390-adventure",
  "content": "\n<p>KTM 390 Adventure Bike is one of India’s most reputed 2-wheelers. The 390 Adventure Bike is manufactured by KTM, popularly known for their technologically advanced manufacturing value. KTM 390 Adventure Bike belongs to the Bike category. The Bike boasts high-tech specifications like 373.27 CC engine that produces 32 kW @ 9000 rpm power, 28 Kmpl mileage and giving the most superior driving experience to its users. KTM 390 Adventure Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>KTM 390 Adventure Price In India</strong></p> <p>KTM 390 Adventure Price in India starts from ₹ 3.37 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of KTM 390 Adventure Bike. However, it is necessary to know that the on-road price of the 390 Adventure Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>KTM 390 Adventure Engine</strong></p>\n<p>KTM 390 Adventure engine capacity is 373.27 CC and engineered with Single Cylinder, Liquid Cooled, DOHC, FI Engine engine. This engine generates 32 kW @ 9000 rpm and 37 Nm @ 7500 rpm of Torque. The engine of 390 Adventure is aligned with a 6 Speed gear transmission.</p> <p><strong>KTM 390 Adventure Mileage</strong></p>\n<p>KTM 390 Adventure mileage is 28 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 14.5 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>KTM 390 Adventure Brakes &amp; Suspension</strong></p>\n<p>KTM 390 Adventure comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 390 Adventure Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For KTM 390 Adventure</strong></p>\n<p>KTM 390 Adventure at BikeJunction is available with complete information. In addition you can easily get the KTM 390 Adventure on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the KTM 390 Adventure Bike with your other top choices.</p>\n"
}{
  "id": 461,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/zero/sr",
  "content": "\n<p>The zero SR is a well known electric Bike in the Electric vehicle sector of India. This SR Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of zero SR enhance the overall performance.</p>\n<p><strong>zero SR Price In India</strong>\n</p><p>zero SR price in India includes all 1 variants starts from ₹1.47 Lakh and goes upto ₹1.53 Lakh. The new model of this SR electric Bike is available in :colours_count colours. In addition you can avail an updated price of zero SR on the basis of its colours &amp; variants. The zero SR electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>zero SR Range</strong>\n</p><p>zero SR is fitted with a 15.6 kwh and has a N/A type of battery. This battery pack generates N/A power and 166 of Torque. The battery of zero SR is aligned with a Clutchless direct drive transmission.</p>\n<p><strong>zero SR Brakes &amp; Suspension</strong>\n</p><p>zero SR delivers a Range of N/A KM in single charge. The SR comes with a Interior Permanent Magnet AC of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy zero SR Electric Bike</strong>\n</p><p>zero SR at BikeJunction is available with complete information. In addition you can easily get the zero SR on-road price in India. You can easily compare zero SR Bike with the other Bike of this segment.</p>\n"
}{
  "id": 119,
  "url": "https://bikes.tractorjunction.com/en/triumph-bikes/speed-twin",
  "content": "\n<p>Triumph Speed Twin Bike is one of India’s most reputed 2-wheelers. The Speed Twin Bike is manufactured by Triumph, popularly known for their technologically advanced manufacturing value. Triumph Speed Twin Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1200 CC engine that produces 98.63 bhp @ 7250rpm power, 19.6 Kmpl mileage and giving the most superior driving experience to its users. Triumph Speed Twin Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Triumph Speed Twin Price In India</strong></p> <p>Triumph Speed Twin Price in India starts from ₹ 11.09 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Triumph Speed Twin Bike. However, it is necessary to know that the on-road price of the Speed Twin Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Triumph Speed Twin Engine</strong></p>\n<p>Triumph Speed Twin engine capacity is 1200 CC and engineered with Liquid cooled, 8 valve, SOHC, 270° crank angle parallel twin engine. This engine generates 98.63 bhp @ 7250rpm and 112 Nm @ 4250rpm of Torque. The engine of Speed Twin is aligned with a 6 Speed gear transmission.</p> <p><strong>Triumph Speed Twin Mileage</strong></p>\n<p>Triumph Speed Twin mileage is 19.6 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 14.5 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Triumph Speed Twin Brakes &amp; Suspension</strong></p>\n<p>Triumph Speed Twin comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Speed Twin Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Triumph Speed Twin</strong></p>\n<p>Triumph Speed Twin at BikeJunction is available with complete information. In addition you can easily get the Triumph Speed Twin on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Triumph Speed Twin Bike with your other top choices.</p>\n"
}{
  "id": 346,
  "url": "https://bikes.tractorjunction.com/en/triumph-bikes/tiger-900",
  "content": "\n<p>Triumph Tiger 900 Bike is one of India’s most reputed 2-wheelers. The Tiger 900 Bike is manufactured by Triumph, popularly known for their technologically advanced manufacturing value. Triumph Tiger 900 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 888 CC engine that produces 93.9 bhp @ 8750 rpm power, 19.2 Kmpl mileage and giving the most superior driving experience to its users. Triumph Tiger 900 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Triumph Tiger 900 Price In India</strong></p> <p>Triumph Tiger 900 Price in India starts from ₹ 13.7 Lakh and goes up to ₹ 15.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Triumph Tiger 900 Bike. However, it is necessary to know that the on-road price of the Tiger 900 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Triumph Tiger 900 Engine</strong></p>\n<p>Triumph Tiger 900 engine capacity is 888 CC and engineered with Liquid-cooled, 12 valve, DOHC, in-line 3-cylinder engine. This engine generates 93.9 bhp @ 8750 rpm and 87 Nm @ 7250 rpm of Torque. The engine of Tiger 900 is aligned with a 6 speed gear transmission.</p> <p><strong>Triumph Tiger 900 Mileage</strong></p>\n<p>Triumph Tiger 900 mileage is 19.2 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 20 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Triumph Tiger 900 Brakes &amp; Suspension</strong></p>\n<p>Triumph Tiger 900 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Tiger 900 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Triumph Tiger 900</strong></p>\n<p>Triumph Tiger 900 at BikeJunction is available with complete information. In addition you can easily get the Triumph Tiger 900 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Triumph Tiger 900 Bike with your other top choices.</p>\n"
}{
  "id": 653,
  "url": "https://bikes.tractorjunction.com/en/bsa-bikes/gold-star",
  "content": "\n<p>BSA Gold Star Bike is one of India’s most reputed 2-wheelers. The Gold Star Bike is manufactured by BSA, popularly known for their technologically advanced manufacturing value. BSA Gold Star Bike belongs to the Bike category. The Bike boasts high-tech specifications like 652 CC engine that produces 45.6 PS @ 6000 rpm power, 25-30 Kmpl mileage and giving the most superior driving experience to its users. BSA Gold Star Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>BSA Gold Star Price In India</strong></p> <p>BSA Gold Star Price in India starts from ₹ 3.3 Lakh and goes up to ₹ 3.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of BSA Gold Star Bike. However, it is necessary to know that the on-road price of the Gold Star Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>BSA Gold Star Engine</strong></p>\n<p>BSA Gold Star engine capacity is 652 CC and engineered with Liquid-cooled, single cylinder, DOHC, 4 valves per cylinder, twin spark plugs engine. This engine generates 45.6 PS @ 6000 rpm and 55 Nm @ 4000 rpm of Torque. The engine of Gold Star is aligned with a 5 Speed gear transmission.</p> <p><strong>BSA Gold Star Mileage</strong></p>\n<p>BSA Gold Star mileage is 25-30 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>BSA Gold Star Brakes &amp; Suspension</strong></p>\n<p>BSA Gold Star comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Gold Star Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For BSA Gold Star</strong></p>\n<p>BSA Gold Star at BikeJunction is available with complete information. In addition you can easily get the BSA Gold Star on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the BSA Gold Star Bike with your other top choices.</p>\n"
}{
  "id": 423,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/matter/exe",
  "content": "\n<p>The Matter EXE is a well known electric Bike in the Electric vehicle sector of India. This EXE Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Matter EXE enhance the overall performance.</p>\n<p><strong>Matter EXE Price In India</strong>\n</p><p>Matter EXE price in India starts from 1.75 Lakh. The new model of this EXE electric Bike is available in 1 colours. In addition you can avail an updated price of Matter EXE on the basis of its colours &amp; variants. The Matter EXE electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Matter EXE Range</strong>\n</p><p>Matter EXE is fitted with a 5 kwh and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Matter EXE is aligned with a Manual transmission.</p>\n<p><strong>Matter EXE Brakes &amp; Suspension</strong>\n</p><p>Matter EXE delivers a Range of N/A KM in single charge. The EXE comes with a N/A of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Matter EXE Electric Bike</strong>\n</p><p>Matter EXE at BikeJunction is available with complete information. In addition you can easily get the Matter EXE on-road price in India. You can easily compare Matter EXE Bike with the other Bike of this segment.</p>\n"
}{
  "id": 450,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/dynam/gaze",
  "content": "\n<p>The dynam Gaze is a well known electric Scooter in the Electric vehicle sector of India. This Gaze Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of dynam Gaze enhance the overall performance.</p>\n<p><strong>dynam Gaze Price In India</strong>\n</p><p>dynam Gaze price in India includes all 1 variants starts from ₹1 Lakh and goes upto ₹1.5 Lakh. The new model of this Gaze electric Scooter is available in :colours_count colours. In addition you can avail an updated price of dynam Gaze on the basis of its colours &amp; variants. The dynam Gaze electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>dynam Gaze Range</strong>\n</p><p>dynam Gaze is fitted with a 62 V and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of dynam Gaze is aligned with a Automatic transmission.</p>\n<p><strong>dynam Gaze Brakes &amp; Suspension</strong>\n</p><p>dynam Gaze delivers a Range of 70 km KM in single charge. The Gaze comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy dynam Gaze Electric Scooter</strong>\n</p><p>dynam Gaze at BikeJunction is available with complete information. In addition you can easily get the dynam Gaze on-road price in India. You can easily compare dynam Gaze Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 755,
  "url": "https://bikes.tractorjunction.com/en/suzuki-bikes/rm-z250",
  "content": "\n<p>Suzuki RM Z250 Bike is one of India’s most reputed 2-wheelers. The RM Z250 Bike is manufactured by Suzuki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 249 CC engine that produces N/A power, 30 Kmpl mileage and giving the most superior driving experience to its users. Suzuki RM Z250 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Suzuki RM Z250 Price In India</strong></p> <p>Suzuki RM Z250 Price in India starts from ₹ 7.11 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Suzuki RM Z250 Bike. However, it is necessary to know that the on-road price of the RM Z250 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Suzuki RM Z250 Engine</strong></p>\n<p>Suzuki RM Z250 engine capacity is 249 CC and engineered with 4-Stroke, 1 Cylinder, liquid-Cooled, DOHC engine. This engine generates N/A and N/A of Torque. The engine of RM Z250 is aligned with a 5 Speed gear transmission.</p> <p><strong>Suzuki RM Z250 Mileage</strong></p>\n<p>Suzuki RM Z250 mileage is 30 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 6.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Suzuki RM Z250 Brakes &amp; Suspension</strong></p>\n<p>Suzuki RM Z250 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the RM Z250 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Suzuki RM Z250</strong></p>\n<p>Suzuki RM Z250 at BikeJunction is available with complete information. In addition you can easily get the Suzuki RM Z250 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Suzuki RM Z250 Bike with your other top choices.</p>\n"
}{
  "id": 183,
  "url": "https://bikes.tractorjunction.com/en/ducati-bikes/monster-bs6",
  "content": "\n<p>Ducati Monster BS6 Bike is one of India’s most reputed 2-wheelers. The Monster BS6 Bike is manufactured by Ducati, popularly known for their technologically advanced manufacturing value. Ducati Monster BS6 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 937 CC engine that produces 109.88 bhp @ 9250 rpm power, 19 Kmpl mileage and giving the most superior driving experience to its users. Ducati Monster BS6 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Ducati Monster BS6 Price In India</strong></p> <p>Ducati Monster BS6 Price in India starts from ₹ 12.49 Lakh and goes up to ₹ 12.69 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Ducati Monster BS6 Bike. However, it is necessary to know that the on-road price of the Monster BS6 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Ducati Monster BS6 Engine</strong></p>\n<p>Ducati Monster BS6 engine capacity is 937 CC and engineered with Testatretta 11°, V2 - 90°, 4 valves per cylinder, desmodromic valvetrain, liquid cooled engine. This engine generates 109.88 bhp @ 9250 rpm and 93 Nm @ 6500 rpm of Torque. The engine of Monster BS6 is aligned with a 6 Speed gear transmission.</p> <p><strong>Ducati Monster BS6 Mileage</strong></p>\n<p>Ducati Monster BS6 mileage is 19 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 14 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Ducati Monster BS6 Brakes &amp; Suspension</strong></p>\n<p>Ducati Monster BS6 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Monster BS6 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Ducati Monster BS6</strong></p>\n<p>Ducati Monster BS6 at BikeJunction is available with complete information. In addition you can easily get the Ducati Monster BS6 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Ducati Monster BS6 Bike with your other top choices.</p>\n"
}{
  "id": 394,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/evolet/pony",
  "content": "\n<p>The Evolet Pony is a well known electric Scooter in the Electric vehicle sector of India. This Pony Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Evolet Pony enhance the overall performance.</p>\n<p><strong>Evolet Pony Price In India</strong>\n</p><p>Evolet Pony price in India starts from 57,999. The new model of this Pony electric Scooter is available in 1 colours. In addition you can avail an updated price of Evolet Pony on the basis of its colours &amp; variants. The Evolet Pony electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Evolet Pony Range</strong>\n</p><p>Evolet Pony is fitted with a 1.4 Kwh and has a VRLA Battery type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Evolet Pony is aligned with a N/A transmission.</p>\n<p><strong>Evolet Pony Brakes &amp; Suspension</strong>\n</p><p>Evolet Pony delivers a Range of 80 km/charge KM in single charge. The Pony comes with a BLDC of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Evolet Pony Electric Scooter</strong>\n</p><p>Evolet Pony at BikeJunction is available with complete information. In addition you can easily get the Evolet Pony on-road price in India. You can easily compare Evolet Pony Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 427,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/birla/v6",
  "content": "\n<p>The Birla V6 is a well known electric Bike in the Electric vehicle sector of India. This V6 Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Birla V6 enhance the overall performance.</p>\n<p><strong>Birla V6 Price In India</strong>\n</p><p>Birla V6 price in India includes all 1 variants starts from ₹1.6 Lakh and goes upto ₹2.28 Lakh. The new model of this V6 electric Bike is available in :colours_count colours. In addition you can avail an updated price of Birla V6 on the basis of its colours &amp; variants. The Birla V6 electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Birla V6 Range</strong>\n</p><p>Birla V6 is fitted with a 105 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Birla V6 is aligned with a Automatic transmission.</p>\n<p><strong>Birla V6 Brakes &amp; Suspension</strong>\n</p><p>Birla V6 delivers a Range of N/A KM in single charge. The V6 comes with a BLDC of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Birla V6 Electric Bike</strong>\n</p><p>Birla V6 at BikeJunction is available with complete information. In addition you can easily get the Birla V6 on-road price in India. You can easily compare Birla V6 Bike with the other Bike of this segment.</p>\n"
}{
  "id": 174,
  "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/shotgun-650",
  "content": "\n<p>Royal Enfield Shotgun 650 Bike is one of India’s most reputed 2-wheelers. The Shotgun 650 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Shotgun 650 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 648 CC engine that produces -- power, 25 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Shotgun 650 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Royal Enfield Shotgun 650 Price In India</strong></p> <p>Royal Enfield Shotgun 650 Price in India starts from ₹ 3 Lakh and goes up to ₹ 3.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Royal Enfield Shotgun 650 Bike. However, it is necessary to know that the on-road price of the Shotgun 650 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Royal Enfield Shotgun 650 Engine</strong></p>\n<p>Royal Enfield Shotgun 650 engine capacity is 648 CC and engineered with Not Available engine. This engine generates -- and -- of Torque. The engine of Shotgun 650 is aligned with a 1 Down 5 Up gear transmission.</p> <p><strong>Royal Enfield Shotgun 650 Mileage</strong></p>\n<p>Royal Enfield Shotgun 650 mileage is 25 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of -- litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Royal Enfield Shotgun 650 Brakes &amp; Suspension</strong></p>\n<p>Royal Enfield Shotgun 650 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Shotgun 650 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Royal Enfield Shotgun 650</strong></p>\n<p>Royal Enfield Shotgun 650 at BikeJunction is available with complete information. In addition you can easily get the Royal Enfield Shotgun 650 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Royal Enfield Shotgun 650 Bike with your other top choices.</p>\n"
}{
  "id": 475,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/komaki/xgt-x3",
  "content": "\n<p>The Komaki XGT-X3 is a well known electric Scooter in the Electric vehicle sector of India. This XGT-X3 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Komaki XGT-X3 enhance the overall performance.</p>\n<p><strong>Komaki XGT-X3 Price In India</strong>\n</p><p>Komaki XGT-X3 price in India starts from 95,000. The new model of this XGT-X3 electric Scooter is available in 1 colours. In addition you can avail an updated price of Komaki XGT-X3 on the basis of its colours &amp; variants. The Komaki XGT-X3 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Komaki XGT-X3 Range</strong>\n</p><p>Komaki XGT-X3 is fitted with a N/A and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Komaki XGT-X3 is aligned with a Automatic transmission.</p>\n<p><strong>Komaki XGT-X3 Brakes &amp; Suspension</strong>\n</p><p>Komaki XGT-X3 delivers a Range of N/A KM in single charge. The XGT-X3 comes with a BLDC Hub motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Komaki XGT-X3 Electric Scooter</strong>\n</p><p>Komaki XGT-X3 at BikeJunction is available with complete information. In addition you can easily get the Komaki XGT-X3 on-road price in India. You can easily compare Komaki XGT-X3 Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 387,
  "url": "https://bikes.tractorjunction.com/en/aprilia-bikes/rs-660",
  "content": "\n<p>Aprilia RS 660 Bike is one of India’s most reputed 2-wheelers. The RS 660 Bike is manufactured by Aprilia, popularly known for their technologically advanced manufacturing value. Aprilia RS 660 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 659 CC engine that produces 98.63 bhp @ 10500 rpm power, 20.4 Kmpl mileage and giving the most superior driving experience to its users. Aprilia RS 660 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Aprilia RS 660 Price In India</strong></p> <p>Aprilia RS 660 Price in India starts from ₹ 13.39 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Aprilia RS 660 Bike. However, it is necessary to know that the on-road price of the RS 660 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Aprilia RS 660 Engine</strong></p>\n<p>Aprilia RS 660 engine capacity is 659 CC and engineered with 4-stroke, liquid cooled, twin-cylinder DOHC engine engine. This engine generates 98.63 bhp @ 10500 rpm and 67 Nm @ 8500 rpm of Torque. The engine of RS 660 is aligned with a 6 speed gear transmission.</p> <p><strong>Aprilia RS 660 Mileage</strong></p>\n<p>Aprilia RS 660 mileage is 20.4 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Aprilia RS 660 Brakes &amp; Suspension</strong></p>\n<p>Aprilia RS 660 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the RS 660 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Aprilia RS 660</strong></p>\n<p>Aprilia RS 660 at BikeJunction is available with complete information. In addition you can easily get the Aprilia RS 660 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Aprilia RS 660 Bike with your other top choices.</p>\n"
}{
  "id": 155,
  "url": "https://bikes.tractorjunction.com/en/yezdi-bikes/adventure",
  "content": "\n<p>Yezdi Adventure Bike is one of India’s most reputed 2-wheelers. The Adventure Bike is manufactured by Yezdi, popularly known for their technologically advanced manufacturing value. Yezdi Adventure Bike belongs to the Bike category. The Bike boasts high-tech specifications like 334 CC engine that produces 29.79 bhp @ 8000 rpm power, 33.07 Kmpl mileage and giving the most superior driving experience to its users. Yezdi Adventure Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Yezdi Adventure Price In India</strong></p> <p>Yezdi Adventure Price in India starts from ₹ 2.13 Lakh and goes up to ₹ 2.24 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Yezdi Adventure Bike. However, it is necessary to know that the on-road price of the Adventure Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Yezdi Adventure Engine</strong></p>\n<p>Yezdi Adventure engine capacity is 334 CC and engineered with Single cylinder, 4 Stroke, Liquid Cooled, DOHC engine. This engine generates 29.79 bhp @ 8000 rpm and 29.9 Nm @ 6500 rpm of Torque. The engine of Adventure is aligned with a 6 Speed gear transmission.</p> <p><strong>Yezdi Adventure Mileage</strong></p>\n<p>Yezdi Adventure mileage is 33.07 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15.5 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Yezdi Adventure Brakes &amp; Suspension</strong></p>\n<p>Yezdi Adventure comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Adventure Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Yezdi Adventure</strong></p>\n<p>Yezdi Adventure at BikeJunction is available with complete information. In addition you can easily get the Yezdi Adventure on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Yezdi Adventure Bike with your other top choices.</p>\n"
}{
  "id": 320,
  "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/w800",
  "content": "\n<p>Kawasaki W800 Bike is one of India’s most reputed 2-wheelers. The W800 Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. Kawasaki W800 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 773 CC engine that produces 50.95 bhp @ 6,500 rpm power, 25 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki W800 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Kawasaki W800 Price In India</strong></p> <p>Kawasaki W800 Price in India starts from ₹ 7.33 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki W800 Bike. However, it is necessary to know that the on-road price of the W800 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki W800 Engine</strong></p>\n<p>Kawasaki W800 engine capacity is 773 CC and engineered with Air Cooled , 2 Cylinder, 4 Valve engine. This engine generates 50.95 bhp @ 6,500 rpm and 62.9 Nm @ 4,800 rpm of Torque. The engine of W800 is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>Kawasaki W800 Mileage</strong></p>\n<p>Kawasaki W800 mileage is 25 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 15 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Kawasaki W800 Brakes &amp; Suspension</strong></p>\n<p>Kawasaki W800 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the W800 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Kawasaki W800</strong></p>\n<p>Kawasaki W800 at BikeJunction is available with complete information. In addition you can easily get the Kawasaki W800 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki W800 Bike with your other top choices.</p>\n"
}{
  "id": 62,
  "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/ninja-zx-10r",
  "content": "\n<p>Kawasaki Ninja ZX-10R Bike is one of India’s most reputed 2-wheelers. The Ninja ZX-10R Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. Kawasaki Ninja ZX-10R Bike belongs to the Bike category. The Bike boasts high-tech specifications like 998 CC engine that produces 200.22 bhp @ 13200 rpm power, 12 Kmpl Kmpl mileage and giving the most superior driving experience to its users. Kawasaki Ninja ZX-10R Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p style=\"text-align:justify\">Kawasaki Ninja ZX-10R is a premium high-performance <strong>super sports bike </strong>from the Japanese manufacturer Kawasaki. The ZX-10R is a part of the <strong>Kawasaki Ninja series</strong> of sports motorcycles and has been in production since 2004. The latest model of the ZX-10R, the 2022 version, was unveiled in November 2021. Kawasaki Ninja ZX-10R ex-showroom price is <strong>Rs 16.15 Lakh</strong>.</p>\n<p style=\"text-align:justify\">The ZX-10R is powered by a <strong>998cc inline-four-cylinder engine</strong>, producing <strong>200.22 bhp</strong> and <strong>114.9 Nm</strong> of torque. The BS6-compliant engine is tuned to a <strong>6-speed gearbox</strong> and gives a <strong>mileage of 12 Kmpl</strong> and a <strong>top speed of 299 Kmph.</strong> ZX-10R further features a total fuel tank capacity of <strong>17 Litres, </strong>letting you cover miles before needing to refuel again. In addition, this bike is packed with future-forward electronics, including a <strong>quick shifter, multiple riding modes, traction &amp; launch control</strong>, etc.&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Engine Specifications</strong></p>\n<p style=\"text-align:justify\">At the heart of the Kawasaki Ninja ZX-10R lies a <strong>BS6-compliant, Liquid-cooled, 4-stroke In-Line Four, DOHC</strong> (Dual Overhead Cam) engine type. The engine has a<strong> 16-valve design</strong> (4-valve per cylinder) and can belt out a max power output of <strong>200.22 bhp @ 13200 rpm</strong> and <strong>114.9 Nm @ 11400 rpm</strong> of peak torque.&nbsp;</p>\n<p style=\"text-align:justify\">The engine comes perfectly tuned to a <strong>6-speed gearbox</strong> transmission system with a <strong>slipper clutch </strong>that smooths shifting and reduces rear-wheel hop during hard downshifts.&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Price In India</strong></p>\n<p style=\"text-align:justify\">Check the table below for the accurate <strong>ex-showroom Kawasaki Ninja ZX-10R price</strong> in India.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Kawasaki Ninja ZX - 10R&nbsp;</td>\n<td style=\"text-align:justify\">Rs 16.15 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Mileage</strong></p>\n<p style=\"text-align:justify\">Being a supersport bike, Kawasaki Ninja ZX-10R Mileage is fairly decent. As the company claims, the bike can cover roughly <strong>12 km of distance per litre of petrol</strong>, which is not bad given how performance-oriented the bike is.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Kawasaki Ninja ZX - 10R</td>\n<td style=\"text-align:justify\">12&nbsp; Kmpl</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Technical Specifications</strong></p>\n<p style=\"text-align:justify\">The Kawasaki Ninja ZX-10R is a high-performance motorcycle that is designed for speed and agility. In addition, the bike features multiple advanced technical specifications that make it stand out from other bikes in its class.</p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Suspension</strong> - The bike has a fully adjustable Showa Balance Free Fork (BFF) front suspension system. This advanced suspension system features a design that eliminates the traditional fork springs and replaces them with a hydraulic system that provides smoother and more consistent damping. At the rear, the bike is equipped with a fully adjustable Showa Balance Free Rear Cushion (BFRC) shock absorber, which provides excellent damping and stability in all conditions.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Brakes - </strong>This bike is fitted with Brembo M50 monobloc callipers paired with dual 330 mm semi-floating petal discs in front. For the rear, it has a single 220 mm petal disc brake. Additionally, it comes with Kawasaki’s Intelligent anti-lock Brake System that provides additional control and safety in various riding conditions.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Tyres</strong> - This Ninja bike features a set of tubeless tyres with a front tyre size of 120/70ZR17 inches and a rear tyre size of 190/55ZR17 inches. These tyres are known for providing added stability and maximum traction over roads.&nbsp;</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Dimensions </strong>- Ninja ZX-10R comes with a wheelbase of 1450 mm that provides the bike with added stability even when driven at higher speeds. Additionally, the bike has a total length of 2085 mm, a width of 750 mm, a height of 1185 mm, and an overall ground clearance of 135 mm.</li>\n</ul>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Additional Features</strong></p>\n<p style=\"text-align:justify\">Kawasaki Ninja ZX-10R is a sporty bike that comes with a number of advanced features, which are -</p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Ride Modes</strong>: The motorcycle comes with three ride modes - Rain, Road and Sports- allowing the rider to adjust the mode per the road conditions.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Quick Shifter</strong>: The quick shifter allows for seamless and fast upshifts without the need for the rider to use the clutch.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Traction Control</strong>: Ninja ZX-10R features advanced traction control that helps the rider maintain control in slippery conditions by adjusting the power delivery to the rear wheel.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Anti-lock Braking System (ABS)</strong>: The motorcycle has an innovative ABS that prevents the wheels from locking up during hard braking.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>LED Headlights</strong>: The bike features high-quality LED headlights that provide excellent visibility in low-light conditions.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Electronic Cruise Control</strong>: This feature allows riders to reach a desired speed and maintain it with a simple press of a button. On activation, riders don’t have to apply the throttle, making the ride smoother and stress-free.&nbsp;</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>TFT Display</strong>: The Ninja ZX-10R comes with a full-colour 4.3” all-digital TFT display that provides the rider with all the necessary information, including speed, gear position, fuel level, and more.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong>Launch Control</strong>: The Ninja ZX-10R features launch control that allows the rider to launch the motorcycle off the line with maximum acceleration.</li>\n</ul>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Variants</strong></p>\n<p style=\"text-align:justify\">Kawasaki offers Ninja ZX-10R BS6 in <strong>1 other variant</strong> with a price tag of <strong>Rs 16.15 Lakh</strong> in India.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Kawasaki Ninja ZX - 10R Standard&nbsp;</td>\n<td style=\"text-align:justify\">Rs 16.15 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Competitors in the Market</strong></p>\n<p style=\"text-align:justify\">Kawasaki Ninja ZX-10R has 3 major competitors in the market that offer similar advanced features and power delivery that you must consider before making the decision.&nbsp;</p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Suzuki Hayabusa</strong> - Rs 16.41 Lakh</li>\n<li style=\"text-align: justify;\"><strong>BMW R 1250 R</strong> - Rs 23.95 Lakh</li>\n<li style=\"text-align: justify;\"><strong>Ducati Hypermotard 950</strong> - Rs 15.6 - 17.99 Lakh</li>\n</ul>\n<p style=\"text-align:justify\"><strong>Kawasaki Ninja ZX-10R Monthly Sales</strong></p>\n<p style=\"text-align:justify\">Here’s a look at the Kawasaki Ninja ZX-10R sales number for the previous 3 months.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\" style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td colspan=\"3\" rowspan=\"1\" style=\"text-align:justify\"><strong>Units Sold in March 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>December 2022</strong></td>\n<td style=\"text-align:justify\"><strong>January 2023</strong></td>\n<td style=\"text-align:justify\"><strong>February 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Kawasaki Ninja ZX - 10R</strong></td>\n<td style=\"text-align:justify\">33</td>\n<td style=\"text-align:justify\">28</td>\n<td style=\"text-align:justify\">16</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Why BikeJunction for Kawasaki Ninja ZX-10R?</strong></p>\n<p style=\"text-align:justify\">BikeJunction is a one-stop destination where you can explore and learn all the information regarding the new Kawasaki Ninja ZX-10R Price in India, technical specifications and more. In addition, you can use our innovative and easy-to-use comparison tool. This tool allows you to put the Ninja ZX-10R against its other rivals in the market.&nbsp;</p>\n<p style=\"text-align:justify\">We have also made an exclusive section where you can find all the authentic Kawasaki dealership showrooms in your preferred city, along with their address and contact details.</p>\n<p style=\"text-align:justify\">Furthermore, you get all the latest bike and brand updates in our news section. So now you can find Kawasaki Ninja ZX-10R mileage, engine type, power output, weight, handling, ergonomics and more all under one roof. So, what are you waiting for? Bring home the keys to your new Ninja ZX-10R bike today with BikeJunction!</p>\n"
}{
  "id": 557,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/komaki/xgt-x-one",
  "content": "\n<p>The Komaki XGT-X-ONE is a well known electric Scooter in the Electric vehicle sector of India. This XGT-X-ONE Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Komaki XGT-X-ONE enhance the overall performance.</p>\n<p><strong>Komaki XGT-X-ONE Price In India</strong>\n</p><p>Komaki XGT-X-ONE price in India includes all 1 variants starts from ₹47,617 and goes upto ₹78,920. The new model of this XGT-X-ONE electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Komaki XGT-X-ONE on the basis of its colours &amp; variants. The Komaki XGT-X-ONE electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Komaki XGT-X-ONE Range</strong>\n</p><p>Komaki XGT-X-ONE is fitted with a 48 V / 28 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Komaki XGT-X-ONE is aligned with a Automatic transmission.</p>\n<p><strong>Komaki XGT-X-ONE Brakes &amp; Suspension</strong>\n</p><p>Komaki XGT-X-ONE delivers a Range of 90 KM in single charge. The XGT-X-ONE comes with a BLDC Hub motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Komaki XGT-X-ONE Electric Scooter</strong>\n</p><p>Komaki XGT-X-ONE at BikeJunction is available with complete information. In addition you can easily get the Komaki XGT-X-ONE on-road price in India. You can easily compare Komaki XGT-X-ONE Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 518,
  "url": "https://bikes.tractorjunction.com/en/suzuki-bikes/sv-650",
  "content": "\n<p>Suzuki SV 650 Bike is one of India’s most reputed 2-wheelers. The SV 650 Bike is manufactured by Suzuki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 645 CC engine that produces N/A power, 25-30 Kmpl mileage and giving the most superior driving experience to its users. Suzuki SV 650 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Suzuki SV 650 Price In India</strong></p> <p>Suzuki SV 650 Price in India starts from ₹ 6 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Suzuki SV 650 Bike. However, it is necessary to know that the on-road price of the SV 650 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Suzuki SV 650 Engine</strong></p>\n<p>Suzuki SV 650 engine capacity is 645 CC and engineered with 4-stroke, liquid-cooled, DOHC, 90˚, V-twin engine. This engine generates N/A and N/A of Torque. The engine of SV 650 is aligned with a 6-speed gear transmission.</p> <p><strong>Suzuki SV 650 Mileage</strong></p>\n<p>Suzuki SV 650 mileage is 25-30 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 14.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Suzuki SV 650 Brakes &amp; Suspension</strong></p>\n<p>Suzuki SV 650 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the SV 650 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Suzuki SV 650</strong></p>\n<p>Suzuki SV 650 at BikeJunction is available with complete information. In addition you can easily get the Suzuki SV 650 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Suzuki SV 650 Bike with your other top choices.</p>\n"
}{
  "id": 406,
  "url": "https://bikes.tractorjunction.com/en/cfmoto-bikes/400nk",
  "content": "\n<p>CFMoto 400NK Bike is one of India’s most reputed 2-wheelers. The 400NK Bike is manufactured by CFMoto, popularly known for their technologically advanced manufacturing value. CFMoto 400NK Bike belongs to the Bike category. The Bike boasts high-tech specifications like 400 CC engine that produces 40 bhp power, 27 Kmpl mileage and giving the most superior driving experience to its users. CFMoto 400NK Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>CFMoto 400NK Price In India</strong></p> <p>CFMoto 400NK Price in India starts from ₹ 2.4 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of CFMoto 400NK Bike. However, it is necessary to know that the on-road price of the 400NK Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>CFMoto 400NK Engine</strong></p>\n<p>CFMoto 400NK engine capacity is 400 CC and engineered with Liquid Cooled , 2 Cylinder, 4 Valve engine. This engine generates 40 bhp and 34 Nm of Torque. The engine of 400NK is aligned with a -- gear transmission.</p> <p><strong>CFMoto 400NK Mileage</strong></p>\n<p>CFMoto 400NK mileage is 27 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 17 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>CFMoto 400NK Brakes &amp; Suspension</strong></p>\n<p>CFMoto 400NK comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 400NK Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For CFMoto 400NK</strong></p>\n<p>CFMoto 400NK at BikeJunction is available with complete information. In addition you can easily get the CFMoto 400NK on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the CFMoto 400NK Bike with your other top choices.</p>\n"
}{
  "id": 642,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/merico/eagle-100-60",
  "content": "\n<p>The Merico Eagle 100 (6.0) is a well known electric Scooter in the Electric vehicle sector of India. This Eagle 100 (6.0) Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Merico Eagle 100 (6.0) enhance the overall performance.</p>\n<p><strong>Merico Eagle 100 (6.0) Price In India</strong>\n</p><p>Merico Eagle 100 (6.0) price in India starts from 49,781. The new model of this Eagle 100 (6.0) electric Scooter is available in 1 colours. In addition you can avail an updated price of Merico Eagle 100 (6.0) on the basis of its colours &amp; variants. The Merico Eagle 100 (6.0) electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Merico Eagle 100 (6.0) Range</strong>\n</p><p>Merico Eagle 100 (6.0) is fitted with a 60 V and has a VRLA type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Merico Eagle 100 (6.0) is aligned with a Automatic transmission.</p>\n<p><strong>Merico Eagle 100 (6.0) Brakes &amp; Suspension</strong>\n</p><p>Merico Eagle 100 (6.0) delivers a Range of N/A KM in single charge. The Eagle 100 (6.0) comes with a BLDC of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Merico Eagle 100 (6.0) Electric Scooter</strong>\n</p><p>Merico Eagle 100 (6.0) at BikeJunction is available with complete information. In addition you can easily get the Merico Eagle 100 (6.0) on-road price in India. You can easily compare Merico Eagle 100 (6.0) Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 714,
  "url": "https://bikes.tractorjunction.com/en/honda-bikes/vfr-800f",
  "content": "\n<p>Honda VFR 800F Bike is one of India’s most reputed 2-wheelers. The VFR 800F Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda VFR 800F Bike belongs to the Bike category. The Bike boasts high-tech specifications like 782 CC engine that produces 77.9 kW @ 10,250 rpm power, 15-20 Kmpl mileage and giving the most superior driving experience to its users. Honda VFR 800F Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Honda VFR 800F Price In India</strong></p> <p>Honda VFR 800F Price in India starts from ₹ 9.5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Honda VFR 800F Bike. However, it is necessary to know that the on-road price of the VFR 800F Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda VFR 800F Engine</strong></p>\n<p>Honda VFR 800F engine capacity is 782 CC and engineered with liquid-cooled 16-valve DOHC 90° V4-VTEC engine. This engine generates 77.9 kW @ 10,250 rpm and 75.1 Nm @ 8,500 rpm of Torque. The engine of VFR 800F is aligned with a 6-speed gear transmission.</p> <p><strong>Honda VFR 800F Mileage</strong></p>\n<p>Honda VFR 800F mileage is 15-20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 21.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Honda VFR 800F Brakes &amp; Suspension</strong></p>\n<p>Honda VFR 800F comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the VFR 800F Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Honda VFR 800F</strong></p>\n<p>Honda VFR 800F at BikeJunction is available with complete information. In addition you can easily get the Honda VFR 800F on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda VFR 800F Bike with your other top choices.</p>\n"
}{
  "id": 537,
  "url": "https://bikes.tractorjunction.com/en/benelli-bikes/mbp-502n",
  "content": "\n<p>Benelli MBP 502N Bike is one of India’s most reputed 2-wheelers. The MBP 502N Bike is manufactured by Benelli, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 486 CC engine that produces 47.6 Bhp power, 30-40 Kmpl mileage and giving the most superior driving experience to its users. Benelli MBP 502N Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Benelli MBP 502N Price In India</strong></p> <p>Benelli MBP 502N Price in India starts from ₹ 5 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Benelli MBP 502N Bike. However, it is necessary to know that the on-road price of the MBP 502N Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Benelli MBP 502N Engine</strong></p>\n<p>Benelli MBP 502N engine capacity is 486 CC and engineered with Parallel twin, liquid cooled, 8 valves, DOHC engine. This engine generates 47.6 Bhp and 45 Nm of Torque. The engine of MBP 502N is aligned with a 6 Speed gear transmission.</p> <p><strong>Benelli MBP 502N Mileage</strong></p>\n<p>Benelli MBP 502N mileage is 30-40 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 17 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Benelli MBP 502N Brakes &amp; Suspension</strong></p>\n<p>Benelli MBP 502N comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the MBP 502N Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Benelli MBP 502N</strong></p>\n<p>Benelli MBP 502N at BikeJunction is available with complete information. In addition you can easily get the Benelli MBP 502N on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Benelli MBP 502N Bike with your other top choices.</p>\n"
}{
  "id": 509,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/komaki/xgt-vp",
  "content": "\n<p>The Komaki XGT-VP is a well known electric Scooter in the Electric vehicle sector of India. This XGT-VP Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Komaki XGT-VP enhance the overall performance.</p>\n<p><strong>Komaki XGT-VP Price In India</strong>\n</p><p>Komaki XGT-VP price in India includes all 1 variants starts from ₹65,000 and goes upto ₹84,681. The new model of this XGT-VP electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Komaki XGT-VP on the basis of its colours &amp; variants. The Komaki XGT-VP electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Komaki XGT-VP Range</strong>\n</p><p>Komaki XGT-VP is fitted with a 51 V / 33 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Komaki XGT-VP is aligned with a Automatic transmission.</p>\n<p><strong>Komaki XGT-VP Brakes &amp; Suspension</strong>\n</p><p>Komaki XGT-VP delivers a Range of 75-80 KM in single charge. The XGT-VP comes with a BLDC Hub Motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Komaki XGT-VP Electric Scooter</strong>\n</p><p>Komaki XGT-VP at BikeJunction is available with complete information. In addition you can easily get the Komaki XGT-VP on-road price in India. You can easily compare Komaki XGT-VP Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 314,
  "url": "https://bikes.tractorjunction.com/en/aprilia-scooters/storm-125",
  "content": "\n<p>Aprilia Storm 125 Scooter is one of India’s most reputed 2-wheelers. The Storm 125 Scooter is manufactured by Aprilia, popularly known for their technologically advanced manufacturing value. Aprilia Storm 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 124.45 CC engine that produces 9.78 bhp @ 7,500 rpm power, 40 Kmpl mileage and giving the most superior driving experience to its users. Aprilia Storm 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Aprilia Storm 125 Price In India</strong></p> <p>Aprilia Storm 125 Price in India starts from ₹ 1.1 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Aprilia Storm 125 Scooter. However, it is necessary to know that the on-road price of the Storm 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Aprilia Storm 125 Engine</strong></p>\n<p>Aprilia Storm 125 engine capacity is 124.45 CC and engineered with Air Cooled , 1 Cylinder, 3 Valve engine. This engine generates 9.78 bhp @ 7,500 rpm and 9.6 Nm @ 5,500 rpm of Torque. The engine of Storm 125 is aligned with the Automatic clutch.</p><p> </p><p><strong>Aprilia Storm 125 Mileage</strong></p>\n<p>Aprilia Storm 125 mileage is 40 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 6 L litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>Aprilia Storm 125 Brakes &amp; Suspension</strong></p>\n<p>Aprilia Storm 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Storm 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Aprilia Storm 125</strong></p>\n<p>Aprilia Storm 125 at BikeJunction is available with complete information. In addition you can easily get the Aprilia Storm 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Aprilia Storm 125 Scooter with your other top choices.</p>\n"
}{
  "id": 573,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/komaki/xgt-classic",
  "content": "\n<p>The Komaki XGT-Classic is a well known electric Bike in the Electric vehicle sector of India. This XGT-Classic Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Komaki XGT-Classic enhance the overall performance.</p>\n<p><strong>Komaki XGT-Classic Price In India</strong>\n</p><p>Komaki XGT-Classic price in India starts from 1.11 Lakh. The new model of this XGT-Classic electric Bike is available in 1 colours. In addition you can avail an updated price of Komaki XGT-Classic on the basis of its colours &amp; variants. The Komaki XGT-Classic electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Komaki XGT-Classic Range</strong>\n</p><p>Komaki XGT-Classic is fitted with a 72V/30.5Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Komaki XGT-Classic is aligned with a Automatic transmission.</p>\n<p><strong>Komaki XGT-Classic Brakes &amp; Suspension</strong>\n</p><p>Komaki XGT-Classic delivers a Range of 105 KM in single charge. The XGT-Classic comes with a BLDC Hub Motor of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Komaki XGT-Classic Electric Bike</strong>\n</p><p>Komaki XGT-Classic at BikeJunction is available with complete information. In addition you can easily get the Komaki XGT-Classic on-road price in India. You can easily compare Komaki XGT-Classic Bike with the other Bike of this segment.</p>\n"
}{
  "id": 210,
  "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/softail",
  "content": "\n<p>Harley Davidson Softail Bike is one of India’s most reputed 2-wheelers. The Softail Bike is manufactured by Harley Davidson, popularly known for their technologically advanced manufacturing value. Harley Davidson Softail Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1746 CC engine that produces 85 bhp @ 5,020 rpm power, 18 Kmpl mileage and giving the most superior driving experience to its users. Harley Davidson Softail Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Harley Davidson Softail Price In India</strong></p> <p>Harley Davidson Softail Price in India starts from ₹ 15.25 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Harley Davidson Softail Bike. However, it is necessary to know that the on-road price of the Softail Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Harley Davidson Softail Engine</strong></p>\n<p>Harley Davidson Softail engine capacity is 1746 CC and engineered with Air Cooled , 2 Cylinder, 4 Valve engine. This engine generates 85 bhp @ 5,020 rpm and 144 Nm @ 3,250 rpm of Torque. The engine of Softail is aligned with a 1 Down 5 Up gear transmission.</p> <p><strong>Harley Davidson Softail Mileage</strong></p>\n<p>Harley Davidson Softail mileage is 18 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 13.2 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Harley Davidson Softail Brakes &amp; Suspension</strong></p>\n<p>Harley Davidson Softail comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Softail Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Harley Davidson Softail</strong></p>\n<p>Harley Davidson Softail at BikeJunction is available with complete information. In addition you can easily get the Harley Davidson Softail on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Harley Davidson Softail Bike with your other top choices.</p>\n"
}{
  "id": 485,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/hop/leo",
  "content": "\n<p>The Hop Leo is a well known electric Scooter in the Electric vehicle sector of India. This Leo Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Hop Leo enhance the overall performance.</p>\n<p><strong>Hop Leo Price In India</strong>\n</p><p>Hop Leo price in India includes all 3 variants starts from ₹81,999 and goes upto ₹95,999. The new model of this Leo electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Hop Leo on the basis of its colours &amp; variants. The Hop Leo electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Hop Leo Range</strong>\n</p><p>Hop Leo is fitted with a 1.62 kWh and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Hop Leo is aligned with a Automatic transmission.</p>\n<p><strong>Hop Leo Brakes &amp; Suspension</strong>\n</p><p>Hop Leo delivers a Range of 120 KM in single charge. The Leo comes with a PMSM Motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Hop Leo Electric Scooter</strong>\n</p><p>Hop Leo at BikeJunction is available with complete information. In addition you can easily get the Hop Leo on-road price in India. You can easily compare Hop Leo Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 639,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/adms/gtr",
  "content": "\n<p>The ADMS GTR is a well known electric Scooter in the Electric vehicle sector of India. This GTR Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of ADMS GTR enhance the overall performance.</p>\n<p><strong>ADMS GTR Price In India</strong>\n</p><p>ADMS GTR price in India starts from 79,800. The new model of this GTR electric Scooter is available in 1 colours. In addition you can avail an updated price of ADMS GTR on the basis of its colours &amp; variants. The ADMS GTR electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>ADMS GTR Range</strong>\n</p><p>ADMS GTR is fitted with a 48V 26 AH/60V 36 AH and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of ADMS GTR is aligned with a N/A transmission.</p>\n<p><strong>ADMS GTR Brakes &amp; Suspension</strong>\n</p><p>ADMS GTR delivers a Range of 60/80/120/150/200 KMS KM in single charge. The GTR comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy ADMS GTR Electric Scooter</strong>\n</p><p>ADMS GTR at BikeJunction is available with complete information. In addition you can easily get the ADMS GTR on-road price in India. You can easily compare ADMS GTR Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 778,
  "url": "https://bikes.tractorjunction.com/en/suzuki-bikes/gsx-s750",
  "content": "\n<p>Suzuki GSX S750 Bike is one of India’s most reputed 2-wheelers. The GSX S750 Bike is manufactured by Suzuki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 749 CC engine that produces 114.2 PS @ 10500 rpm power, 20 Kmpl mileage and giving the most superior driving experience to its users. Suzuki GSX S750 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Suzuki GSX S750 Price In India</strong></p> <p>Suzuki GSX S750 Price in India starts from ₹ 7.47 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Suzuki GSX S750 Bike. However, it is necessary to know that the on-road price of the GSX S750 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Suzuki GSX S750 Engine</strong></p>\n<p>Suzuki GSX S750 engine capacity is 749 CC and engineered with Liquid-cooled, 4-cylinder, 4-stroke, DOHC engine. This engine generates 114.2 PS @ 10500 rpm and 81 Nm @ 9000 rpm of Torque. The engine of GSX S750 is aligned with a 6 Speed gear transmission.</p> <p><strong>Suzuki GSX S750 Mileage</strong></p>\n<p>Suzuki GSX S750 mileage is 20 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Suzuki GSX S750 Brakes &amp; Suspension</strong></p>\n<p>Suzuki GSX S750 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the GSX S750 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Suzuki GSX S750</strong></p>\n<p>Suzuki GSX S750 at BikeJunction is available with complete information. In addition you can easily get the Suzuki GSX S750 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Suzuki GSX S750 Bike with your other top choices.</p>\n"
}{
  "id": 680,
  "url": "https://bikes.tractorjunction.com/en/indian-bikes/scout-bobber-sixty",
  "content": "\n<p>Indian Scout Bobber Sixty Bike is one of India’s most reputed 2-wheelers. The Scout Bobber Sixty Bike is manufactured by Indian, popularly known for their technologically advanced manufacturing value. Indian Scout Bobber Sixty Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1000 CC engine that produces N/A power, 25 Kmpl mileage and giving the most superior driving experience to its users. Indian Scout Bobber Sixty Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Indian Scout Bobber Sixty Price In India</strong></p> <p>Indian Scout Bobber Sixty Price in India starts from ₹ 12 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Indian Scout Bobber Sixty Bike. However, it is necessary to know that the on-road price of the Scout Bobber Sixty Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Indian Scout Bobber Sixty Engine</strong></p>\n<p>Indian Scout Bobber Sixty engine capacity is 1000 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of Scout Bobber Sixty is aligned with a N/A gear transmission.</p> <p><strong>Indian Scout Bobber Sixty Mileage</strong></p>\n<p>Indian Scout Bobber Sixty mileage is 25 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Indian Scout Bobber Sixty Brakes &amp; Suspension</strong></p>\n<p>Indian Scout Bobber Sixty comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Scout Bobber Sixty Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Indian Scout Bobber Sixty</strong></p>\n<p>Indian Scout Bobber Sixty at BikeJunction is available with complete information. In addition you can easily get the Indian Scout Bobber Sixty on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Indian Scout Bobber Sixty Bike with your other top choices.</p>\n"
}{
  "id": 727,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/komaki/se",
  "content": "\n<p>The Komaki SE is a well known electric Scooter in the Electric vehicle sector of India. This SE Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Komaki SE enhance the overall performance.</p>\n<p><strong>Komaki SE Price In India</strong>\n</p><p>Komaki SE price in India includes all 1 variants starts from ₹1.01 Lakh and goes upto ₹1.35 Lakh. The new model of this SE electric Scooter is available in :colours_count colours. In addition you can avail an updated price of Komaki SE on the basis of its colours &amp; variants. The Komaki SE electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Komaki SE Range</strong>\n</p><p>Komaki SE is fitted with a 74 V/ 44 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Komaki SE is aligned with a Automatic transmission.</p>\n<p><strong>Komaki SE Brakes &amp; Suspension</strong>\n</p><p>Komaki SE delivers a Range of 130-150 KM in single charge. The SE comes with a BLDC Hub motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Komaki SE Electric Scooter</strong>\n</p><p>Komaki SE at BikeJunction is available with complete information. In addition you can easily get the Komaki SE on-road price in India. You can easily compare Komaki SE Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 770,
  "url": "https://bikes.tractorjunction.com/en/ducati-bikes/full-throttel",
  "content": "\n<p>Ducati Full Throttel Bike is one of India’s most reputed 2-wheelers. The Full Throttel Bike is manufactured by Ducati, popularly known for their technologically advanced manufacturing value. Ducati Full Throttel Bike belongs to the Bike category. The Bike boasts high-tech specifications like 803 CC engine that produces 73 hp (53.6 kW) @ 8,250 rpm power, 19.6 Kmpl mileage and giving the most superior driving experience to its users. Ducati Full Throttel Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Ducati Full Throttel Price In India</strong></p> <p>Ducati Full Throttel Price in India starts from ₹ 12 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Ducati Full Throttel Bike. However, it is necessary to know that the on-road price of the Full Throttel Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Ducati Full Throttel Engine</strong></p>\n<p>Ducati Full Throttel engine capacity is 803 CC and engineered with L-Twin, Desmodromic distribution, 2 valves per cylinder, air cooled engine. This engine generates 73 hp (53.6 kW) @ 8,250 rpm and 48.1 lb-ft (65.2 Nm) @ 7,000 rpm of Torque. The engine of Full Throttel is aligned with a 6 speed with Ducati Quick Shift up/down gear transmission.</p> <p><strong>Ducati Full Throttel Mileage</strong></p>\n<p>Ducati Full Throttel mileage is 19.6 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 13.5 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Ducati Full Throttel Brakes &amp; Suspension</strong></p>\n<p>Ducati Full Throttel comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Full Throttel Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Ducati Full Throttel</strong></p>\n<p>Ducati Full Throttel at BikeJunction is available with complete information. In addition you can easily get the Ducati Full Throttel on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Ducati Full Throttel Bike with your other top choices.</p>\n"
}{
  "id": 715,
  "url": "https://bikes.tractorjunction.com/en/suzuki-bikes/gsx-s125",
  "content": "\n<p>Suzuki GSX S125 Bike is one of India’s most reputed 2-wheelers. The GSX S125 Bike is manufactured by Suzuki, popularly known for their technologically advanced manufacturing value. Suzuki GSX S125 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 124.4 CC engine that produces N/A power, 40-45 Kmpl mileage and giving the most superior driving experience to its users. Suzuki GSX S125 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Suzuki GSX S125 Price In India</strong></p> <p>Suzuki GSX S125 Price in India starts from ₹ 1 Lakh and goes up to ₹ 1.25 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Suzuki GSX S125 Bike. However, it is necessary to know that the on-road price of the GSX S125 Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Suzuki GSX S125 Engine</strong></p>\n<p>Suzuki GSX S125 engine capacity is 124.4 CC and engineered with 4-stroke, 1-cylinder, liquid-cooled, DOHC engine. This engine generates N/A and N/A of Torque. The engine of GSX S125 is aligned with a 6 Speed gear transmission.</p> <p><strong>Suzuki GSX S125 Mileage</strong></p>\n<p>Suzuki GSX S125 mileage is 40-45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 11 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Suzuki GSX S125 Brakes &amp; Suspension</strong></p>\n<p>Suzuki GSX S125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the GSX S125 Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Suzuki GSX S125</strong></p>\n<p>Suzuki GSX S125 at BikeJunction is available with complete information. In addition you can easily get the Suzuki GSX S125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Suzuki GSX S125 Bike with your other top choices.</p>\n"
}{
  "id": 633,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/ampere/primus-rcb",
  "content": "\n<p>The Ampere Primus RCB is a well known electric Scooter in the Electric vehicle sector of India. This Primus RCB Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Ampere Primus RCB enhance the overall performance.</p>\n<p><strong>Ampere Primus RCB Price In India</strong>\n</p><p>Ampere Primus RCB price in India starts from 1.1 Lakh. The new model of this Primus RCB electric Scooter is available in 1 colours. In addition you can avail an updated price of Ampere Primus RCB on the basis of its colours &amp; variants. The Ampere Primus RCB electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Ampere Primus RCB Range</strong>\n</p><p>Ampere Primus RCB is fitted with a 48V, 3KWh and has a LFP type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Ampere Primus RCB is aligned with a N/A transmission.</p>\n<p><strong>Ampere Primus RCB Brakes &amp; Suspension</strong>\n</p><p>Ampere Primus RCB delivers a Range of 107 km KM in single charge. The Primus RCB comes with a PMS Electric of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Ampere Primus RCB Electric Scooter</strong>\n</p><p>Ampere Primus RCB at BikeJunction is available with complete information. In addition you can easily get the Ampere Primus RCB on-road price in India. You can easily compare Ampere Primus RCB Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 574,
  "url": "https://bikes.tractorjunction.com/en/indian-bikes/roadmaster-dark-horse",
  "content": "\n<p>Indian Roadmaster Dark Horse Bike is one of India’s most reputed 2-wheelers. The Roadmaster Dark Horse Bike is manufactured by Indian, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 1890 CC engine that produces N/A power, 15 Kmpl mileage and giving the most superior driving experience to its users. Indian Roadmaster Dark Horse Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Indian Roadmaster Dark Horse Price In India</strong></p> <p>Indian Roadmaster Dark Horse Price in India starts from ₹ 43.65 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Indian Roadmaster Dark Horse Bike. However, it is necessary to know that the on-road price of the Roadmaster Dark Horse Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Indian Roadmaster Dark Horse Engine</strong></p>\n<p>Indian Roadmaster Dark Horse engine capacity is 1890 CC and engineered with Thunderstroke 116 engine. This engine generates N/A and N/A of Torque. The engine of Roadmaster Dark Horse is aligned with a 6speed gear transmission.</p> <p><strong>Indian Roadmaster Dark Horse Mileage</strong></p>\n<p>Indian Roadmaster Dark Horse mileage is 15 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 20.8 litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Indian Roadmaster Dark Horse Brakes &amp; Suspension</strong></p>\n<p>Indian Roadmaster Dark Horse comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Roadmaster Dark Horse Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Indian Roadmaster Dark Horse</strong></p>\n<p>Indian Roadmaster Dark Horse at BikeJunction is available with complete information. In addition you can easily get the Indian Roadmaster Dark Horse on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Indian Roadmaster Dark Horse Bike with your other top choices.</p>\n"
}