[
  {
    "id": 2001,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/lectrix/lxsg-30-standard",
    "content": "<p>The Lectrix LXSG 3.0 standard is a well known electric Scooter in the Electric vehicle sector of India. This LXSG 3.0 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Lectrix LXSG 3.0 standard enhance the overall performance.</p><p><strong>Lectrix LXSG 3.0 standard Price In India</strong></p><p>Lectrix LXSG 3.0 standard price in India starts from 1.05 Lakh. The new model of this LXSG 3.0 standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Lectrix LXSG 3.0 standard on the basis of its colours &amp; variants. The Lectrix LXSG 3.0 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Lectrix LXSG 3.0 standard Range</strong></p><p>Lectrix LXSG 3.0 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Lectrix LXSG 3.0 standard is aligned with a N/A transmission.</p><p><strong>Lectrix LXSG 3.0 standard Brakes &amp; Suspension</strong></p><p>Lectrix LXSG 3.0 standard delivers a Range of N/A KM in single charge. The LXSG 3.0 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Lectrix LXSG 3.0 standard Electric Scooter</strong></p><p>Lectrix LXSG 3.0 standard at BikeJunction is available with complete information. In addition you can easily get the Lectrix LXSG 3.0 standard on-road price in India. You can easily compare Lectrix LXSG 3.0 standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 2003,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-air-gen-2",
    "content": "<p>The OLA S1 Air Gen 2 is a well known electric Scooter in the Electric vehicle sector of India. This S1 Air Gen 2 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 Air Gen 2 enhance the overall performance.</p><p><strong>OLA S1 Air Gen 2 Price In India</strong></p><p>OLA S1 Air Gen 2 price in India starts from 1.21 Lakh. The new model of this S1 Air Gen 2 electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 Air Gen 2 on the basis of its colours &amp; variants. The OLA S1 Air Gen 2 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 Air Gen 2 Range</strong></p><p>OLA S1 Air Gen 2 is fitted with a 3 kWh and has a Lithium Ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of OLA S1 Air Gen 2 is aligned with a Automatic transmission.</p><p><strong>OLA S1 Air Gen 2 Brakes &amp; Suspension</strong></p><p>OLA S1 Air Gen 2 delivers a Range of 125 Km KM in single charge. The S1 Air Gen 2 comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 Air Gen 2 Electric Scooter</strong></p><p>OLA S1 Air Gen 2 at BikeJunction is available with complete information. In addition you can easily get the OLA S1 Air Gen 2 on-road price in India. You can easily compare OLA S1 Air Gen 2 Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1961,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/okaya/faast-f2t-standard",
    "content": "<p>The Okaya Faast F2T standard is a well known electric Scooter in the Electric vehicle sector of India. This Faast F2T standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Okaya Faast F2T standard enhance the overall performance.</p><p><strong>Okaya Faast F2T standard Price In India</strong></p><p>Okaya Faast F2T standard price in India starts from 1.06 Lakh. The new model of this Faast F2T standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Okaya Faast F2T standard on the basis of its colours &amp; variants. The Okaya Faast F2T standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Okaya Faast F2T standard Range</strong></p><p>Okaya Faast F2T standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Okaya Faast F2T standard is aligned with a N/A transmission.</p><p><strong>Okaya Faast F2T standard Brakes &amp; Suspension</strong></p><p>Okaya Faast F2T standard delivers a Range of N/A KM in single charge. The Faast F2T standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Okaya Faast F2T standard Electric Scooter</strong></p><p>Okaya Faast F2T standard at BikeJunction is available with complete information. In addition you can easily get the Okaya Faast F2T standard on-road price in India. You can easily compare Okaya Faast F2T standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1971,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/okinawa/ridge-100-standard",
    "content": "<p>The Okinawa Ridge 100 standard is a well known electric Scooter in the Electric vehicle sector of India. This Ridge 100 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Okinawa Ridge 100 standard enhance the overall performance.</p><p><strong>Okinawa Ridge 100 standard Price In India</strong></p><p>Okinawa Ridge 100 standard price in India starts from 1.22 Lakh. The new model of this Ridge 100 standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Okinawa Ridge 100 standard on the basis of its colours &amp; variants. The Okinawa Ridge 100 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Okinawa Ridge 100 standard Range</strong></p><p>Okinawa Ridge 100 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Okinawa Ridge 100 standard is aligned with a N/A transmission.</p><p><strong>Okinawa Ridge 100 standard Brakes &amp; Suspension</strong></p><p>Okinawa Ridge 100 standard delivers a Range of N/A KM in single charge. The Ridge 100 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Okinawa Ridge 100 standard Electric Scooter</strong></p><p>Okinawa Ridge 100 standard at BikeJunction is available with complete information. In addition you can easily get the Okinawa Ridge 100 standard on-road price in India. You can easily compare Okinawa Ridge 100 standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1965,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/350x-standard",
    "content": "<p>Zontes 350X standard Bike is one of India’s most reputed 2-wheelers. The 350X standard Bike is manufactured by Zontes, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 348 CC engine that produces N/A power, 35-40 Kmpl mileage and giving the most superior driving experience to its users. Zontes 350X standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Zontes 350X standard Price In India</strong></p> <p>Zontes 350X standard Price in India starts from ₹ 3.87 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Zontes 350X standard Bike. However, it is necessary to know that the on-road price of the 350X standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Zontes 350X standard Engine</strong></p><p>Zontes 350X standard engine capacity is 348 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of 350X standard is aligned with a N/A gear transmission.</p> <p><strong>Zontes 350X standard Mileage</strong></p><p>Zontes 350X standard mileage is 35-40 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Zontes 350X standard Brakes &amp; Suspension</strong></p><p>Zontes 350X standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 350X standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Zontes 350X standard</strong></p><p>Zontes 350X standard at BikeJunction is available with complete information. In addition you can easily get the Zontes 350X standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Zontes 350X standard Bike with your other top choices.</p>"
  },
  {
    "id": 1985,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/rtr-310-805-standard",
    "content": "<p>TVS Apache RTR 310 standard Bike is one of India’s most reputed 2-wheelers. The Apache RTR 310 standard Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 312.2 CC engine that produces N/A power, 35 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 310 standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>TVS Apache RTR 310 standard Price In India</strong></p> <p>TVS Apache RTR 310 standard Price in India starts from ₹ 2.2 Lakh and goes up to ₹ 2.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 310 standard Bike. However, it is necessary to know that the on-road price of the Apache RTR 310 standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 310 standard Engine</strong></p><p>TVS Apache RTR 310 standard engine capacity is 312.2 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of Apache RTR 310 standard is aligned with a N/A gear transmission.</p> <p><strong>TVS Apache RTR 310 standard Mileage</strong></p><p>TVS Apache RTR 310 standard mileage is 35 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>TVS Apache RTR 310 standard Brakes &amp; Suspension</strong></p><p>TVS Apache RTR 310 standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 310 standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For TVS Apache RTR 310 standard</strong></p><p>TVS Apache RTR 310 standard at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 310 standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 310 standard Bike with your other top choices.</p>"
  },
  {
    "id": 1974,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/battre/one-154-standard",
    "content": "<p>The BattRE ONE standard is a well known electric Scooter in the Electric vehicle sector of India. This ONE standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of BattRE ONE standard enhance the overall performance.</p><p><strong>BattRE ONE standard Price In India</strong></p><p>BattRE ONE standard price in India includes all 0 variants starts from ₹73,900 and goes upto ₹1.08 Lakh. The new model of this ONE standard electric Scooter is available in :colours_count colours. In addition you can avail an updated price of BattRE ONE standard on the basis of its colours &amp; variants. The BattRE ONE standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>BattRE ONE standard Range</strong></p><p>BattRE ONE standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of BattRE ONE standard is aligned with a N/A transmission.</p><p><strong>BattRE ONE standard Brakes &amp; Suspension</strong></p><p>BattRE ONE standard delivers a Range of N/A KM in single charge. The ONE standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy BattRE ONE standard Electric Scooter</strong></p><p>BattRE ONE standard at BikeJunction is available with complete information. In addition you can easily get the BattRE ONE standard on-road price in India. You can easily compare BattRE ONE standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1963,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ivoomi/s1-158-standard",
    "content": "<p>The iVOOMi S1 standard is a well known electric Scooter in the Electric vehicle sector of India. This S1 standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of iVOOMi S1 standard enhance the overall performance.</p><p><strong>iVOOMi S1 standard Price In India</strong></p><p>iVOOMi S1 standard price in India starts from 69,999. The new model of this S1 standard electric Scooter is available in 1 colours. In addition you can avail an updated price of iVOOMi S1 standard on the basis of its colours &amp; variants. The iVOOMi S1 standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>iVOOMi S1 standard Range</strong></p><p>iVOOMi S1 standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of iVOOMi S1 standard is aligned with a N/A transmission.</p><p><strong>iVOOMi S1 standard Brakes &amp; Suspension</strong></p><p>iVOOMi S1 standard delivers a Range of N/A KM in single charge. The S1 standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy iVOOMi S1 standard Electric Scooter</strong></p><p>iVOOMi S1 standard at BikeJunction is available with complete information. In addition you can easily get the iVOOMi S1 standard on-road price in India. You can easily compare iVOOMi S1 standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1987,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/kx112-standard",
    "content": "<p>Kawasaki KX112 standard Bike is one of India’s most reputed 2-wheelers. The KX112 standard Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 112 CC engine that produces N/A power, 24 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki KX112 standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Kawasaki KX112 standard Price In India</strong></p> <p>Kawasaki KX112 standard Price in India starts from ₹ 4.88 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki KX112 standard Bike. However, it is necessary to know that the on-road price of the KX112 standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki KX112 standard Engine</strong></p><p>Kawasaki KX112 standard engine capacity is 112 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of KX112 standard is aligned with a N/A gear transmission.</p> <p><strong>Kawasaki KX112 standard Mileage</strong></p><p>Kawasaki KX112 standard mileage is 24 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Kawasaki KX112 standard Brakes &amp; Suspension</strong></p><p>Kawasaki KX112 standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the KX112 standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Kawasaki KX112 standard</strong></p><p>Kawasaki KX112 standard at BikeJunction is available with complete information. In addition you can easily get the Kawasaki KX112 standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki KX112 standard Bike with your other top choices.</p>"
  },
  {
    "id": 1989,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/destini-prime-standard",
    "content": "<p>Hero Destini Prime standard Scooter is one of India’s most reputed 2-wheelers. The Destini Prime standard Scooter is manufactured by Hero, popularly known for their technologically advanced manufacturing value. The Scooter boasts high-tech specifications like 124.6 CC engine that produces N/A power, 45 Kmpl mileage and giving the most superior driving experience to its users. Hero Destini Prime standard Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Hero Destini Prime standard Price In India</strong></p> <p>Hero Destini Prime standard Price in India starts from ₹ 84,689. BikeJunction provides you a complete list of the updated and accurate price range of Hero Destini Prime standard Scooter. However, it is necessary to know that the on-road price of the Destini Prime standard Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Destini Prime standard Engine</strong></p><p>Hero Destini Prime standard engine capacity is 124.6 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of Destini Prime standard is aligned with the N/A clutch.</p><p> </p><p><strong>Hero Destini Prime standard Mileage</strong></p><p>Hero Destini Prime standard mileage is 45 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of N/A litres. This combination gives this Scooter a good driving range.</p><p><strong>Hero Destini Prime standard Brakes &amp; Suspension</strong></p><p>Hero Destini Prime standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Destini Prime standard Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Hero Destini Prime standard</strong></p><p>Hero Destini Prime standard at BikeJunction is available with complete information. In addition you can easily get the Hero Destini Prime standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Destini Prime standard Scooter with your other top choices.</p>"
  },
  {
    "id": 1998,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/bullet-350-next-gen-top",
    "content": "<p>Royal Enfield Bullet 350 Next Gen Top Bike is one of India’s most reputed 2-wheelers. The Bullet 350 Next Gen Top Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 bhp @ 6100 rpm power, 40.8 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Bullet 350 Next Gen Top Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Royal Enfield Bullet 350 Next Gen Top Price In India</strong></p> <p>Royal Enfield Bullet 350 Next Gen Top Price in India starts from ₹ 2.16 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Royal Enfield Bullet 350 Next Gen Top Bike. However, it is necessary to know that the on-road price of the Bullet 350 Next Gen Top Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Royal Enfield Bullet 350 Next Gen Top Engine</strong></p><p>Royal Enfield Bullet 350 Next Gen Top engine capacity is 349 CC and engineered with N/A engine. This engine generates 20.2 bhp @ 6100 rpm and 27 Nm @ 4000 rpm of Torque. The engine of Bullet 350 Next Gen Top is aligned with a 5 Speed gear transmission.</p> <p><strong>Royal Enfield Bullet 350 Next Gen Top Mileage</strong></p><p>Royal Enfield Bullet 350 Next Gen Top mileage is 40.8 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 13 litres litres. This combination gives this Bike a good driving range.</p><p><strong>Royal Enfield Bullet 350 Next Gen Top Brakes &amp; Suspension</strong></p><p>Royal Enfield Bullet 350 Next Gen Top comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Bullet 350 Next Gen Top Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Royal Enfield Bullet 350 Next Gen Top</strong></p><p>Royal Enfield Bullet 350 Next Gen Top at BikeJunction is available with complete information. In addition you can easily get the Royal Enfield Bullet 350 Next Gen Top on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Royal Enfield Bullet 350 Next Gen Top Bike with your other top choices.</p>"
  },
  {
    "id": 1964,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/kx65-standard",
    "content": "<p>Kawasaki KX65 standard Bike is one of India’s most reputed 2-wheelers. The KX65 standard Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 64 CC engine that produces N/A power, 30 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki KX65 standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Kawasaki KX65 standard Price In India</strong></p> <p>Kawasaki KX65 standard Price in India starts from ₹ 3.12 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki KX65 standard Bike. However, it is necessary to know that the on-road price of the KX65 standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki KX65 standard Engine</strong></p><p>Kawasaki KX65 standard engine capacity is 64 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of KX65 standard is aligned with a N/A gear transmission.</p> <p><strong>Kawasaki KX65 standard Mileage</strong></p><p>Kawasaki KX65 standard mileage is 30 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Kawasaki KX65 standard Brakes &amp; Suspension</strong></p><p>Kawasaki KX65 standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the KX65 standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Kawasaki KX65 standard</strong></p><p>Kawasaki KX65 standard at BikeJunction is available with complete information. In addition you can easily get the Kawasaki KX65 standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki KX65 standard Bike with your other top choices.</p>"
  },
  {
    "id": 1999,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/enigma/cafe-racer-standard",
    "content": "<p>The Enigma Cafe Racer standard is a well known electric Bike in the Electric vehicle sector of India. This Cafe Racer standard Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Cafe Racer standard enhance the overall performance.</p><p><strong>Enigma Cafe Racer standard Price In India</strong></p><p>Enigma Cafe Racer standard price in India includes all 0 variants starts from ₹80,000 and goes upto ₹1.2 Lakh. The new model of this Cafe Racer standard electric Bike is available in :colours_count colours. In addition you can avail an updated price of Enigma Cafe Racer standard on the basis of its colours &amp; variants. The Enigma Cafe Racer standard electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Cafe Racer standard Range</strong></p><p>Enigma Cafe Racer standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Cafe Racer standard is aligned with a N/A transmission.</p><p><strong>Enigma Cafe Racer standard Brakes &amp; Suspension</strong></p><p>Enigma Cafe Racer standard delivers a Range of N/A KM in single charge. The Cafe Racer standard comes with a N/A of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Cafe Racer standard Electric Bike</strong></p><p>Enigma Cafe Racer standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Cafe Racer standard on-road price in India. You can easily compare Enigma Cafe Racer standard Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 1994,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-pro-gen-2",
    "content": "<p>The OLA S1 Pro Gen 2 is a well known electric Scooter in the Electric vehicle sector of India. This S1 Pro Gen 2 Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 Pro Gen 2 enhance the overall performance.</p><p><strong>OLA S1 Pro Gen 2 Price In India</strong></p><p>OLA S1 Pro Gen 2 price in India starts from 1.62 Lakh. The new model of this S1 Pro Gen 2 electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 Pro Gen 2 on the basis of its colours &amp; variants. The OLA S1 Pro Gen 2 electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 Pro Gen 2 Range</strong></p><p>OLA S1 Pro Gen 2 is fitted with a 4 kWh and has a Lithium Ion type of battery. This battery pack generates 11000 W power and N/A of Torque. The battery of OLA S1 Pro Gen 2 is aligned with a Automatic transmission.</p><p><strong>OLA S1 Pro Gen 2 Brakes &amp; Suspension</strong></p><p>OLA S1 Pro Gen 2 delivers a Range of 195 Km KM in single charge. The S1 Pro Gen 2 comes with a Mid Drive IPM of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 Pro Gen 2 Electric Scooter</strong></p><p>OLA S1 Pro Gen 2 at BikeJunction is available with complete information. In addition you can easily get the OLA S1 Pro Gen 2 on-road price in India. You can easily compare OLA S1 Pro Gen 2 Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1968,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/350t-standard",
    "content": "<p>Zontes 350T standard Bike is one of India’s most reputed 2-wheelers. The 350T standard Bike is manufactured by Zontes, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 348 CC engine that produces N/A power, 35-40 Kmpl mileage and giving the most superior driving experience to its users. Zontes 350T standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Zontes 350T standard Price In India</strong></p> <p>Zontes 350T standard Price in India starts from ₹ 3.89 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Zontes 350T standard Bike. However, it is necessary to know that the on-road price of the 350T standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Zontes 350T standard Engine</strong></p><p>Zontes 350T standard engine capacity is 348 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of 350T standard is aligned with a N/A gear transmission.</p> <p><strong>Zontes 350T standard Mileage</strong></p><p>Zontes 350T standard mileage is 35-40 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Zontes 350T standard Brakes &amp; Suspension</strong></p><p>Zontes 350T standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the 350T standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Zontes 350T standard</strong></p><p>Zontes 350T standard at BikeJunction is available with complete information. In addition you can easily get the Zontes 350T standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Zontes 350T standard Bike with your other top choices.</p>"
  },
  {
    "id": 1992,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/godawari/eblu-feo-standard",
    "content": "<p>The Godawari Eblu Feo standard is a well known electric Scooter in the Electric vehicle sector of India. This Eblu Feo standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Godawari Eblu Feo standard enhance the overall performance.</p><p><strong>Godawari Eblu Feo standard Price In India</strong></p><p>Godawari Eblu Feo standard price in India starts from 99,999. The new model of this Eblu Feo standard electric Scooter is available in 1 colours. In addition you can avail an updated price of Godawari Eblu Feo standard on the basis of its colours &amp; variants. The Godawari Eblu Feo standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Godawari Eblu Feo standard Range</strong></p><p>Godawari Eblu Feo standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Godawari Eblu Feo standard is aligned with a N/A transmission.</p><p><strong>Godawari Eblu Feo standard Brakes &amp; Suspension</strong></p><p>Godawari Eblu Feo standard delivers a Range of N/A KM in single charge. The Eblu Feo standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Godawari Eblu Feo standard Electric Scooter</strong></p><p>Godawari Eblu Feo standard at BikeJunction is available with complete information. In addition you can easily get the Godawari Eblu Feo standard on-road price in India. You can easily compare Godawari Eblu Feo standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1980,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/enigma/heavy-one-loader-standard",
    "content": "<p>The Enigma Heavy One Loader standard is a well known electric Bike in the Electric vehicle sector of India. This Heavy One Loader standard Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Enigma Heavy One Loader standard enhance the overall performance.</p><p><strong>Enigma Heavy One Loader standard Price In India</strong></p><p>Enigma Heavy One Loader standard price in India starts from 75,000. The new model of this Heavy One Loader standard electric Bike is available in 1 colours. In addition you can avail an updated price of Enigma Heavy One Loader standard on the basis of its colours &amp; variants. The Enigma Heavy One Loader standard electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>Enigma Heavy One Loader standard Range</strong></p><p>Enigma Heavy One Loader standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Enigma Heavy One Loader standard is aligned with a N/A transmission.</p><p><strong>Enigma Heavy One Loader standard Brakes &amp; Suspension</strong></p><p>Enigma Heavy One Loader standard delivers a Range of N/A KM in single charge. The Heavy One Loader standard comes with a N/A of Motor. This combination gives this Bike a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy Enigma Heavy One Loader standard Electric Bike</strong></p><p>Enigma Heavy One Loader standard at BikeJunction is available with complete information. In addition you can easily get the Enigma Heavy One Loader standard on-road price in India. You can easily compare Enigma Heavy One Loader standard Bike with the other Bike of this segment.</p>"
  },
  {
    "id": 2005,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ivoomi/jeet-x-standard",
    "content": "<p>The iVOOMi Jeet X standard is a well known electric Scooter in the Electric vehicle sector of India. This Jeet X standard Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of iVOOMi Jeet X standard enhance the overall performance.</p><p><strong>iVOOMi Jeet X standard Price In India</strong></p><p>iVOOMi Jeet X standard price in India starts from 99,999. The new model of this Jeet X standard electric Scooter is available in 1 colours. In addition you can avail an updated price of iVOOMi Jeet X standard on the basis of its colours &amp; variants. The iVOOMi Jeet X standard electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>iVOOMi Jeet X standard Range</strong></p><p>iVOOMi Jeet X standard is fitted with a N/A and has a N/A type of battery. This battery pack generates N/A power and N/A of Torque. The battery of iVOOMi Jeet X standard is aligned with a N/A transmission.</p><p><strong>iVOOMi Jeet X standard Brakes &amp; Suspension</strong></p><p>iVOOMi Jeet X standard delivers a Range of N/A KM in single charge. The Jeet X standard comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy iVOOMi Jeet X standard Electric Scooter</strong></p><p>iVOOMi Jeet X standard at BikeJunction is available with complete information. In addition you can easily get the iVOOMi Jeet X standard on-road price in India. You can easily compare iVOOMi Jeet X standard Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 2000,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/livo-disc-2023",
    "content": "<p>Honda Livo Disc [2023] Bike is one of India’s most reputed 2-wheelers. The Livo Disc [2023] Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 109.51 CC engine that produces 8.67 bhp @ 7500 rpm power, 60 Kmpl mileage and giving the most superior driving experience to its users. Honda Livo Disc [2023] Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda Livo Disc [2023] Price In India</strong></p> <p>Honda Livo Disc [2023] Price in India starts from ₹ 96,781. BikeJunction provides you a complete list of the updated and accurate price range of Honda Livo Disc [2023] Bike. However, it is necessary to know that the on-road price of the Livo Disc [2023] Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Livo Disc [2023] Engine</strong></p><p>Honda Livo Disc [2023] engine capacity is 109.51 CC and engineered with N/A engine. This engine generates 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm of Torque. The engine of Livo Disc [2023] is aligned with a 4 Speed gear transmission.</p> <p><strong>Honda Livo Disc [2023] Mileage</strong></p><p>Honda Livo Disc [2023] mileage is 60 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 9 L litres. This combination gives this Bike a good driving range.</p><p><strong>Honda Livo Disc [2023] Brakes &amp; Suspension</strong></p><p>Honda Livo Disc [2023] comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Livo Disc [2023] Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda Livo Disc [2023]</strong></p><p>Honda Livo Disc [2023] at BikeJunction is available with complete information. In addition you can easily get the Honda Livo Disc [2023] on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Livo Disc [2023] Bike with your other top choices.</p>"
  },
  {
    "id": 1972,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/klx230r-s-standard",
    "content": "<p>Kawasaki KLX230R S standard Bike is one of India’s most reputed 2-wheelers. The KLX230R S standard Bike is manufactured by Kawasaki, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 233 CC engine that produces N/A power, 40-50 Kmpl mileage and giving the most superior driving experience to its users. Kawasaki KLX230R S standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Kawasaki KLX230R S standard Price In India</strong></p> <p>Kawasaki KLX230R S standard Price in India starts from ₹ 5.21 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Kawasaki KLX230R S standard Bike. However, it is necessary to know that the on-road price of the KLX230R S standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Kawasaki KLX230R S standard Engine</strong></p><p>Kawasaki KLX230R S standard engine capacity is 233 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of KLX230R S standard is aligned with a N/A gear transmission.</p> <p><strong>Kawasaki KLX230R S standard Mileage</strong></p><p>Kawasaki KLX230R S standard mileage is 40-50 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Kawasaki KLX230R S standard Brakes &amp; Suspension</strong></p><p>Kawasaki KLX230R S standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the KLX230R S standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Kawasaki KLX230R S standard</strong></p><p>Kawasaki KLX230R S standard at BikeJunction is available with complete information. In addition you can easily get the Kawasaki KLX230R S standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Kawasaki KLX230R S standard Bike with your other top choices.</p>"
  },
  {
    "id": 1995,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/gk350-standard",
    "content": "<p>Zontes GK350 standard Bike is one of India’s most reputed 2-wheelers. The GK350 standard Bike is manufactured by Zontes, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 348 CC engine that produces N/A power, 31.25 Kmpl mileage and giving the most superior driving experience to its users. Zontes GK350 standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Zontes GK350 standard Price In India</strong></p> <p>Zontes GK350 standard Price in India starts from ₹ 3.89 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Zontes GK350 standard Bike. However, it is necessary to know that the on-road price of the GK350 standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Zontes GK350 standard Engine</strong></p><p>Zontes GK350 standard engine capacity is 348 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of GK350 standard is aligned with a N/A gear transmission.</p> <p><strong>Zontes GK350 standard Mileage</strong></p><p>Zontes GK350 standard mileage is 31.25 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Zontes GK350 standard Brakes &amp; Suspension</strong></p><p>Zontes GK350 standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the GK350 standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Zontes GK350 standard</strong></p><p>Zontes GK350 standard at BikeJunction is available with complete information. In addition you can easily get the Zontes GK350 standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Zontes GK350 standard Bike with your other top choices.</p>"
  },
  {
    "id": 1984,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/sp160-standard",
    "content": "<p>Honda SP160 standard Bike is one of India’s most reputed 2-wheelers. The SP160 standard Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 162.71 CC engine that produces N/A power, 45-50 Kmpl mileage and giving the most superior driving experience to its users. Honda SP160 standard Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda SP160 standard Price In India</strong></p> <p>Honda SP160 standard Price in India starts from ₹ 1.39 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Honda SP160 standard Bike. However, it is necessary to know that the on-road price of the SP160 standard Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda SP160 standard Engine</strong></p><p>Honda SP160 standard engine capacity is 162.71 CC and engineered with N/A engine. This engine generates N/A and N/A of Torque. The engine of SP160 standard is aligned with a N/A gear transmission.</p> <p><strong>Honda SP160 standard Mileage</strong></p><p>Honda SP160 standard mileage is 45-50 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of N/A litres. This combination gives this Bike a good driving range.</p><p><strong>Honda SP160 standard Brakes &amp; Suspension</strong></p><p>Honda SP160 standard comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the SP160 standard Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda SP160 standard</strong></p><p>Honda SP160 standard at BikeJunction is available with complete information. In addition you can easily get the Honda SP160 standard on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda SP160 standard Bike with your other top choices.</p>"
  },
  {
    "id": 1979,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/livo-drum-2023",
    "content": "<p>Honda Livo Drum [2023] Bike is one of India’s most reputed 2-wheelers. The Livo Drum [2023] Bike is manufactured by Honda, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 109.51 CC engine that produces 8.67 bhp @ 7500 rpm power, 60 Kmpl mileage and giving the most superior driving experience to its users. Honda Livo Drum [2023] Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Honda Livo Drum [2023] Price In India</strong></p> <p>Honda Livo Drum [2023] Price in India starts from ₹ 92,384. BikeJunction provides you a complete list of the updated and accurate price range of Honda Livo Drum [2023] Bike. However, it is necessary to know that the on-road price of the Livo Drum [2023] Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Livo Drum [2023] Engine</strong></p><p>Honda Livo Drum [2023] engine capacity is 109.51 CC and engineered with N/A engine. This engine generates 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm of Torque. The engine of Livo Drum [2023] is aligned with a 4 Speed gear transmission.</p> <p><strong>Honda Livo Drum [2023] Mileage</strong></p><p>Honda Livo Drum [2023] mileage is 60 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 9 L litres. This combination gives this Bike a good driving range.</p><p><strong>Honda Livo Drum [2023] Brakes &amp; Suspension</strong></p><p>Honda Livo Drum [2023] comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Livo Drum [2023] Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Honda Livo Drum [2023]</strong></p><p>Honda Livo Drum [2023] at BikeJunction is available with complete information. In addition you can easily get the Honda Livo Drum [2023] on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Livo Drum [2023] Bike with your other top choices.</p>"
  },
  {
    "id": 2002,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/bullet-350-next-gen-mid",
    "content": "<p>Royal Enfield Bullet 350 Next Gen Mid Bike is one of India’s most reputed 2-wheelers. The Bullet 350 Next Gen Mid Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 bhp @ 6100 rpm power, 40.8 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Bullet 350 Next Gen Mid Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p><p><strong>Royal Enfield Bullet 350 Next Gen Mid Price In India</strong></p> <p>Royal Enfield Bullet 350 Next Gen Mid Price in India starts from ₹ 1.97 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Royal Enfield Bullet 350 Next Gen Mid Bike. However, it is necessary to know that the on-road price of the Bullet 350 Next Gen Mid Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Royal Enfield Bullet 350 Next Gen Mid Engine</strong></p><p>Royal Enfield Bullet 350 Next Gen Mid engine capacity is 349 CC and engineered with N/A engine. This engine generates 20.2 bhp @ 6100 rpm and 27 Nm @ 4000 rpm of Torque. The engine of Bullet 350 Next Gen Mid is aligned with a 5 Speed gear transmission.</p> <p><strong>Royal Enfield Bullet 350 Next Gen Mid Mileage</strong></p><p>Royal Enfield Bullet 350 Next Gen Mid mileage is 40.8 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 13 litres litres. This combination gives this Bike a good driving range.</p><p><strong>Royal Enfield Bullet 350 Next Gen Mid Brakes &amp; Suspension</strong></p><p>Royal Enfield Bullet 350 Next Gen Mid comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Bullet 350 Next Gen Mid Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p><p><strong>Why BikeJunction is Best For Royal Enfield Bullet 350 Next Gen Mid</strong></p><p>Royal Enfield Bullet 350 Next Gen Mid at BikeJunction is available with complete information. In addition you can easily get the Royal Enfield Bullet 350 Next Gen Mid on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Royal Enfield Bullet 350 Next Gen Mid Bike with your other top choices.</p>"
  },
  {
    "id": 1983,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-2kwh",
    "content": "<p>The OLA S1 X 2kWh is a well known electric Scooter in the Electric vehicle sector of India. This S1 X 2kWh Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 X 2kWh enhance the overall performance.</p><p><strong>OLA S1 X 2kWh Price In India</strong></p><p>OLA S1 X 2kWh price in India starts from 97,336. The new model of this S1 X 2kWh electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 X 2kWh on the basis of its colours &amp; variants. The OLA S1 X 2kWh electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 X 2kWh Range</strong></p><p>OLA S1 X 2kWh is fitted with a 2 kWh and has a Lithium Ion type of battery. This battery pack generates 6000 W power and N/A of Torque. The battery of OLA S1 X 2kWh is aligned with a Automatic transmission.</p><p><strong>OLA S1 X 2kWh Brakes &amp; Suspension</strong></p><p>OLA S1 X 2kWh delivers a Range of 91 Km KM in single charge. The S1 X 2kWh comes with a Hub Motor of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 X 2kWh Electric Scooter</strong></p><p>OLA S1 X 2kWh at BikeJunction is available with complete information. In addition you can easily get the OLA S1 X 2kWh on-road price in India. You can easily compare OLA S1 X 2kWh Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1996,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-3kwh",
    "content": "<p>The OLA S1 X 3kWh is a well known electric Scooter in the Electric vehicle sector of India. This S1 X 3kWh Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 X 3kWh enhance the overall performance.</p><p><strong>OLA S1 X 3kWh Price In India</strong></p><p>OLA S1 X 3kWh price in India starts from 1.01 Lakh. The new model of this S1 X 3kWh electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 X 3kWh on the basis of its colours &amp; variants. The OLA S1 X 3kWh electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 X 3kWh Range</strong></p><p>OLA S1 X 3kWh is fitted with a 3 kWh and has a Lithium Ion type of battery. This battery pack generates 6000 W power and N/A of Torque. The battery of OLA S1 X 3kWh is aligned with a Automatic transmission.</p><p><strong>OLA S1 X 3kWh Brakes &amp; Suspension</strong></p><p>OLA S1 X 3kWh delivers a Range of 151 Km KM in single charge. The S1 X 3kWh comes with a N/A of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 X 3kWh Electric Scooter</strong></p><p>OLA S1 X 3kWh at BikeJunction is available with complete information. In addition you can easily get the OLA S1 X 3kWh on-road price in India. You can easily compare OLA S1 X 3kWh Scooter with the other Scooter of this segment.</p>"
  },
  {
    "id": 1978,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-plus",
    "content": "<p>The OLA S1 X Plus is a well known electric Scooter in the Electric vehicle sector of India. This S1 X Plus Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of OLA S1 X Plus enhance the overall performance.</p><p><strong>OLA S1 X Plus Price In India</strong></p><p>OLA S1 X Plus price in India starts from 1.11 Lakh. The new model of this S1 X Plus electric Scooter is available in 1 colours. In addition you can avail an updated price of OLA S1 X Plus on the basis of its colours &amp; variants. The OLA S1 X Plus electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p><p><strong>OLA S1 X Plus Range</strong></p><p>OLA S1 X Plus is fitted with a 3 kWh and has a Lithium Ion type of battery. This battery pack generates 6000 W power and 2700 W of Torque. The battery of OLA S1 X Plus is aligned with a Automatic transmission.</p><p><strong>OLA S1 X Plus Brakes &amp; Suspension</strong></p><p>OLA S1 X Plus delivers a Range of 151 Km KM in single charge. The S1 X Plus comes with a Hub Motor of Motor. This combination gives this Scooter a good driving range.</p><p><strong>Why BikeJunction is the Best Platform To Buy OLA S1 X Plus Electric Scooter</strong></p><p>OLA S1 X Plus at BikeJunction is available with complete information. In addition you can easily get the OLA S1 X Plus on-road price in India. You can easily compare OLA S1 X Plus Scooter with the other Scooter of this segment.</p>"
  }
]
