[
  {
    "id": 2001,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/lectrix/lxsg-30-standard/specifications",
    "specsContent": "<p>Lectrix LXSG 3.0 standard is powered by a N/A battery which takes N/A to fully charge. LXSG 3.0 standard has a range of N/A, letting you cover extra miles. With LXSG 3.0 standard you can get a top speed of N/A with the smoothest drive-off experience. Lectrix LXSG 3.0 standard price starts from ₹1.05 Lakh in India. Lectrix LXSG 3.0 standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Lectrix LXSG 3.0 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 2003,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-air-gen-2/specifications",
    "specsContent": "<p>OLA S1 Air Gen 2 is powered by a 3 kWh battery which takes N/A to fully charge. S1 Air Gen 2 has a range of N/A, letting you cover extra miles. With S1 Air Gen 2 you can get a top speed of N/A with the smoothest drive-off experience. OLA S1 Air Gen 2 price starts from ₹1.21 Lakh in India. OLA S1 Air Gen 2 specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about OLA S1 Air Gen 2 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1961,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/okaya/faast-f2t-standard/specifications",
    "specsContent": "<p>Okaya Faast F2T standard is powered by a N/A battery which takes N/A to fully charge. Faast F2T standard has a range of N/A, letting you cover extra miles. With Faast F2T standard you can get a top speed of N/A with the smoothest drive-off experience. Okaya Faast F2T standard price starts from ₹1.06 Lakh in India. Okaya Faast F2T standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Okaya Faast F2T standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1971,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/okinawa/ridge-100-standard/specifications",
    "specsContent": "<p>Okinawa Ridge 100 standard is powered by a N/A battery which takes N/A to fully charge. Ridge 100 standard has a range of N/A, letting you cover extra miles. With Ridge 100 standard you can get a top speed of N/A with the smoothest drive-off experience. Okinawa Ridge 100 standard price starts from ₹1.22 Lakh in India. Okinawa Ridge 100 standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Okinawa Ridge 100 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1965,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/350x-standard/specifications",
    "specsContent": "<p>Zontes 350X standard is powered by a 348 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Zontes 350X standard specifications and features include an advanced tech engine, offering a decent mileage of 35-40 Kmpl , enabling you to cover extra miles. Zontes 350X standard price is ₹3.87 Lakh in India. Zontes 350X standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Zontes 350X standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. 350X standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Zontes 350X standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1985,
    "url": "https://bikes.tractorjunction.com/en/tvs-bikes/rtr-310-805-standard/specifications",
    "specsContent": "<p>TVS Apache RTR 310 standard is powered by a 312.2 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. TVS Apache RTR 310 standard specifications and features include an advanced tech engine, offering a decent mileage of 35 Kmpl , enabling you to cover extra miles. TVS Apache RTR 310 standard price falls between ₹2.2 Lakh to ₹2.3 Lakh in India. TVS Apache RTR 310 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. TVS Apache RTR 310 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Apache RTR 310 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about TVS Apache RTR 310 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1974,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/battre/one-154-standard/specifications",
    "specsContent": "<p>BattRE ONE standard is powered by a N/A battery which takes N/A to fully charge. ONE standard has a range of N/A, letting you cover extra miles. With ONE standard you can get a top speed of N/A with the smoothest drive-off experience. BattRE ONE standard price falls between ₹73,900 to ₹1.08 Lakh in India. BattRE ONE standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about BattRE ONE standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1963,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ivoomi/s1-158-standard/specifications",
    "specsContent": "<p>iVOOMi S1 standard is powered by a N/A battery which takes N/A to fully charge. S1 standard has a range of N/A, letting you cover extra miles. With S1 standard you can get a top speed of N/A with the smoothest drive-off experience. iVOOMi S1 standard price starts from ₹69,999 in India. iVOOMi S1 standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about iVOOMi S1 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1987,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/kx112-standard/specifications",
    "specsContent": "<p>Kawasaki KX112 standard is powered by a 112 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Kawasaki KX112 standard specifications and features include an advanced tech engine, offering a decent mileage of 24 Kmpl , enabling you to cover extra miles. Kawasaki KX112 standard price is ₹4.88 Lakh in India. Kawasaki KX112 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Kawasaki KX112 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. KX112 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Kawasaki KX112 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1989,
    "url": "https://bikes.tractorjunction.com/en/hero-scooters/destini-prime-standard/specifications",
    "specsContent": "<p>Hero Destini Prime standard is powered by a 124.6 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Hero Destini Prime standard specifications and features include an advanced tech engine, offering a decent mileage of 45 Kmpl , enabling you to cover extra miles. Hero Destini Prime standard price is ₹84,689 in India. Hero Destini Prime standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Hero Destini Prime standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. Destini Prime standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Hero Destini Prime standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1998,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/bullet-350-next-gen-top/specifications",
    "specsContent": "<p>Royal Enfield Bullet 350 Next Gen Top is powered by a 349 CC N/A engine. The powerful engine produces 20.2 bhp @ 6100 rpm and 27 Nm @ 4000 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Bullet 350 Next Gen Top specifications and features include an advanced tech engine, offering a decent mileage of 40.8 Kmpl , enabling you to cover extra miles. Royal Enfield Bullet 350 Next Gen Top price is ₹2.16 Lakh in India. Royal Enfield Bullet 350 Next Gen Top BS6 specifications include a total fuel tank capacity of 13 litres, letting you cover longer distances without worrying about refuelling. Royal Enfield Bullet 350 Next Gen Top comes equipped with Disc brakes and has a tyre size- 100/90 - 19 Front , 120/80 - 18 Rear, giving maximum stability to the user. Bullet 350 Next Gen Top engine is aligned with the Wet Multiplate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Bullet 350 Next Gen Top technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1964,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/kx65-standard/specifications",
    "specsContent": "<p>Kawasaki KX65 standard is powered by a 64 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Kawasaki KX65 standard specifications and features include an advanced tech engine, offering a decent mileage of 30 Kmpl , enabling you to cover extra miles. Kawasaki KX65 standard price is ₹3.12 Lakh in India. Kawasaki KX65 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Kawasaki KX65 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. KX65 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Kawasaki KX65 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1999,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/enigma/cafe-racer-standard/specifications",
    "specsContent": "<p>Enigma Cafe Racer standard is powered by a N/A battery which takes N/A to fully charge. Cafe Racer standard has a range of N/A, letting you cover extra miles. With Cafe Racer standard you can get a top speed of N/A with the smoothest drive-off experience. Enigma Cafe Racer standard price falls between ₹80,000 to ₹1.2 Lakh in India. Enigma Cafe Racer standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Enigma Cafe Racer standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1994,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-pro-gen-2/specifications",
    "specsContent": "<p>OLA S1 Pro Gen 2 is powered by a 4 kWh battery which takes N/A to fully charge. S1 Pro Gen 2 has a range of N/A, letting you cover extra miles. With S1 Pro Gen 2 you can get a top speed of N/A with the smoothest drive-off experience. OLA S1 Pro Gen 2 price starts from ₹1.62 Lakh in India. OLA S1 Pro Gen 2 specifications include CBS brakes and has a tyre size - Front : 110/70 - R12, Rear : 110/70 - R12, giving maximum stability to the user. To know in detail about OLA S1 Pro Gen 2 technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1968,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/350t-standard/specifications",
    "specsContent": "<p>Zontes 350T standard is powered by a 348 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Zontes 350T standard specifications and features include an advanced tech engine, offering a decent mileage of 35-40 Kmpl , enabling you to cover extra miles. Zontes 350T standard price is ₹3.89 Lakh in India. Zontes 350T standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Zontes 350T standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. 350T standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Zontes 350T standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1992,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/godawari/eblu-feo-standard/specifications",
    "specsContent": "<p>Godawari Eblu Feo standard is powered by a N/A battery which takes N/A to fully charge. Eblu Feo standard has a range of N/A, letting you cover extra miles. With Eblu Feo standard you can get a top speed of N/A with the smoothest drive-off experience. Godawari Eblu Feo standard price starts from ₹99,999 in India. Godawari Eblu Feo standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Godawari Eblu Feo standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1980,
    "url": "https://bikes.tractorjunction.com/en/electric-bikes/enigma/heavy-one-loader-standard/specifications",
    "specsContent": "<p>Enigma Heavy One Loader standard is powered by a N/A battery which takes N/A to fully charge. Heavy One Loader standard has a range of N/A, letting you cover extra miles. With Heavy One Loader standard you can get a top speed of N/A with the smoothest drive-off experience. Enigma Heavy One Loader standard price starts from ₹75,000 in India. Enigma Heavy One Loader standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about Enigma Heavy One Loader standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 2005,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ivoomi/jeet-x-standard/specifications",
    "specsContent": "<p>iVOOMi Jeet X standard is powered by a N/A battery which takes N/A to fully charge. Jeet X standard has a range of N/A, letting you cover extra miles. With Jeet X standard you can get a top speed of N/A with the smoothest drive-off experience. iVOOMi Jeet X standard price starts from ₹99,999 in India. iVOOMi Jeet X standard specifications include N/A brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about iVOOMi Jeet X standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 2000,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/livo-disc-2023/specifications",
    "specsContent": "<p>Honda Livo Disc [2023] is powered by a 109.51 CC N/A engine. The powerful engine produces 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Honda Livo Disc [2023] specifications and features include an advanced tech engine, offering a decent mileage of 60 Kmpl , enabling you to cover extra miles. Honda Livo Disc [2023] price is ₹96,781 in India. Honda Livo Disc [2023] BS6 specifications include a total fuel tank capacity of 9 L, letting you cover longer distances without worrying about refuelling. Honda Livo Disc [2023] comes equipped with Disc brakes and has a tyre size- Front : 80/100 - 18, Rear : 80/100 - 18, giving maximum stability to the user. Livo Disc [2023] engine is aligned with the Wet Multiplate clutch, 4 Speed gearbox and Manual transmission. To know in detail about Honda Livo Disc [2023] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1972,
    "url": "https://bikes.tractorjunction.com/en/kawasaki-bikes/klx230r-s-standard/specifications",
    "specsContent": "<p>Kawasaki KLX230R S standard is powered by a 233 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Kawasaki KLX230R S standard specifications and features include an advanced tech engine, offering a decent mileage of 40-50 Kmpl , enabling you to cover extra miles. Kawasaki KLX230R S standard price is ₹5.21 Lakh in India. Kawasaki KLX230R S standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Kawasaki KLX230R S standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. KLX230R S standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Kawasaki KLX230R S standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1995,
    "url": "https://bikes.tractorjunction.com/en/zontes-bikes/gk350-standard/specifications",
    "specsContent": "<p>Zontes GK350 standard is powered by a 348 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Zontes GK350 standard specifications and features include an advanced tech engine, offering a decent mileage of 31.25 Kmpl , enabling you to cover extra miles. Zontes GK350 standard price is ₹3.89 Lakh in India. Zontes GK350 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Zontes GK350 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. GK350 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Zontes GK350 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1984,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/sp160-standard/specifications",
    "specsContent": "<p>Honda SP160 standard is powered by a 162.71 CC N/A engine. The powerful engine produces N/A and N/A, ensuring the user gets the smoothest drive-off experience. Honda SP160 standard specifications and features include an advanced tech engine, offering a decent mileage of 45-50 Kmpl , enabling you to cover extra miles. Honda SP160 standard price is ₹1.39 Lakh in India. Honda SP160 standard BS6 specifications include a total fuel tank capacity of N/A, letting you cover longer distances without worrying about refuelling. Honda SP160 standard comes equipped with N/A brakes and has a tyre size- N/A, giving maximum stability to the user. SP160 standard engine is aligned with the N/A clutch, N/A gearbox and N/A transmission. To know in detail about Honda SP160 standard technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1979,
    "url": "https://bikes.tractorjunction.com/en/honda-bikes/livo-drum-2023/specifications",
    "specsContent": "<p>Honda Livo Drum [2023] is powered by a 109.51 CC N/A engine. The powerful engine produces 8.67 bhp @ 7500 rpm and 9.30 Nm @ 5500 rpm, ensuring the user gets the smoothest drive-off experience. Honda Livo Drum [2023] specifications and features include an advanced tech engine, offering a decent mileage of 60 Kmpl , enabling you to cover extra miles. Honda Livo Drum [2023] price is ₹92,384 in India. Honda Livo Drum [2023] BS6 specifications include a total fuel tank capacity of 9 L, letting you cover longer distances without worrying about refuelling. Honda Livo Drum [2023] comes equipped with Drum brakes and has a tyre size- Front : 80/100 - 18, Rear : 80/100 - 18, giving maximum stability to the user. Livo Drum [2023] engine is aligned with the Wet Multiplate clutch, 4 Speed gearbox and Manual transmission. To know in detail about Honda Livo Drum [2023] technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 2002,
    "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/bullet-350-next-gen-mid/specifications",
    "specsContent": "<p>Royal Enfield Bullet 350 Next Gen Mid is powered by a 349 CC N/A engine. The powerful engine produces 20.2 bhp @ 6100 rpm and 27 Nm @ 4000 rpm, ensuring the user gets the smoothest drive-off experience. Royal Enfield Bullet 350 Next Gen Mid specifications and features include an advanced tech engine, offering a decent mileage of 40.8 Kmpl , enabling you to cover extra miles. Royal Enfield Bullet 350 Next Gen Mid price is ₹1.97 Lakh in India. Royal Enfield Bullet 350 Next Gen Mid BS6 specifications include a total fuel tank capacity of 13 litres, letting you cover longer distances without worrying about refuelling. Royal Enfield Bullet 350 Next Gen Mid comes equipped with Disc brakes and has a tyre size- 100/90 - 19 Front , 120/80 - 18 Rear, giving maximum stability to the user. Bullet 350 Next Gen Mid engine is aligned with the Wet Multiplate clutch, 5 Speed gearbox and Manual transmission. To know in detail about Royal Enfield Bullet 350 Next Gen Mid technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1983,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-2kwh/specifications",
    "specsContent": "<p>OLA S1 X 2kWh is powered by a 2 kWh battery which takes N/A to fully charge. S1 X 2kWh has a range of N/A, letting you cover extra miles. With S1 X 2kWh you can get a top speed of N/A with the smoothest drive-off experience. OLA S1 X 2kWh price starts from ₹97,336 in India. OLA S1 X 2kWh specifications include CBS brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about OLA S1 X 2kWh technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1996,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-3kwh/specifications",
    "specsContent": "<p>OLA S1 X 3kWh is powered by a 3 kWh battery which takes N/A to fully charge. S1 X 3kWh has a range of N/A, letting you cover extra miles. With S1 X 3kWh you can get a top speed of N/A with the smoothest drive-off experience. OLA S1 X 3kWh price starts from ₹1.01 Lakh in India. OLA S1 X 3kWh specifications include CBS brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about OLA S1 X 3kWh technical specifications, price &amp; more, get in touch with us.</p>"
  },
  {
    "id": 1978,
    "url": "https://bikes.tractorjunction.com/en/electric-scooters/ola/s1-x-plus/specifications",
    "specsContent": "<p>OLA S1 X Plus is powered by a 3 kWh battery which takes N/A to fully charge. S1 X Plus has a range of N/A, letting you cover extra miles. With S1 X Plus you can get a top speed of N/A with the smoothest drive-off experience. OLA S1 X Plus price starts from ₹1.11 Lakh in India. OLA S1 X Plus specifications include CBS brakes and has a tyre size - N/A, giving maximum stability to the user. To know in detail about OLA S1 X Plus technical specifications, price &amp; more, get in touch with us.</p>"
  }
]
