{
  "id": 1342,
  "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
  "content": "\n<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p>\n<p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p>\n<p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p>\n<p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p>\n<p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>\n"
}{
  "id": 1970,
  "url": "https://bikes.tractorjunction.com/en/honda-scooters/dio-125",
  "content": "\n<p>Honda Dio 125 Scooter is one of India’s most reputed 2-wheelers. The Dio 125 Scooter is manufactured by Honda, popularly known for their technologically advanced manufacturing value. Honda Dio 125 Scooter belongs to the Scooter category. The Scooter boasts high-tech specifications like 123.92 CC engine that produces 6.09 kW @ 6250 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. Honda Dio 125 Scooter is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Honda Dio 125 Price In India</strong></p> <p>Honda Dio 125 Price in India starts from ₹ 83,400 and goes up to ₹ 91,300. BikeJunction provides you a complete list of the updated and accurate price range of Honda Dio 125 Scooter. However, it is necessary to know that the on-road price of the Dio 125 Scooter may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Honda Dio 125 Engine</strong></p>\n<p>Honda Dio 125 engine capacity is 123.92 CC and engineered with 4 Stroke, SI Engine engine. This engine generates 6.09 kW @ 6250 rpm and 10.4 N-m@5000 rpm of Torque. The engine of Dio 125 is aligned with the Dry Type clutch.</p><p> </p><p><strong>Honda Dio 125 Mileage</strong></p>\n<p>Honda Dio 125 mileage is 50 Kmpl which is very adequate. The Scooter comes with a fuel tank capacity of 5.3 litres. This combination gives this Scooter a good driving range.</p>\n<p><strong>Honda Dio 125 Brakes &amp; Suspension</strong></p>\n<p>Honda Dio 125 comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Dio 125 Scooter is also very impressive that ensures smoother drive experience while enabling the Scooter to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Honda Dio 125</strong></p>\n<p>Honda Dio 125 at BikeJunction is available with complete information. In addition you can easily get the Honda Dio 125 on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Honda Dio 125 Scooter with your other top choices.</p>\n"
}{
  "id": 1668,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/evolet/hawk",
  "content": "\n<p>The Evolet Hawk is a well known electric Bike in the Electric vehicle sector of India. This Hawk Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Evolet Hawk enhance the overall performance.</p>\n<p><strong>Evolet Hawk Price In India</strong>\n</p><p>Evolet Hawk price in India includes all 1 variants starts from ₹1.25 Lakh and goes upto ₹1.5 Lakh. The new model of this Hawk electric Bike is available in :colours_count colours. In addition you can avail an updated price of Evolet Hawk on the basis of its colours &amp; variants. The Evolet Hawk electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Evolet Hawk Range</strong>\n</p><p>Evolet Hawk is fitted with a 72 V 40 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Evolet Hawk is aligned with a Automatic transmission.</p>\n<p><strong>Evolet Hawk Brakes &amp; Suspension</strong>\n</p><p>Evolet Hawk delivers a Range of 100 KM in single charge. The Hawk comes with a BLDC Hub motor of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Evolet Hawk Electric Bike</strong>\n</p><p>Evolet Hawk at BikeJunction is available with complete information. In addition you can easily get the Evolet Hawk on-road price in India. You can easily compare Evolet Hawk Bike with the other Bike of this segment.</p>\n"
}{
  "id": 1587,
  "url": "https://bikes.tractorjunction.com/en/electric-bikes/dynam/flash",
  "content": "\n<p>The dynam Flash is a well known electric Bike in the Electric vehicle sector of India. This Flash Bike is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of dynam Flash enhance the overall performance.</p>\n<p><strong>dynam Flash Price In India</strong>\n</p><p>dynam Flash price in India includes all 1 variants starts from ₹1 Lakh and goes upto ₹1.5 Lakh. The new model of this Flash electric Bike is available in :colours_count colours. In addition you can avail an updated price of dynam Flash on the basis of its colours &amp; variants. The dynam Flash electric Bike on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>dynam Flash Range</strong>\n</p><p>dynam Flash is fitted with a 72 V and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of dynam Flash is aligned with a Automatic transmission.</p>\n<p><strong>dynam Flash Brakes &amp; Suspension</strong>\n</p><p>dynam Flash delivers a Range of 125 KM in single charge. The Flash comes with a N/A of Motor. This combination gives this Bike a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy dynam Flash Electric Bike</strong>\n</p><p>dynam Flash at BikeJunction is available with complete information. In addition you can easily get the dynam Flash on-road price in India. You can easily compare dynam Flash Bike with the other Bike of this segment.</p>\n"
}{
  "id": 1567,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/gogoro/supersport",
  "content": "\n<p>The gogoro Supersport is a well known electric Scooter in the Electric vehicle sector of India. This Supersport Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of gogoro Supersport enhance the overall performance.</p>\n<p><strong>gogoro Supersport Price In India</strong>\n</p><p>gogoro Supersport price in India starts from 2.97 Lakh. The new model of this Supersport electric Scooter is available in 1 colours. In addition you can avail an updated price of gogoro Supersport on the basis of its colours &amp; variants. The gogoro Supersport electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>gogoro Supersport Range</strong>\n</p><p>gogoro Supersport is fitted with a 3.45 kwh and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of gogoro Supersport is aligned with a Automatic transmission.</p>\n<p><strong>gogoro Supersport Brakes &amp; Suspension</strong>\n</p><p>gogoro Supersport delivers a Range of N/A KM in single charge. The Supersport comes with a Liquid Cooled, permanent magnet psynchronous of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy gogoro Supersport Electric Scooter</strong>\n</p><p>gogoro Supersport at BikeJunction is available with complete information. In addition you can easily get the gogoro Supersport on-road price in India. You can easily compare gogoro Supersport Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 816,
  "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160",
  "content": "\n<p>TVS Apache RTR 160 Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 15.31 bhp @ 8,400 rpm power, 50 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 is among the top street bikes in India. It has many significant features and comes with a price tag of <strong>Rs 1.14 - 1.25 Lakh</strong>. It boasts a sporty design, a powerful engine, and a range of features that make it a versatile and fun ride. The bike is available in <strong>5 variants </strong>and <strong>5 colours</strong>. Furthermore, with this bike you can easily achieve a mileage of <strong>50 kmpl </strong>and a top speed of <strong>107 Kmph</strong>.</p>\n<p style=\"text-align:justify\">The bike is powered by a <strong>159.7 cc BS6 </strong>engine that delivers <strong>15.31 bhp</strong> power and <strong>13.9 Nm</strong> peak torque. The engine is equipped with <strong>Race Tuned Fuel Injection (RT-Fi)</strong> technology that improves power delivery, fuel economy, engine durability, and emission control. The engine is tuned to a <strong>5-speed super-slick gearbox</strong> that offers precise and smooth shifting.</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Engine Specifications</strong></p>\n<p style=\"text-align:justify\">TVS Apache RTR 160 is powered by a<strong> fuel-injected 159.7 cc single-cylinder 2-valve SOHC air-cooled engine</strong>. It produces<strong> 15.31 bhp</strong> of power at <strong>8,400 rpm</strong> and <strong>13.9 Nm </strong>of peak torque at <strong>7,000 rpm</strong>. It is paired with a <strong>5-speed gearbox</strong> that offers a smooth and precise shifting experience. It also gets '<strong>Glide Through Technology</strong>', which maximise revs at low-throttle openings and prevents the engine from stalling.</p>\n<p style=\"text-align:justify\">The engine has <strong>Race Tuned Fuel Injection (RT-Fi) technology</strong> that enhances power delivery, fuel economy, engine durability, and emission control. The engine also features <strong>Race Derived O3C technology</strong> that improves cooling efficiency and performance.</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Price In India</strong></p>\n<p style=\"text-align:justify\">TVS Apache RTR 160 comes with a price starting at <strong>Rs 1.14 lakhs</strong> and goes up to <strong>Rs 1.25 lakhs</strong>.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">TVS Apache RTR 160</td>\n<td style=\"text-align:justify\">Rs 1.14 - 1.25 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Mileage</strong></p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 has an ARAI-certified mileage of <strong>50 kmpl.</strong> However, the mileage may vary depending on riding style, road conditions, traffic, maintenance, and fuel quality.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">TVS Apache RTR 160</td>\n<td style=\"text-align:justify\">50 kmpl</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Technical Specifications</strong></p>\n<p style=\"text-align:justify\">Here are some of the key technical specifications of the TVS Apache RTR 160:</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Frame</strong></td>\n<td style=\"text-align:justify\">Double Cradle Synchro Stiff</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Transmission</strong></td>\n<td style=\"text-align:justify\">5-Speed Manual</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Brakes</strong></td>\n<td style=\"text-align:justify\">Front disc/rear drum or disc (single-channel or dual-channel ABS)</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Suspensions</strong></td>\n<td style=\"text-align:justify\">Telescopic Front forks/twin rear springs</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Tyres</strong></td>\n<td style=\"text-align:justify\">90/90-17 tubeless/rear - 110/80-17 tubeless&nbsp;</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Wheels</strong></td>\n<td style=\"text-align:justify\">17-inch Alloy Wheels</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Kerb Weight</strong></td>\n<td style=\"text-align:justify\">139 kg</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Fuel Tank Capacity</strong></td>\n<td style=\"text-align:justify\">12 Litres</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Seat Height</strong></td>\n<td style=\"text-align:justify\">790 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Wheelbase</strong></td>\n<td style=\"text-align:justify\">1300 mm</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Additional Features</strong></p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 has additional features that enhance its appeal and functionality. These features are-&nbsp;</p>\n<ul>\n<li style=\"text-align: justify;\"><strong><strong>3 Ride Modes - </strong></strong>The bike gets three ride modes – Urban, Rain, and Sport – that adjust the ABS and engine performance according to different riding conditions.</li>\n<li style=\"text-align: justify;\"><strong><strong>SmartXonnect</strong> - </strong>SmartXonnect technology connects the bike with your smartphone via Bluetooth. It displays information such as speedometer, odometer, trip metre, gear indicator, fuel level, service reminder, navigation assist, etc.</li>\n<li style=\"text-align: justify;\"><strong><strong>Voice Assist</strong> -</strong> The SmartXonnect feature also comes with a voice assist function that lets you control various functions such as music playback, phone calls, ride modes etc.</li>\n<li style=\"text-align: justify;\"><strong><strong>Racing Double-Barrel Exhaust</strong> - </strong>The bike gets a double-barrel exhaust system that enhances the exhaust note and improves the engine performance by expelling gases faster.</li>\n<li style=\"text-align: justify;\"><strong><strong>Gear-shift Indicator</strong> - </strong>The bike gets a gear indicator on the instrument cluster that shows you which gear you are in for optimum performance.</li>\n<li style=\"text-align: justify;\"><strong><strong>Adjustable Levers</strong> - </strong>3-step adjustable brake and clutch levers feature CAM adjusters to keep you comfortable. In addition, the levers can be easily adjusted without any additional tools.</li>\n</ul>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Variants</strong></p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 is offered in 5 variants for you to choose from. Here are the ex-showroom pricing of each model -&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants Models</strong></td>\n<td style=\"text-align:justify\"><strong>Ex-showroom price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Apache RTR 160 Disc (2022)</td>\n<td style=\"text-align:justify\">Rs 1.22 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Apache RTR 160 Drum (2022)</td>\n<td style=\"text-align:justify\">Rs 1.18 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Apache RTR 160 Disc Bluetooth</td>\n<td style=\"text-align:justify\">Rs 1.25 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Apache RTR 160 Rear Disc - ABS - BS VI</td>\n<td style=\"text-align:justify\">Rs 1.17 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Apache RTR 160 Front Disc - ABS - BS VI</td>\n<td style=\"text-align:justify\">RS 1.14 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 variants are available in five colour options, including Gloss Black, Pearl White, Racing Red, Matte Blue, and T-Grey.&nbsp;</p>\n<p style=\"text-align:justify\"><strong>TVS Apache RTR 160 Competitors in the Market</strong></p>\n<p style=\"text-align:justify\">The TVS Apache RTR 160 faces competition from other street bikes in its segment, such as-</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Rivals</strong></td>\n<td style=\"text-align:justify\"><strong>Ex-Showroom Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Bajaj Pulsar NS160</td>\n<td style=\"text-align:justify\">Rs 1.25 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Hero Xtreme 160R</td>\n<td style=\"text-align:justify\">Rs 1.18 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Honda X-Blade</td>\n<td style=\"text-align:justify\">Rs 1.21 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Suzuki Gixxer</td>\n<td style=\"text-align:justify\">Rs 1.34 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<p style=\"text-align:justify\"><strong>Why BikeJunction for TVS Apache RTR 160?</strong></p>\n<p style=\"text-align:justify\">Are you looking for the best online platform to get all the information on TVS Apache RTR 160? Look no further than Bike Junction. We have done extensive research on this bike and its variants to provide you with the most reliable and comprehensive information. You can find fuel efficiency, engine performance, tank capacity and more on our website.&nbsp;</p>\n<p style=\"text-align:justify\">Furthermore, you can also compare different models of TVS Apache RTR 160 with our handy bike comparison tool. It's quick and easy to see how they differ in features and prices with just a few clicks. So don't wait any longer; compare, choose and buy your TVS Apache RTR 160 with BikeJunction!</p>\n"
}{
  "id": 1872,
  "url": "https://bikes.tractorjunction.com/en/harley-davidson-bikes/heritage-classic",
  "content": "\n<p>Harley Davidson Heritage Classic Bike is one of India’s most reputed 2-wheelers. The Heritage Classic Bike is manufactured by Harley Davidson, popularly known for their technologically advanced manufacturing value. Harley Davidson Heritage Classic Bike belongs to the Bike category. The Bike boasts high-tech specifications like 1868 CC engine that produces N/A power, 18.1 Kmpl mileage and giving the most superior driving experience to its users. Harley Davidson Heritage Classic Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Harley Davidson Heritage Classic Price In India</strong></p> <p>Harley Davidson Heritage Classic Price in India starts from ₹ 23.49 Lakh and goes up to ₹ 26.59 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of Harley Davidson Heritage Classic Bike. However, it is necessary to know that the on-road price of the Heritage Classic Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Harley Davidson Heritage Classic Engine</strong></p>\n<p>Harley Davidson Heritage Classic engine capacity is 1868 CC and engineered with Milwaukee-Eight™ 114 engine. This engine generates N/A and 155 Nm @ 3250 rpm of Torque. The engine of Heritage Classic is aligned with a 6 Speed gear transmission.</p> <p><strong>Harley Davidson Heritage Classic Mileage</strong></p>\n<p>Harley Davidson Heritage Classic mileage is 18.1 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 18.9 l litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Harley Davidson Heritage Classic Brakes &amp; Suspension</strong></p>\n<p>Harley Davidson Heritage Classic comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Heritage Classic Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Harley Davidson Heritage Classic</strong></p>\n<p>Harley Davidson Heritage Classic at BikeJunction is available with complete information. In addition you can easily get the Harley Davidson Heritage Classic on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Harley Davidson Heritage Classic Bike with your other top choices.</p>\n"
}{
  "id": 1886,
  "url": "https://bikes.tractorjunction.com/en/hero-bikes/super-splendor-xtec",
  "content": "\n<p>Hero Super Splendor Xtec Bike is one of India’s most reputed 2-wheelers. The Super Splendor Xtec Bike is manufactured by Hero, popularly known for their technologically advanced manufacturing value. Hero Super Splendor Xtec Bike belongs to the Bike category. The Bike boasts high-tech specifications like 124.7 CC engine that produces 10.7 BHP @ 7500 rpm power, 70 Kmpl mileage and giving the most superior driving experience to its users. Hero Super Splendor Xtec Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>Hero Super Splendor Xtec Price In India</strong></p> <p>Hero Super Splendor Xtec Price in India starts from ₹ 82,618 and goes up to ₹ 87,218. BikeJunction provides you a complete list of the updated and accurate price range of Hero Super Splendor Xtec Bike. However, it is necessary to know that the on-road price of the Super Splendor Xtec Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>Hero Super Splendor Xtec Engine</strong></p>\n<p>Hero Super Splendor Xtec engine capacity is 124.7 CC and engineered with Air Cooled,4-Stroke, Single cyllinder, OHC engine. This engine generates 10.7 BHP @ 7500 rpm and 10.6 Nm @ 6000 rpm of Torque. The engine of Super Splendor Xtec is aligned with a 5 Speed gear transmission.</p> <p><strong>Hero Super Splendor Xtec Mileage</strong></p>\n<p>Hero Super Splendor Xtec mileage is 70 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>Hero Super Splendor Xtec Brakes &amp; Suspension</strong></p>\n<p>Hero Super Splendor Xtec comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Super Splendor Xtec Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For Hero Super Splendor Xtec</strong></p>\n<p>Hero Super Splendor Xtec at BikeJunction is available with complete information. In addition you can easily get the Hero Super Splendor Xtec on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the Hero Super Splendor Xtec Bike with your other top choices.</p>\n"
}{
  "id": 1126,
  "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-200-4v",
  "content": "\n<p>TVS Apache RTR 200 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 200 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 200 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 197.75 CC engine that produces 20.54 bhp @ 8500 rpm power, 38.5 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 200 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>TVS Apache RTR 200 4V Price In India</strong></p> <p>TVS Apache RTR 200 4V Price in India starts from ₹ 1.4 Lakh and goes up to ₹ 1.46 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 200 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 200 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 200 4V Engine</strong></p>\n<p>TVS Apache RTR 200 4V engine capacity is 197.75 CC and engineered with Single-cylinder, 4-stroke, 4-valve, oil-cooled engine engine. This engine generates 20.54 bhp @ 8500 rpm and 16.8 Nm @ 7500 rpm of Torque. The engine of Apache RTR 200 4V is aligned with a 5 Speed gear transmission.</p> <p><strong>TVS Apache RTR 200 4V Mileage</strong></p>\n<p>TVS Apache RTR 200 4V mileage is 38.5 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>TVS Apache RTR 200 4V Brakes &amp; Suspension</strong></p>\n<p>TVS Apache RTR 200 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 200 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For TVS Apache RTR 200 4V</strong></p>\n<p>TVS Apache RTR 200 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 200 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 200 4V Bike with your other top choices.</p>\n"
}{
  "id": 1051,
  "url": "https://bikes.tractorjunction.com/en/royal-enfield-bikes/classic-350",
  "content": "\n<p>Royal Enfield Classic 350 Bike is one of India’s most reputed 2-wheelers. The Classic 350 Bike is manufactured by Royal Enfield, popularly known for their technologically advanced manufacturing value. Royal Enfield Classic 350 Bike belongs to the Bike category. The Bike boasts high-tech specifications like 349 CC engine that produces 20.2 BHP @ 6100 rpm (14.87 kW) power, 41.55 Kmpl mileage and giving the most superior driving experience to its users. Royal Enfield Classic 350 Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p style=\"text-align:justify\">Royal Enfield Classic 350 is a popular cruiser motorcycle that <strong>combines retro styling with modern features</strong>. This <strong>cruiser bike</strong> is powered by a <strong>346cc air-cooled, single-cylinder engine</strong> that produces <strong>19.1 bhp </strong>and <strong>28 Nm of torque</strong>. The engine is paired with a<strong> 5-speed transmission</strong>, and the bike has a <strong>top speed of around 130 kmph</strong>. This classic 350 can reach a <strong>mileage of 41.55 Kmpl</strong> and boasts a teardrop-shaped fuel tank with a total capacity of<strong> 13 litres.</strong>&nbsp;</p>\n<p style=\"text-align:justify\">The Royal Enfield Classic 350 BS6 price range is <strong>Rs 1.9 - 2.21 Lakh</strong> in India. The brand offers this model along with <strong>6 variants</strong> and <strong>15 various colour</strong> <strong>options </strong>for users to choose from.&nbsp;</p>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Engine Specifications</strong></h2>\n<p style=\"text-align:justify\">Royal Enfield 350 classic is fitted with a <strong>349 cc, Air/Oil Cooled 1 Cylinder 2 Valve engine</strong>, which is <strong>BS6-compliant</strong>. This exceptionally performing engine can produce a maximum power output of <strong>20.2 bhp @ 6,100 rpm </strong>and a peak torque of <strong>27 Nm @ 4,000 rpm</strong>. This engine comes mated to a<strong> 5-speed gearbox</strong> transmission system.&nbsp;</p>\n<p style=\"text-align:justify\">In addition, you also get a <strong>Fuel Injection supply</strong> system that drastically improves the bike's fuel economy. The power output of Classic 350 makes it a suitable option for city riding and leisurely cruising on the highways.&nbsp;</p>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Price In India</strong></h2>\n<p style=\"text-align:justify\">Royal Enfield Classic 350 price in India has helped secure it an eminent place in the Indian 2-wheeler market. The brand has given the bike a price tag of<strong> Rs 1.9 - 2.21 Lakh</strong>, which is decent given all the features it is built with.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Royal Enfield Classic 350&nbsp;</td>\n<td style=\"text-align:justify\">Rs 1.9 - 2.21 Lakh</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><br>\n<strong>Royal Enfield Classic 350 Mileage</strong></h2>\n<p style=\"text-align:justify\">The new Royal Enfield Classic 350 is known for its fuel efficiency while delivering unmatched performance. With this cruiser bike, you can cover over <strong>41.55 Km per litre of fuel</strong>, making it a highly pocket-friendly option for those looking to cut down on their daily fuel expenses.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Model Name</strong></td>\n<td style=\"text-align:justify\"><strong>Mileage</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Royal Enfield Classic 350</td>\n<td style=\"text-align:justify\">41.55 Kmpl</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Technical Specifications</strong></h2>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\"><strong>Suspension:</strong></td>\n<td style=\"text-align:center\"><strong>Front Suspension:</strong></td>\n<td style=\"text-align:center\">Telescopic, 41mm forks, 130mm trave</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Suspension:</strong></td>\n<td style=\"text-align:center\">Twin tube emulsion shock absorbers with 6-step adjustable preload, 80mm travel</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"3\"><strong><strong>Brakes:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Front Brake:</strong></td>\n<td style=\"text-align:center\">300 mm disc, 2-piston calliper</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Brake: </strong></td>\n<td style=\"text-align:center\">270 mm disc, single-piston calliper</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>ABS: </strong></td>\n<td style=\"text-align:center\">Single &amp; Dual-channel ABS</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"3\"><strong><strong>Tyres:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Front Tyre:</strong></td>\n<td style=\"text-align:center\">90/90 - 19, 52P, Tubeless</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Rear Tyre: </strong></td>\n<td style=\"text-align:center\">110/90 - 18, 61P, Tubeless</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Wheels</strong></td>\n<td style=\"text-align:center\">Spoke/Alloy wheels</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"7\"><strong><strong>Dimensions:</strong></strong></td>\n<td style=\"text-align:center\"><strong>Length:</strong></td>\n<td style=\"text-align:center\">2,145 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Width:</strong></td>\n<td style=\"text-align:center\">785 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Height:</strong></td>\n<td style=\"text-align:center\">1,090 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Wheelbase:</strong></td>\n<td style=\"text-align:center\">1,390mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Ground Clearance:</strong></td>\n<td style=\"text-align:center\">170 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Seat Height:</strong></td>\n<td style=\"text-align:center\">805 mm</td>\n</tr>\n<tr>\n<td style=\"text-align:center\"><strong>Kerb Weight:</strong></td>\n<td style=\"text-align:center\">195kg</td>\n</tr>\n</tbody>\n</table>\n<h2 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Additional Features</strong></h2>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 is among the most well-loved retro-styled motorcycle with a host of features, which include:</strong></h3>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td><strong>Dual-channel ABS</strong>:</td>\n<td>Provides additional safety by preventing the wheels from locking up during sudden braking.</td>\n</tr>\n<tr>\n<td><strong>LED headlamp</strong>:</td>\n<td>Offers better visibility in low-light conditions and consumes less power than a conventional halogen headlamp.</td>\n</tr>\n<tr>\n<td><strong>Digital instrument cluster</strong>:</td>\n<td>Displays information such as speed, odometer, fuel gauge, and more.</td>\n</tr>\n<tr>\n<td><strong>Tubeless tyres</strong>:</td>\n<td>Offer improved puncture resistance and are easier to repair in case of a flat tire.</td>\n</tr>\n<tr>\n<td><strong>Electric start</strong>:</td>\n<td>Makes it easier &amp; quicker to start the bike, especially in cold weather conditions.</td>\n</tr>\n<tr>\n<td><strong>Disc brakes</strong>:</td>\n<td>Provides superior stopping power &amp; better control over the bike.</td>\n</tr>\n<tr>\n<td><strong>Fuel injection system</strong>:</td>\n<td>Delivers precise fueling and improves fuel efficiency.</td>\n</tr>\n<tr>\n<td><strong>Split seats</strong>:</td>\n<td>Offers added comfort to the rider &amp; the pillion.</td>\n</tr>\n<tr>\n<td><strong>Stylish design</strong>:</td>\n<td>Gives the bike a classic look and makes it stand out from other modern motorcycles.</td>\n</tr>\n</tbody>\n</table>\n<h3 style=\"text-align:justify\"><br>\n<strong>Royal Enfield Classic 350 Variants</strong></h3>\n<p style=\"text-align:justify\">Royal Enfield offers Classic 350 in 6 variant models. Check out its ex-showroom price in the table below.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Variants</strong></td>\n<td style=\"text-align:justify\"><strong>Price in India</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Halcyon - Single Channel ABS&nbsp;</td>\n<td style=\"text-align:justify\">Rs 1.93 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Signals - Dual Channel ABS&nbsp;</td>\n<td style=\"text-align:justify\">Rs 2.11 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Dark - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 2.18 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Classic Chrome - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 2.21 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Reddtich - Single Channel ABS</td>\n<td style=\"text-align:justify\">Rs 1.19 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\">Classic 350 Halcyon&nbsp; - Dual Channel ABS</td>\n<td style=\"text-align:justify\">Rs 1.99 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Competitors in the Market</strong></h3>\n<p style=\"text-align:justify\">The new Royal Enfield Classic 350 is a bike that rules the heart of almost every bike enthusiast in the country. However, many brands have come out with a similar 350cc bike that gives tough competition to RE. Some of them include -&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td style=\"text-align:justify\"><strong>Benelli Imperial 400</strong></td>\n<td style=\"text-align:justify\">Rs 1.89 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Jawa Perak</strong></td>\n<td style=\"text-align:justify\">Rs 2.09 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Honda CB350RS</strong></td>\n<td style=\"text-align:justify\">Rs 2.05 - 2.06 Lakh</td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Jawa 42</strong></td>\n<td style=\"text-align:justify\">Rs 1.67 - 1.81 Lakh</td>\n</tr>\n</tbody>\n</table>\n<p style=\"text-align:justify\">&nbsp;</p>\n<h3 style=\"text-align:justify\"><strong>Royal Enfield Classic 350 Monthly Sales</strong></h3>\n<p style=\"text-align:justify\">Here’s what the Royal Enfield Classic 350 sales figures look like for the past 3 months.&nbsp;</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\" style=\"text-align:justify\"><strong>Model Name&nbsp;</strong></td>\n<td colspan=\"3\" rowspan=\"1\" style=\"text-align:center\"><strong>Units Sold in March 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>December 2022</strong></td>\n<td style=\"text-align:justify\"><strong>January 2023</strong></td>\n<td style=\"text-align:justify\"><strong>February 2023</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:justify\"><strong>Royal Enfield Classic 350&nbsp;</strong></td>\n<td style=\"text-align:center\">20,682</td>\n<td style=\"text-align:center\">26,134</td>\n<td style=\"text-align:center\">27,461</td>\n</tr>\n</tbody>\n</table>\n<h3 style=\"text-align:justify\"><br>\n<strong>Why BikeJunction for Royal Enfield Classic 350?</strong></h3>\n<p style=\"text-align:justify\">We at BikeJunction bring all the updated information on Royal Enfield Classic 350 under one roof. Users can now easily access the details on Classic 350 mileage, power output, handling, weight, other features and more.&nbsp;</p>\n<p style=\"text-align:justify\">Furthermore, using our easy-to-use bike comparison tool, you can compare RE Classic 350 with your other preferred options. You can also explore all the certified Royal Enfield dealership showrooms in your selected city and their accurate address &amp; contact details.&nbsp;</p>\n<p style=\"text-align:justify\">And lastly, you can scroll through our news section to access all the latest Royal Enfield and 2-wheeler industry updates. So, what are you waiting for? Bring home the keys to your next <strong><a href=\"https://bikes.tractorjunction.com/en/royal-enfield-bikes/\" target=\"_blank\"><span style=\"color:#f39c12\">Royal Enfield Bike</span></a></strong> today with BikeJunction!</p>\n<h3 style=\"text-align:justify\"><strong>Key Highlights of Royal Enfield Classic 350</strong></h3>\n<table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\n<tbody>\n<tr>\n<td><strong>Engine Capacity</strong></td>\n<td>349.34 cc</td>\n</tr>\n<tr>\n<td><strong>Mileage</strong></td>\n<td>41.55 kmpl</td>\n</tr>\n<tr>\n<td><strong>Kerb Weight</strong></td>\n<td>195 kg</td>\n</tr>\n<tr>\n<td><strong>Fuel Tank Capacity</strong></td>\n<td>13L</td>\n</tr>\n<tr>\n<td><strong>Max Power</strong></td>\n<td>20.21 PS @ 6100 rpm</td>\n</tr>\n</tbody>\n</table>\n"
}{
  "id": 1671,
  "url": "https://bikes.tractorjunction.com/en/electric-scooters/evolet/raptor",
  "content": "\n<p>The Evolet Raptor is a well known electric Scooter in the Electric vehicle sector of India. This Raptor Scooter is fitted with the cutting edge specification. It is equipped with all the features that help you glide better on the road. All the specifications of Evolet Raptor enhance the overall performance.</p>\n<p><strong>Evolet Raptor Price In India</strong>\n</p><p>Evolet Raptor price in India starts from 1 Lakh. The new model of this Raptor electric Scooter is available in 1 colours. In addition you can avail an updated price of Evolet Raptor on the basis of its colours &amp; variants. The Evolet Raptor electric Scooter on road price is different in every state on the basis of Govt. taxation norms.</p>\n<p><strong>Evolet Raptor Range</strong>\n</p><p>Evolet Raptor is fitted with a 72 V/40 Ah and has a Lithium-ion type of battery. This battery pack generates N/A power and N/A of Torque. The battery of Evolet Raptor is aligned with a Automatic transmission.</p>\n<p><strong>Evolet Raptor Brakes &amp; Suspension</strong>\n</p><p>Evolet Raptor delivers a Range of 150 KM in single charge. The Raptor comes with a Brushless Motor of Motor. This combination gives this Scooter a good driving range.</p>\n<p><strong>Why BikeJunction is the Best Platform To Buy Evolet Raptor Electric Scooter</strong>\n</p><p>Evolet Raptor at BikeJunction is available with complete information. In addition you can easily get the Evolet Raptor on-road price in India. You can easily compare Evolet Raptor Scooter with the other Scooter of this segment.</p>\n"
}{
  "id": 1016,
  "url": "https://bikes.tractorjunction.com/en/tvs-bikes/apache-rtr-160-4v",
  "content": "\n<p>TVS Apache RTR 160 4V Bike is one of India’s most reputed 2-wheelers. The Apache RTR 160 4V Bike is manufactured by TVS, popularly known for their technologically advanced manufacturing value. TVS Apache RTR 160 4V Bike belongs to the Bike category. The Bike boasts high-tech specifications like 159.7 CC engine that produces 17.39 bhp @ 9,250 rpm power, 45 Kmpl mileage and giving the most superior driving experience to its users. TVS Apache RTR 160 4V Bike is the kind of 2-wheeler that will turn heads wherever it’s driven.</p>\n<p><strong>TVS Apache RTR 160 4V Price In India</strong></p> <p>TVS Apache RTR 160 4V Price in India starts from ₹ 1.13 Lakh and goes up to ₹ 1.3 Lakh. BikeJunction provides you a complete list of the updated and accurate price range of TVS Apache RTR 160 4V Bike. However, it is necessary to know that the on-road price of the Apache RTR 160 4V Bike may differ from state to state, depending upon their specific government taxation policies.</p> <p><strong>TVS Apache RTR 160 4V Engine</strong></p>\n<p>TVS Apache RTR 160 4V engine capacity is 159.7 CC and engineered with Oil Cooled , 1 Cylinder, 4 Valve engine. This engine generates 17.39 bhp @ 9,250 rpm and 14.73 Nm @ 7,250 rpm of Torque. The engine of Apache RTR 160 4V is aligned with a 1 Down 4 Up gear transmission.</p> <p><strong>TVS Apache RTR 160 4V Mileage</strong></p>\n<p>TVS Apache RTR 160 4V mileage is 45 Kmpl which is very adequate. The Bike comes with a fuel tank capacity of 12 L litres. This combination gives this Bike a good driving range.</p>\n<p><strong>TVS Apache RTR 160 4V Brakes &amp; Suspension</strong></p>\n<p>TVS Apache RTR 160 4V comes with the top-of-the-line enhanced and powerful braking system. In addition, the 2-wheeler has powerful and strong brakes, giving maximum control to its users. The suspension system of the Apache RTR 160 4V Bike is also very impressive that ensures smoother drive experience while enabling the Bike to negotiate through rough terrains.</p>\n<p><strong>Why BikeJunction is Best For TVS Apache RTR 160 4V</strong></p>\n<p>TVS Apache RTR 160 4V at BikeJunction is available with complete information. In addition you can easily get the TVS Apache RTR 160 4V on-road price in India. BikeJunction also provides you a smart comparison tool that will let you comprehensively compare the TVS Apache RTR 160 4V Bike with your other top choices.</p>\n"
}